{
    "title": "Epitaxy",
    "url": "https://en.wikipedia.org/wiki/Epitaxy",
    "summary": "Epitaxy (prefix epi- means \"on top of”) refers to a type of crystal growth or material deposition in which new crystalline layers are formed with one or more well-defined orientations with respect to the crystalline seed layer. The deposited crystalline film is called an epitaxial film or epitaxial layer.  The relative orientation(s) of the epitaxial layer to the seed layer is defined in terms of the orientation of the crystal lattice of each material. For most epitaxial growths, the new layer is usually crystalline and each crystallographic domain of the overlayer must have a well-defined orientation relative to the substrate crystal structure. Epitaxy can involve single-crystal structures, although grain-to-grain epitaxy has been observed in granular films. For most technological applications, single-domain epitaxy, which is the growth of an overlayer crystal with one well-defined orientation with respect to the substrate crystal, is preferred. Epitaxy can also play an important role in the growth of superlattice structures.\nThe term epitaxy comes from the Greek roots epi (ἐπί), meaning \"above\", and taxis (τάξις), meaning \"an ordered manner\".\nOne of the main commercial applications of epitaxial growth is in the semiconductor industry, where semiconductor films are grown epitaxially on semiconductor substrate wafers.  For the case of epitaxial growth of a planar film atop a substrate wafer, the epitaxial film's lattice will have a specific orientation relative to the substrate wafer's crystalline lattice, such as the [001] Miller index of the film aligning with the [001] index of the substrate. In the simplest case, the epitaxial layer can be a continuation of the same semiconductor compound as the substrate; this is referred to as homoepitaxy.  Otherwise, the epitaxial layer will be composed of a different compound; this is referred to as heteroepitaxy.",
    "content": [
        {
            "section_title": "Types",
            "section_content": [
                {
                    "sentence": "Homoepitaxy is a kind of epitaxy performed with only one material, in which a crystalline film is grown on a substrate or film of the same material",
                    "refs": []
                },
                {
                    "sentence": "This technology is often used to grow a more pure film than the substrate and to fabricate layers with different doping levels",
                    "refs": []
                },
                {
                    "sentence": "In academic literature, homoepitaxy is often abbreviated to \"homoepi\".",
                    "refs": []
                },
                {
                    "sentence": "Homotopotaxy is a process similar to homoepitaxy except that the thin-film growth is not limited to two-dimensional growth",
                    "refs": []
                },
                {
                    "sentence": "Here the substrate is the thin-film material.",
                    "refs": []
                },
                {
                    "sentence": "Heteroepitaxy is a kind of epitaxy performed with materials that are different from each other",
                    "refs": []
                },
                {
                    "sentence": "In heteroepitaxy, a crystalline film grows on a crystalline substrate or film of a different material",
                    "refs": []
                },
                {
                    "sentence": "This technology is often used to grow crystalline films of materials for which crystals cannot otherwise be obtained and to fabricate integrated crystalline layers of different materials",
                    "refs": []
                },
                {
                    "sentence": "Examples include silicon on sapphire, gallium nitride (GaN) on sapphire, aluminium gallium indium phosphide (AlGaInP) on gallium arsenide (GaAs) or diamond or iridium,  and graphene on hexagonal boron nitride (hBN)",
                    "refs": [
                        "https://doi.org/10.1063%2F1.1337648"
                    ]
                },
                {
                    "sentence": "Heteroepitaxy occurs when a film of different composition and/or crystalline films grown on a substrate",
                    "refs": []
                },
                {
                    "sentence": "In this case, the amount of strain in the film is determined by the lattice mismatch Ԑ:",
                    "refs": []
                },
                {
                    "sentence": "ε=af−asaf{\\displaystyle \\varepsilon ={\\frac {a_{f}-a_{s}}{a_{f}}}}",
                    "refs": []
                },
                {
                    "sentence": "Where af{\\displaystyle a_{f}} and  as{\\displaystyle a_{s}} are the lattice constants of the film and the substrate",
                    "refs": []
                },
                {
                    "sentence": "The film and substrate could have similar lattice spacings but also different thermal expansion coefficients",
                    "refs": []
                },
                {
                    "sentence": "If a film is grown at a high temperature, it can experience large strains upon cooling to room temperature",
                    "refs": []
                },
                {
                    "sentence": "In reality, ε<9%{\\displaystyle \\varepsilon <9\\%} is necessary for obtaining epitaxy",
                    "refs": []
                },
                {
                    "sentence": "If ε{\\displaystyle \\varepsilon } is larger than that, the film experiences a volumetric strain that builds with each layer until a critical thickness",
                    "refs": []
                },
                {
                    "sentence": "With increased thickness, the elastic strain in the film is relieved by the formation of dislocations, which can become scattering centers that damage the quality of the structure",
                    "refs": []
                },
                {
                    "sentence": "Heteroepitaxy is commonly used to create so-called bandgap systems thanks to the additional energy caused by de deformation",
                    "refs": []
                },
                {
                    "sentence": "Silicon-germanium epitaxial layers are heavily used in CMOS microelectronics and silicon photonics",
                    "refs": []
                },
                {
                    "sentence": "Heterotopotaxy is a process similar to heteroepitaxy except that thin-film growth is not limited to two-dimensional growth; the substrate is similar only in structure to the thin-film material.",
                    "refs": []
                },
                {
                    "sentence": "Pendeo-epitaxy is a process in which the heteroepitaxial film is growing vertically and laterally simultaneously.In 2D crystal heterostructure, graphene nanoribbons embedded in hexagonal boron nitride   give an example of pendeo-epitaxy.",
                    "refs": [
                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5347129",
                        "https://arxiv.org/abs/1706.01655"
                    ]
                },
                {
                    "sentence": "Grain-to-grain epitaxy involves epitaxial growth between the grains of a multicrystalline epitaxial and seed layer",
                    "refs": []
                },
                {
                    "sentence": "This can usually occur when the seed layer only has an out-of-plane texture but no in-plane texture",
                    "refs": [
                        "https://doi.org/10.1021%2Facsanm.0c02265",
                        "https://doi.org/10.1063%2F1.342110"
                    ]
                },
                {
                    "sentence": "In such a case, the seed layer consists of grains with different in-plane textures",
                    "refs": []
                },
                {
                    "sentence": "The epitaxial overlayer then creates specific textures along each grain of the seed layer, due to lattice matching",
                    "refs": []
                },
                {
                    "sentence": "This kind of epitaxial growth doesn't involve single-crystal films.",
                    "refs": []
                },
                {
                    "sentence": "Epitaxy is used in silicon-based manufacturing processes for bipolar junction transistors (BJTs) and modern complementary metal–oxide–semiconductors (CMOS), but it is particularly important for compound semiconductors such as gallium arsenide",
                    "refs": []
                },
                {
                    "sentence": "Manufacturing issues include control of the amount and uniformity of the deposition's resistivity and thickness, the cleanliness and purity of the surface and the chamber atmosphere, the prevention of the typically much more highly doped substrate wafer's diffusion of dopant to the new layers, imperfections of the growth process, and protecting the surfaces during manufacture and handling.",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "Mechanism",
            "section_content": [
                {
                    "sentence": "Heteroepitaxial growth is classified into three primary growth modes-- Volmer–Weber (VW), Frank–van der Merwe (FM) and Stranski–Krastanov (SK)",
                    "refs": []
                },
                {
                    "sentence": "In the VW growth regime, the epitaxial film grows out of 3D nuclei on the growth surface",
                    "refs": []
                },
                {
                    "sentence": "In this mode, the adsorbate-adsorbate interactions are stronger than adsorbate-surface interactions, leading to island formation by local nucleation and the epitaxial layer is formed when the islands join.",
                    "refs": []
                },
                {
                    "sentence": "In the FM growth mode, adsorbate-surface and adsorbate-adsorbate interactions are balanced, which promotes 2D layer-by-layer or step-flow epitaxial growth.",
                    "refs": []
                },
                {
                    "sentence": "The SK mode is a combination of VW and FM modes",
                    "refs": []
                },
                {
                    "sentence": "In this mechanism, the growth initiates in the FM mode, forming 2D layers, but after reaching a critical thickness, enters a VW-like 3D island growth regime.",
                    "refs": []
                },
                {
                    "sentence": "Practical epitaxial growth, however, takes place in a high supersaturation regime, away from thermodynamic equilibrium",
                    "refs": []
                },
                {
                    "sentence": "In that case, the epitaxial growth is governed by adatom kinetics rather than thermodynamics, and 2D step-flow growth becomes dominant",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "Methods",
            "section_content": [],
            "subsections": [
                {
                    "section_title": "Vapor-phase",
                    "section_content": [
                        {
                            "sentence": "Homoepitaxial growth of semiconductor thin films are generally done by chemical or physical vapor deposition methods that deliver the precursors to the substrate in gaseous state",
                            "refs": []
                        },
                        {
                            "sentence": "For example, silicon is most commonly deposited from silicon tetrachloride (or germanium tetrachloride) and hydrogen at approximately 1200 to 1250 °C:",
                            "refs": [
                                "https://books.google.com/books?id=yQ5TAAAAMAAJ&pg=PA23"
                            ]
                        },
                        {
                            "sentence": "where (g) and (s) represent gas and solid phases, respectively",
                            "refs": []
                        },
                        {
                            "sentence": "This reaction is reversible, and the growth rate depends strongly upon the proportion of the two source gases",
                            "refs": []
                        },
                        {
                            "sentence": "Growth rates above 2 micrometres per minute produce polycrystalline silicon, and negative growth rates (etching) may occur if too much hydrogen chloride byproduct is present",
                            "refs": []
                        },
                        {
                            "sentence": "(Hydrogen chloride may be intentionally added to etch the wafer.) [citation needed] An additional etching reaction competes with the deposition reaction:",
                            "refs": []
                        },
                        {
                            "sentence": "Silicon VPE may also use silane, dichlorosilane, and trichlorosilane source gases",
                            "refs": []
                        },
                        {
                            "sentence": "For instance, the silane reaction occurs at 650 °C in this way:",
                            "refs": []
                        },
                        {
                            "sentence": "VPE is sometimes classified by the chemistry of the source gases, such as hydride VPE (HVPE) and metalorganic VPE (MOVPE or MOCVD).",
                            "refs": []
                        },
                        {
                            "sentence": "The reaction chamber where this process takes place may be heated by lamps located outside the chamber",
                            "refs": []
                        },
                        {
                            "sentence": "A common technique used in compound semiconductor growth is molecular beam epitaxy (MBE)",
                            "refs": [
                                "https://www.chiphistory.org/89-applied-materials-series-7600-epitaxial-reactor-system"
                            ]
                        },
                        {
                            "sentence": "In this method, a source material is heated to produce an evaporated beam of particles, which travel through a very high vacuum (10−8 Pa; practically free space) to the substrate and start epitaxial growth",
                            "refs": []
                        },
                        {
                            "sentence": "Chemical beam epitaxy, on the other hand, is an ultra-high vacuum process that uses gas phase precursors to generate the molecular beam",
                            "refs": [
                                "[ERROR retrieving ref link]",
                                "https://doi.org/10.1109%2F5.649646"
                            ]
                        },
                        {
                            "sentence": "Another widely used technique in microelectronics and nanotechnology is atomic layer epitaxy, in which precursor gases are alternatively pulsed into a chamber, leading to atomic monolayer growth by surface saturation and chemisorption.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Liquid-phase",
                    "section_content": [
                        {
                            "sentence": "Liquid-phase epitaxy (LPE) is a method to grow semiconductor crystal layers from the melt on solid substrates",
                            "refs": []
                        },
                        {
                            "sentence": "This happens at temperatures well below the melting point of the deposited semiconductor",
                            "refs": []
                        },
                        {
                            "sentence": "The semiconductor is dissolved in the melt of another material",
                            "refs": []
                        },
                        {
                            "sentence": "At conditions that are close to the equilibrium between dissolution and deposition, the deposition of the semiconductor crystal on the substrate is relatively fast and uniform",
                            "refs": []
                        },
                        {
                            "sentence": "The most used substrate is indium phosphide (InP)",
                            "refs": []
                        },
                        {
                            "sentence": "Other substrates like glass or ceramic can be applied for special applications",
                            "refs": []
                        },
                        {
                            "sentence": "To facilitate nucleation, and to avoid tension in the grown layer the thermal expansion coefficient of substrate and grown layer should be similar.",
                            "refs": []
                        },
                        {
                            "sentence": "Centrifugal liquid-phase epitaxy is used commercially to make thin layers of silicon, germanium, and gallium arsenide",
                            "refs": []
                        },
                        {
                            "sentence": "Centrifugally formed film growth is a process used to form thin layers of materials by using a centrifuge",
                            "refs": [
                                "https://books.google.com/books?id=e5mM5INQK9IC&pg=PA135",
                                "https://books.google.com/books?id=WM7kBwAAQBAJ&pg=PA192"
                            ]
                        },
                        {
                            "sentence": "The process has been used to create silicon for thin-film solar cells   and far-infrared photodetectors",
                            "refs": [
                                "http://sciencenordic.com/alternative-energy-environmental-technology-forskningno/speedy-production-of-silicon-for-solar-cells/1419392",
                                "https://books.google.com/books?id=CKfnCAAAQBAJ&pg=PA694"
                            ]
                        },
                        {
                            "sentence": "Temperature and centrifuge spin rate are used to control layer growth",
                            "refs": [
                                "https://ui.adsabs.harvard.edu/abs/2002SPIE.4486..200K"
                            ]
                        },
                        {
                            "sentence": "Centrifugal LPE has the capability to create dopant concentration gradients while the solution is held at constant temperature",
                            "refs": [
                                "https://books.google.com/books?id=WM7kBwAAQBAJ&pg=PA192"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Solid-phase",
                    "section_content": [
                        {
                            "sentence": "Solid-phase epitaxy (SPE) is a transition between the amorphous and crystalline phases of a material",
                            "refs": []
                        },
                        {
                            "sentence": "It is usually produced by depositing a film of amorphous material on a crystalline substrate, then heating it to crystallize the film",
                            "refs": []
                        },
                        {
                            "sentence": "The single-crystal substrate serves as a template for crystal growth",
                            "refs": []
                        },
                        {
                            "sentence": "The annealing step used to recrystallize or heal silicon layers amorphized during ion implantation is also considered to be a type of solid phase epitaxy",
                            "refs": []
                        },
                        {
                            "sentence": "The impurity segregation and redistribution at the growing crystal-amorphous layer interface during this process is used to incorporate low-solubility dopants in metals and silicon",
                            "refs": []
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Doping",
            "section_content": [
                {
                    "sentence": "An epitaxial layer can be doped during deposition by adding impurities to the source gas, such as arsine, phosphine, or diborane",
                    "refs": []
                },
                {
                    "sentence": "Dopants in the source gas, liberated by evaporation or wet etching of the surface, may also diffuse into the epitaxial layer and cause autodoping",
                    "refs": []
                },
                {
                    "sentence": "The concentration of impurity in the gas phase determines its concentration in the deposited film",
                    "refs": []
                },
                {
                    "sentence": "Doping can also be achieved by a site-competition technique, where the growth precursor ratios are tuned to enhance the incorporation of vacancies, specific dopant species or vacant-dopant clusters into the lattice",
                    "refs": []
                },
                {
                    "sentence": "Additionally, the high temperatures at which epitaxy is performed may allow dopants to diffuse into the growing layer from other layers in the wafer (out-diffusion).",
                    "refs": [
                        "https://ui.adsabs.harvard.edu/abs/1994ApPhL..65.1659L",
                        "https://doi.org/10.1021%2Faccountsmr.1c00097",
                        "https://ui.adsabs.harvard.edu/abs/2021PhRvB.104g5124H"
                    ]
                }
            ],
            "subsections": []
        },
        {
            "section_title": "Minerals",
            "section_content": [
                {
                    "sentence": "In mineralogy, epitaxy is the overgrowth of one mineral on another in an orderly way, such that certain crystal directions of the two minerals are aligned",
                    "refs": []
                },
                {
                    "sentence": "This occurs when some planes in the lattices of the overgrowth and the substrate have similar spacings between atoms",
                    "refs": []
                },
                {
                    "sentence": "If the crystals of both minerals are well formed so that the directions of the crystallographic axes are clear then the epitaxic relationship can be deduced just by a visual inspection",
                    "refs": []
                },
                {
                    "sentence": "Sometimes many separate crystals form the overgrowth on a single substrate, and then if there is epitaxy all the overgrowth crystals will have a similar orientation",
                    "refs": []
                },
                {
                    "sentence": "The reverse, however, is not necessarily true",
                    "refs": []
                },
                {
                    "sentence": "If the overgrowth crystals have a similar orientation there is probably an epitaxic relationship, but it is not certain",
                    "refs": []
                },
                {
                    "sentence": "Some authors  consider that overgrowths of a second generation of the same mineral species should also be considered as epitaxy, and this is common terminology for semiconductor scientists who induce epitaxic growth of a film with a different doping level on a semiconductor substrate of the same material",
                    "refs": [
                        "https://ui.adsabs.harvard.edu/abs/2010RoMin..85..173W"
                    ]
                },
                {
                    "sentence": "For naturally produced minerals, however, the International Mineralogical Association (IMA) definition requires that the two minerals be of different species",
                    "refs": []
                },
                {
                    "sentence": "Another man-made application of epitaxy is the making of artificial snow using silver iodide, which is possible because hexagonal silver iodide and ice have similar cell dimensions",
                    "refs": []
                }
            ],
            "subsections": [
                {
                    "section_title": "Isomorphic minerals",
                    "section_content": [
                        {
                            "sentence": "Minerals that have the same structure (isomorphic minerals) may have epitaxic relations",
                            "refs": []
                        },
                        {
                            "sentence": "An example is albite NaAlSi3O8 on microcline KAlSi3O8",
                            "refs": []
                        },
                        {
                            "sentence": "Both these minerals are triclinic, with space group 1, and with similar unit cell parameters, a = 8.16 Å, b = 12.87 Å, c = 7.11 Å, α = 93.45°, β = 116.4°, γ = 90.28° for albite and a = 8.5784 Å, b = 12.96 Å, c = 7.2112 Å, α = 90.3°, β = 116.05°, γ = 89° for microcline.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Polymorphic minerals",
                    "section_content": [
                        {
                            "sentence": "Minerals that have the same composition but different structures (polymorphic minerals) may also have epitaxic relations",
                            "refs": []
                        },
                        {
                            "sentence": "Examples are pyrite and marcasite, both FeS2, and sphalerite and wurtzite, both ZnS",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Rutile on hematite",
                    "section_content": [
                        {
                            "sentence": "Some pairs of minerals that are not related structurally or compositionally may also exhibit epitaxy",
                            "refs": []
                        },
                        {
                            "sentence": "A common example is rutile TiO2 on hematite Fe2O3",
                            "refs": []
                        },
                        {
                            "sentence": "Rutile is tetragonal and hematite is trigonal, but there are directions of similar spacing between the atoms in the (100) plane of rutile (perpendicular to the a axis) and the (001) plane of hematite (perpendicular to the c axis)",
                            "refs": [
                                "https://ui.adsabs.harvard.edu/abs/2006RoMin..81..317R",
                                "http://www.mineral-forum.com/message-board/"
                            ]
                        },
                        {
                            "sentence": "In epitaxy these directions tend to line up with each other, resulting in the axis of the rutile overgrowth being parallel to the c axis of hematite, and the c axis of rutile being parallel to one of the axes of hematite",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Hematite on magnetite",
                    "section_content": [
                        {
                            "sentence": "Another example is hematite Fe3+2O3 on magnetite Fe2+Fe3+2O4",
                            "refs": []
                        },
                        {
                            "sentence": "The magnetite structure is based on close-packed oxygen anions stacked in an ABC-ABC sequence",
                            "refs": []
                        },
                        {
                            "sentence": "In this packing the close-packed layers are parallel to (111) (a plane that symmetrically \"cuts off\" a corner of a cube)",
                            "refs": []
                        },
                        {
                            "sentence": "The hematite structure is based on close-packed oxygen anions stacked in an AB-AB sequence, which results in a crystal with hexagonal symmetry",
                            "refs": []
                        },
                        {
                            "sentence": "If the cations were small enough to fit into a truly close-packed structure of oxygen anions then the spacing between the nearest neighbour oxygen sites would be the same for both species",
                            "refs": []
                        },
                        {
                            "sentence": "The radius of the oxygen ion, however, is only 1.36 Å  and the Fe cations are big enough to cause some variations",
                            "refs": [
                                "https://books.google.com/books?id=8ybwAAAAMAAJ"
                            ]
                        },
                        {
                            "sentence": "The Fe radii vary from 0.49 Å to 0.92 Å,  depending on the charge (2+ or 3+) and the coordination number (4 or 8)",
                            "refs": [
                                "http://abulafia.mt.ic.ac.uk/shannon/ptable.php"
                            ]
                        },
                        {
                            "sentence": "Nevertheless, the O spacings are similar for the two minerals hence hematite can readily grow on the (111) faces of magnetite, with hematite (001) parallel to magnetite (111)",
                            "refs": []
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Applications",
            "section_content": [
                {
                    "sentence": "Epitaxy is used in nanotechnology and in semiconductor fabrication",
                    "refs": []
                },
                {
                    "sentence": "Indeed, epitaxy is the only affordable method of high quality crystal growth for many semiconductor materials",
                    "refs": []
                },
                {
                    "sentence": "In surface science, epitaxy is used to create and study monolayer and multilayer films of adsorbed organic molecules on single crystalline surfaces via scanning tunnelling microscopy",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "See also",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "References",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "Bibliography",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "External links",
            "section_content": [],
            "subsections": []
        }
    ],
    "references": {
        "1": "https://doi.org/10.1021%2Facsanm.0c02265",
        "2": "https://doi.org/10.1063%2F1.342110",
        "3": "ISBN: 8755022987",
        "4": "https://books.google.com/books?id=DShEAAAAQBAJ",
        "5": "https://doi.org/10.1063%2F1.1337648",
        "6": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4382696",
        "7": "http://www.iop.org/EJ/abstract/0268-1242/19/10/R02",
        "8": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5347129",
        "9": "https://arxiv.org/abs/1706.01655",
        "10": "https://ui.adsabs.harvard.edu/abs/1958ZK....110..372B/abstract",
        "11": "https://infoscience.epfl.ch/record/135795",
        "12": "https://books.google.com/books?id=yQ5TAAAAMAAJ&pg=PA23",
        "13": "https://www.chiphistory.org/89-applied-materials-series-7600-epitaxial-reactor-system",
        "14": "[ERROR retrieving ref link]",
        "15": "https://doi.org/10.1109%2F5.649646",
        "16": "https://ui.adsabs.harvard.edu/abs/1989JCrGr..95..121T",
        "17": "https://books.google.com/books?id=e5mM5INQK9IC&pg=PA135",
        "18": "https://books.google.com/books?id=WM7kBwAAQBAJ&pg=PA192",
        "19": "http://sciencenordic.com/alternative-energy-environmental-technology-forskningno/speedy-production-of-silicon-for-solar-cells/1419392",
        "20": "https://books.google.com/books?id=CKfnCAAAQBAJ&pg=PA694",
        "21": "https://ui.adsabs.harvard.edu/abs/2002SPIE.4486..200K",
        "22": "https://books.google.com/books?id=fsXoCAAAQBAJ&pg=PA67",
        "23": "https://ui.adsabs.harvard.edu/abs/1994JAP....75.2809C",
        "24": "https://ui.adsabs.harvard.edu/abs/1994ApPhL..65.1659L",
        "25": "https://doi.org/10.1021%2Faccountsmr.1c00097",
        "26": "https://ui.adsabs.harvard.edu/abs/2021PhRvB.104g5124H",
        "27": "https://ui.adsabs.harvard.edu/abs/2006RoMin..81..317R",
        "28": "https://ui.adsabs.harvard.edu/abs/2010RoMin..85..173W",
        "29": "[ERROR retrieving ref link]",
        "30": "http://www.mineral-forum.com/message-board/",
        "31": "[ERROR retrieving ref link]",
        "32": "https://books.google.com/books?id=8ybwAAAAMAAJ",
        "33": "http://abulafia.mt.ic.ac.uk/shannon/ptable.php",
        "34": "https://ui.adsabs.harvard.edu/abs/2011PCCP...1320724W",
        "35": "https://ui.adsabs.harvard.edu/abs/2012PCCP...1410726W"
    },
    "flair_entities": [
        "epitaxy",
        "fm",
        "abc-abc",
        "international mineralogical association",
        "heteroepitaxy",
        "ima",
        "heterotopotaxy",
        "stranski–krastanov",
        "sk",
        "vw",
        "greek",
        "fes2",
        "homotopotaxy",
        "volmer–weber",
        "centrifugal lpe",
        "miller",
        "heteroepitaxial",
        "vpe",
        "pendeo-epitaxy",
        "kalsi3o8",
        "frank–van der merwe",
        "homoepitaxy",
        "naalsi3o8"
    ]
}