{
    "title": "Natural_disaster",
    "url": "https://en.wikipedia.org/wiki/Natural_disaster",
    "summary": "A natural disaster is the very harmful impact on a society or community after a natural hazard event. Some examples of natural hazard events include avalanches, droughts, earthquakes, floods, heat waves, landslides, tropical cyclones, volcanic activity and wildfires. Additional natural hazards include blizzards, dust storms, firestorms, hails, ice storms, sinkholes, thunderstorms, tornadoes and tsunamis. A natural disaster can cause loss of life or damage property. It typically causes economic damage. How bad the damage is depends on how well people are prepared for disasters and how strong the buildings, roads, and other structures are. Scholars have been saying that the term natural disaster is unsuitable and should be abandoned. Instead, the simpler term disaster could be used. At the same time the type of hazard would be specified. A disaster happens when a natural or human-made hazard impacts a vulnerable community. It results from the combination of the hazard and the exposure of a vulnerable society.\nNowadays it is hard to distinguish between natural and human-made disasters. The term natural disaster was already challenged in 1976. Human choices in architecture, fire risk, and resource management can cause or worsen natural disasters. Climate change also affects how often disasters due to extreme weather hazards happen. These \"climate hazards\" are floods, heat waves, wildfires, tropical cyclones, and the like.\n\nSome things can make natural disasters worse. Examples are inadequate building norms, marginalization of people and poor choices on land use planning. Many developing countries do not have proper disaster risk reduction systems. This makes them more vulnerable to natural disasters than high income countries. An adverse event only becomes a disaster if it occurs in an area with a vulnerable population.",
    "content": [
        {
            "section_title": "Terminology",
            "section_content": [
                {
                    "sentence": "A natural disaster is the highly harmful impact on a society or community following a natural hazard event",
                    "refs": []
                },
                {
                    "sentence": "The term \"disaster\" itself is defined as follows: \"Disasters are serious disruptions to the functioning of a community that exceed its capacity to cope using its own resources",
                    "refs": []
                },
                {
                    "sentence": "Disasters can be caused by natural, man-made and technological hazards, as well as various factors that influence the exposure and vulnerability of a community.\"",
                    "refs": [
                        "https://www.ifrc.org/our-work/disasters-climate-and-crises/what-disaster"
                    ]
                },
                {
                    "sentence": "The US Federal Emergency Management Agency (FEMA) explains the relationship between natural disasters and natural hazards as follows: \"Natural hazards and natural disasters are related but are not the same",
                    "refs": []
                },
                {
                    "sentence": "A natural hazard is the threat of an event that will likely have a negative impact",
                    "refs": []
                },
                {
                    "sentence": "A natural disaster is the negative impact following an actual occurrence of natural hazard in the event that it significantly harms a community",
                    "refs": []
                },
                {
                    "sentence": "An example of the distinction between a natural hazard and a disaster is that an earthquake is the hazard which caused the 1906 San Francisco earthquake disaster.",
                    "refs": [
                        "https://hazards.fema.gov/nri/natural-hazards"
                    ]
                },
                {
                    "sentence": "A natural hazard  is a natural phenomenon that might have a negative effect on humans and other animals, or the environment",
                    "refs": [
                        "http://www.oas.org/dsd/publications/Unit/oea54e/oea54e.pdf"
                    ]
                },
                {
                    "sentence": "Natural hazard events can be classified into two broad categories: geophysical and biological",
                    "refs": []
                },
                {
                    "sentence": "Natural hazards can be provoked or affected by anthropogenic processes, e.g",
                    "refs": [
                        "ISBN: 978-0898621594"
                    ]
                },
                {
                    "sentence": "land-use change, drainage and construction",
                    "refs": []
                },
                {
                    "sentence": "There are 18 natural hazards included in the National Risk Index of FEMA: avalanche, coastal flooding, cold wave, drought, earthquake, hail, heat wave, tropical cyclone, ice storm, landslide, lightning, riverine flooding, strong wind, tornado, tsunami, volcanic activity, wildfire, winter weather",
                    "refs": []
                },
                {
                    "sentence": "In addition, there are also dust storms.",
                    "refs": [
                        "https://hazards.fema.gov/nri/natural-hazards"
                    ]
                }
            ],
            "subsections": [
                {
                    "section_title": "Critique",
                    "section_content": [
                        {
                            "sentence": "The term natural disaster has been called a misnomer already in 1976",
                            "refs": []
                        },
                        {
                            "sentence": "A disaster is a result of a natural hazard impacting a vulnerable community",
                            "refs": [
                                "https://www.preventionweb.net/news/why-natural-disasters-arent-all-natural"
                            ]
                        },
                        {
                            "sentence": "But disasters can be avoided",
                            "refs": []
                        },
                        {
                            "sentence": "Earthquakes, droughts, floods, storms, and other events lead to disasters because of human action and inaction",
                            "refs": []
                        },
                        {
                            "sentence": "Poor land and policy planning and deregulation can create worse conditions",
                            "refs": []
                        },
                        {
                            "sentence": "They often involve development activities that ignore or fail to reduce the disaster risks",
                            "refs": []
                        },
                        {
                            "sentence": "Nature alone is blamed for disasters even when disasters result from failures in development",
                            "refs": []
                        },
                        {
                            "sentence": "Disasters also result from failure of societies to prepare",
                            "refs": []
                        },
                        {
                            "sentence": "Examples for such failures include inadequate building norms, marginalization of people, inequities, overexploitation of resources, extreme urban sprawl and climate change",
                            "refs": []
                        },
                        {
                            "sentence": "Defining disasters as solely natural events has serious implications when it comes to understanding the causes of a disaster and the distribution of political and financial responsibility in disaster risk reduction, disaster management, compensation, insurance and disaster prevention",
                            "refs": []
                        },
                        {
                            "sentence": "Using natural to describe disasters misleads people to think the devastating results are inevitable, out of our control, and are simply part of a natural process",
                            "refs": [
                                "https://www.preventionweb.net/blog/time-say-goodbye-natural-disasters"
                            ]
                        },
                        {
                            "sentence": "Hazards (earthquakes, hurricanes, pandemics, drought etc.) are inevitable, but the impact they have on society is not.",
                            "refs": []
                        },
                        {
                            "sentence": "Thus, the term natural disaster is unsuitable and should be abandoned in favor of the simpler term disaster, while also specifying the category (or type) of hazard",
                            "refs": []
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Scale",
            "section_content": [],
            "subsections": [
                {
                    "section_title": "By region and country",
                    "section_content": [
                        {
                            "sentence": "As of 2019, the countries with the highest share of disability-adjusted life years (DALY) lost due to natural disasters are Bahamas, Haiti, Zimbabwe and Armenia (probably mainly due to the Spitak Earthquake)",
                            "refs": []
                        },
                        {
                            "sentence": "The Asia-Pacific region is the world's most disaster prone region",
                            "refs": [
                                "https://www.who.int/data/gho/data/themes/mortality-and-global-health-estimates/global-health-estimates-leading-causes-of-dalys",
                                "https://www.who.int/docs/default-source/gho-documents/global-health-estimates/ghe2019_dalys-2019-country.xlsx"
                            ]
                        },
                        {
                            "sentence": "A person in Asia-Pacific is five times more likely to be hit by a natural disaster than someone living in other regions",
                            "refs": [
                                "[ERROR retrieving ref link]"
                            ]
                        },
                        {
                            "sentence": "Between 1995 and 2015, the greatest number of natural disasters occurred in America, China and India",
                            "refs": []
                        },
                        {
                            "sentence": "In 2012, there were 905 natural disasters worldwide, 93% of which were weather-related disasters",
                            "refs": [
                                "https://www.economist.com/blogs/graphicdetail/2017/08/daily-chart-19"
                            ]
                        },
                        {
                            "sentence": "Overall costs were US$170 billion and insured losses $70 billion",
                            "refs": []
                        },
                        {
                            "sentence": "2012 was a moderate year",
                            "refs": []
                        },
                        {
                            "sentence": "45% were meteorological (storms), 36% were hydrological (floods), 12% were climatological (heat waves, cold waves, droughts, wildfires) and 7% were geophysical events (earthquakes and volcanic eruptions)",
                            "refs": []
                        },
                        {
                            "sentence": "Between 1980 and 2011 geophysical events accounted for 14% of all natural catastrophes",
                            "refs": []
                        },
                        {
                            "sentence": "Developing countries often have ineffective communication systems as well as insufficient support for disaster risk reduction and emergency management",
                            "refs": []
                        },
                        {
                            "sentence": "This makes them more vulnerable to natural disasters than high income countries.",
                            "refs": [
                                "https://doi.org/10.1007/978-3-319-59002-8_4"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Slow and rapid onset events",
                    "section_content": [
                        {
                            "sentence": "Natural hazards occur across different time scales as well as area scales",
                            "refs": []
                        },
                        {
                            "sentence": "Tornadoes and flash floods are rapid onset events, meaning they occur with a short warning time and are short-lived",
                            "refs": []
                        },
                        {
                            "sentence": "Slow onset events can also be very damaging, for example drought is a natural hazards that develops slowly, sometimes over years",
                            "refs": []
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Impacts",
            "section_content": [
                {
                    "sentence": "A natural disaster may cause loss of life, injury or other health impacts, property damage, loss of livelihoods and services, social and economic disruption, or environmental damage.",
                    "refs": []
                }
            ],
            "subsections": [
                {
                    "section_title": "On death rates",
                    "section_content": [
                        {
                            "sentence": "Globally, the total number of deaths from natural disasters has been reduced by 75% over the last 100 years, due to the increased development of countries, increased preparedness, better education, better methods, and aid from international organizations",
                            "refs": []
                        },
                        {
                            "sentence": "Since the global population has grown over the same time period, the decrease in number of deaths per capita is larger, dropping to 6% of the original amount",
                            "refs": []
                        },
                        {
                            "sentence": "The death rate from natural disasters is highest in developing countries due to the lower quality of building construction, infrastructure, and medical facilities",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "On the economy",
                    "section_content": [
                        {
                            "sentence": "Global economic losses due to extreme weather, climate and water events are increasing",
                            "refs": []
                        },
                        {
                            "sentence": "Costs have increased sevenfold from the 1970s to the 2010s",
                            "refs": []
                        },
                        {
                            "sentence": ": 16  Direct losses from disasters have averaged above US$330 billion annually between 2015 and 2021",
                            "refs": [
                                "https://library.wmo.int/idurl/4/57564"
                            ]
                        },
                        {
                            "sentence": ": 21  Socio-economic factors have contributed to this trend of increasing losses, such as population growth and increased wealth",
                            "refs": [
                                "https://sendaiframework-mtr.undrr.org/publication/report-midterm-review-implementation-sendai-framework-disaster-risk-reduction-2015-2030"
                            ]
                        },
                        {
                            "sentence": "This shows that increased exposure is the most important driver of economic losses",
                            "refs": [
                                "https://doi.org/10.1007%2F978-3-319-72026-5_3"
                            ]
                        },
                        {
                            "sentence": "However, part of these are also due to human-induced climate change",
                            "refs": []
                        },
                        {
                            "sentence": ": 1611",
                            "refs": [
                                "https://doi.org/10.1017%2F9781009157896.013",
                                "https://doi.org/10.1038%2Fs41467-023-41888-1"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "On the environment",
                    "section_content": [
                        {
                            "sentence": "During emergencies such as natural disasters and armed conflicts more waste may be produced, while waste management is given low priority compared with other services",
                            "refs": []
                        },
                        {
                            "sentence": "Existing waste management services and infrastructures can be disrupted, leaving communities with unmanaged waste and increased littering",
                            "refs": []
                        },
                        {
                            "sentence": "Under these circumstances human health and the environment are often negatively impacted",
                            "refs": []
                        },
                        {
                            "sentence": "Natural disasters (e.g",
                            "refs": []
                        },
                        {
                            "sentence": "earthquakes, tsunamis, hurricanes) have the potential to generate a significant amount of waste within a short period",
                            "refs": []
                        },
                        {
                            "sentence": "Waste management systems can be out of action or curtailed, often requiring considerable time and funding to restore",
                            "refs": []
                        },
                        {
                            "sentence": "For example, the tsunami in Japan in 2011 produced huge amounts of debris: estimates of 5 million tonnes of waste were reported by the Japanese Ministry of the Environment",
                            "refs": []
                        },
                        {
                            "sentence": "Some of this waste, mostly plastic and styrofoam washed up on the coasts of Canada and the United States in late 2011",
                            "refs": []
                        },
                        {
                            "sentence": "Along the west coast of the United States, this increased the amount of litter by a factor of 10 and may have transported alien species",
                            "refs": []
                        },
                        {
                            "sentence": "Storms are also important generators of plastic litter",
                            "refs": []
                        },
                        {
                            "sentence": "A study by Lo et al",
                            "refs": []
                        },
                        {
                            "sentence": "(2020) reported a 100% increase in the amount of microplastics on beaches surveyed following a typhoon in Hong Kong in 2018",
                            "refs": []
                        },
                        {
                            "sentence": "A significant amount of plastic waste can be produced during disaster relief operations",
                            "refs": []
                        },
                        {
                            "sentence": "Following the 2010 earthquake in Haiti, the generation of waste from relief operations was referred to as a \"second disaster\"",
                            "refs": []
                        },
                        {
                            "sentence": "The United States military reported that millions of water bottles and styrofoam food packages were distributed although there was no operational waste management system",
                            "refs": []
                        },
                        {
                            "sentence": "Over 700,000 plastic tarpaulins and 100,000 tents were required for emergency shelters",
                            "refs": []
                        },
                        {
                            "sentence": "The increase in plastic waste, combined with poor disposal practices, resulted in open drainage channels being blocked, increasing the risk of disease",
                            "refs": []
                        },
                        {
                            "sentence": "Conflicts can result in large-scale displacement of communities",
                            "refs": []
                        },
                        {
                            "sentence": "People living under these conditions are often provided with minimal waste management facilities",
                            "refs": []
                        },
                        {
                            "sentence": "Burn pits are widely used to dispose of mixed wastes, including plastics",
                            "refs": []
                        },
                        {
                            "sentence": "Air pollution can lead to respiratory and other illnesses",
                            "refs": []
                        },
                        {
                            "sentence": "For example, Sahrawi refugees have been living in five camps near Tindouf, Algeria for nearly 45 years",
                            "refs": []
                        },
                        {
                            "sentence": "As waste collection services are underfunded and there is no recycling facility, plastics have flooded the camps' streets and surroundings",
                            "refs": []
                        },
                        {
                            "sentence": "In contrast, the Azraq camp in Jordan for refugees from Syria has waste management services; of 20.7 tonnes of waste produced per day, 15% is recyclable",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "On women and vulnerable populations",
                    "section_content": [
                        {
                            "sentence": "Because of the social, political and cultural context of many places throughout the world, women are often disproportionately affected by disaster",
                            "refs": []
                        },
                        {
                            "sentence": "In the 2004 Indian Ocean tsunami, more women died than men, partly due to the fact that fewer women knew how to swim",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3100103"
                            ]
                        },
                        {
                            "sentence": "During and after a natural disaster, women are at increased risk of being affected by gender based violence and are increasingly vulnerable to sexual violence",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3100103"
                            ]
                        },
                        {
                            "sentence": "Disrupted police enforcement, lax regulations, and displacement all contribute to increased risk of gender based violence and sexual assault",
                            "refs": []
                        },
                        {
                            "sentence": "In addition to LGBT people and immigrants, women are also disproportionately victimized by religion-based scapegoating for natural disasters: fanatical religious leaders or adherents may claim that a god or gods are angry with women's independent, freethinking behavior, such as dressing 'immodestly', having sex or abortions",
                            "refs": []
                        },
                        {
                            "sentence": "For example, Hindutva party Hindu Makkal Katchi and others blamed women's struggle for the right to enter the Sabarimala temple for the August 2018 Kerala floods, purportedly inflicted by the angry god Ayyappan",
                            "refs": [
                                "https://www.theguardian.com/environment/commentisfree/2015/sep/01/easiest-way-respond-natural-disaster-blame-god-global-warming"
                            ]
                        },
                        {
                            "sentence": "During and after natural disasters, routine health behaviors become interrupted",
                            "refs": []
                        },
                        {
                            "sentence": "In addition, health care systems may have broken down as a result of the disaster, further reducing access to contraceptives",
                            "refs": []
                        },
                        {
                            "sentence": "Unprotected intercourse during this time can lead to increased rates of childbirth, unintended pregnancies and sexually transmitted infections (STIs)",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3100103"
                            ]
                        },
                        {
                            "sentence": "Pregnant women are one of the groups disproportionately affected by natural disasters",
                            "refs": []
                        },
                        {
                            "sentence": "Inadequate nutrition, little access to clean water, lack of health-care services and psychological stress in the aftermath of the disaster can lead to a significant increase in maternal morbidity and mortality",
                            "refs": []
                        },
                        {
                            "sentence": "Furthermore, shortage of healthcare resources during this time can convert even routine obstetric complications into emergencies",
                            "refs": []
                        },
                        {
                            "sentence": "Once a vulnerable population has experienced a disaster, the community can take many years to repair and that repair period can lead to further vulnerability",
                            "refs": []
                        },
                        {
                            "sentence": "The disastrous consequences of natural disaster also affect the mental health of affected communities, often leading to post-traumatic symptoms",
                            "refs": []
                        },
                        {
                            "sentence": "These increased emotional experiences can be supported through collective processing, leading to resilience and increased community engagement",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "On governments and voting processes",
                    "section_content": [
                        {
                            "sentence": "Disasters stress government capacity, as the government tries to conduct routine as well as emergency operations",
                            "refs": []
                        },
                        {
                            "sentence": "Some theorists of voting behavior propose that citizens update information about government effectiveness based on their response to disasters, which affects their vote choice in the next election",
                            "refs": [
                                "https://library.oapen.org/handle/20.500.12657/32368"
                            ]
                        },
                        {
                            "sentence": "Indeed, some evidence, based on data from the United States, reveals that incumbent parties can lose votes if citizens perceives them as responsible for a poor disaster response  or gain votes based on perceptions of well-executed relief work",
                            "refs": [
                                "https://www.aeaweb.org/articles?id=10.1257/mic.20150349",
                                "https://doi.org/10.1111%2Fj.1540-5907.2010.00503.x"
                            ]
                        },
                        {
                            "sentence": "The latter study also finds, however, that voters do not reward incumbent parties for disaster preparedness, which may end up affecting government incentives to invest in such preparedness",
                            "refs": [
                                "https://www.cambridge.org/core/journals/american-political-science-review/article/abs/myopic-voters-and-natural-disaster-policy/039708A3223EC114365ADF56F1D26423"
                            ]
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Disasters caused by geological hazards",
            "section_content": [],
            "subsections": [
                {
                    "section_title": "Landslides",
                    "section_content": [],
                    "subsections": []
                },
                {
                    "section_title": "Avalanches",
                    "section_content": [],
                    "subsections": []
                },
                {
                    "section_title": "Earthquakes",
                    "section_content": [
                        {
                            "sentence": "An earthquake is the result of a sudden release of energy in the Earth's crust that creates seismic waves",
                            "refs": []
                        },
                        {
                            "sentence": "At the Earth's surface, earthquakes manifest themselves by vibration, shaking, and sometimes displacement of the ground",
                            "refs": []
                        },
                        {
                            "sentence": "Earthquakes are caused by slippage within geological faults",
                            "refs": []
                        },
                        {
                            "sentence": "The underground point of origin of the earthquake is called the seismic focus",
                            "refs": []
                        },
                        {
                            "sentence": "The point directly above the focus on the surface is called the epicenter",
                            "refs": []
                        },
                        {
                            "sentence": "Earthquakes by themselves rarely kill people or wildlife – it is usually the secondary events that they trigger, such as building collapse, fires, tsunamis and volcanic eruptions, that cause death",
                            "refs": []
                        },
                        {
                            "sentence": "Many of these can possibly be avoided by better construction, safety systems, early warning and planning",
                            "refs": []
                        },
                        {
                            "sentence": "[citation needed]",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Sinkholes",
                    "section_content": [
                        {
                            "sentence": "A sinkhole is a depression or hole in the ground caused by some form of collapse of the surface layer",
                            "refs": []
                        },
                        {
                            "sentence": "When natural erosion, human mining or underground excavation makes the ground too weak to support the structures built on it, the ground can collapse and produce a sinkhole.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Coastal erosion",
                    "section_content": [
                        {
                            "sentence": "Coastal erosion is a physical process by which shorelines in coastal areas around the world shift and change, primarily in response to waves and currents that can be influenced by tides and storm surge",
                            "refs": []
                        },
                        {
                            "sentence": "Coastal erosion can result from long-term processes (see also beach evolution) as well as from episodic events such as tropical cyclones or other severe storm events",
                            "refs": [
                                "ISBN: 9780849302251"
                            ]
                        },
                        {
                            "sentence": "Coastal erosion is one of the most significant coastal hazards",
                            "refs": []
                        },
                        {
                            "sentence": "It forms a threat to infrastructure, capital assets and property.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Volcanic eruptions",
                    "section_content": [
                        {
                            "sentence": "Volcanoes can cause widespread destruction and consequent disaster in several ways",
                            "refs": []
                        },
                        {
                            "sentence": "One hazard is the volcanic eruption itself, with the force of the explosion and falling rocks able to cause harm",
                            "refs": []
                        },
                        {
                            "sentence": "Lava may also be released during the eruption of a volcano; as it leaves the volcano, it can destroy buildings, plants and animals due to its extreme heat",
                            "refs": []
                        },
                        {
                            "sentence": "In addition, volcanic ash may form a cloud (generally after cooling) and settle thickly in nearby locations",
                            "refs": []
                        },
                        {
                            "sentence": "When mixed with water, this forms a concrete-like material",
                            "refs": []
                        },
                        {
                            "sentence": "In sufficient quantities, ash may cause roofs to collapse under its weight",
                            "refs": []
                        },
                        {
                            "sentence": "Even small quantities will harm humans if inhaled – it has the consistency of ground glass and therefore causes laceration to the throat and lungs",
                            "refs": []
                        },
                        {
                            "sentence": "Volcanic ash can also cause abrasion damage to moving machinery such as engines",
                            "refs": []
                        },
                        {
                            "sentence": "The main killer of humans in the immediate surroundings of a volcanic eruption is pyroclastic flows, consisting of a cloud of hot ash which builds up in the air above the volcano and rushes down the slopes when the eruption no longer supports the lifting of the gases",
                            "refs": []
                        },
                        {
                            "sentence": "It is believed that Pompeii was destroyed by a pyroclastic flow",
                            "refs": []
                        },
                        {
                            "sentence": "A lahar is a volcanic mudflow or landslide",
                            "refs": []
                        },
                        {
                            "sentence": "The 1953 Tangiwai disaster was caused by a lahar, as was the 1985 Armero tragedy in which the town of Armero was buried and an estimated 23,000 people were killed",
                            "refs": []
                        },
                        {
                            "sentence": "[citation needed]",
                            "refs": []
                        },
                        {
                            "sentence": "Volcanoes rated at 8 (the highest level) on the volcanic explosivity index are known as supervolcanoes",
                            "refs": []
                        },
                        {
                            "sentence": "According to the Toba catastrophe theory, 75,000 to 80,000 years ago, a supervolcanic eruption at what is now Lake Toba in Sumatra reduced the human population to 10,000 or even 1,000 breeding pairs, creating a bottleneck in human evolution,  and killed three-quarters of all plant life in the northern hemisphere",
                            "refs": [
                                "https://www.science.org/content/article/human-ancestors-were-endangered-species"
                            ]
                        },
                        {
                            "sentence": "However, there is considerable debate regarding the veracity of this theory",
                            "refs": []
                        },
                        {
                            "sentence": "The main danger from a supervolcano is the immense cloud of ash, which has a disastrous global effect on climate and temperature for many years.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Tsunami",
                    "section_content": [
                        {
                            "sentence": "A tsunami (plural: tsunamis or tsunami; from Japanese: 津波, lit",
                            "refs": []
                        },
                        {
                            "sentence": "\"harbour wave\"; English pronunciation: /tsuːˈnɑːmi/), also known as a seismic sea wave or tidal wave, is a series of waves in a water body caused by the displacement of a large volume of water, generally in an ocean or a large lake",
                            "refs": []
                        },
                        {
                            "sentence": "Tsunamis can be caused by undersea earthquakes such as the 2004 Boxing Day tsunami, or by landslides such as the one in 1958 at Lituya Bay, Alaska, or by volcanic eruptions such as the ancient eruption of Santorini",
                            "refs": []
                        },
                        {
                            "sentence": "On March 11, 2011, a tsunami occurred near Fukushima, Japan and spread through the Pacific Ocean.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Disasters caused by extreme weather hazards",
            "section_content": [
                {
                    "sentence": "Some of the 18 natural hazards included in the National Risk Index of FEMA  now have a higher probability of occurring, and at higher intensity, due to the effects of climate change",
                    "refs": [
                        "https://hazards.fema.gov/nri/natural-hazards"
                    ]
                },
                {
                    "sentence": "This applies to heat waves, droughts, wildfire and coastal flooding",
                    "refs": []
                },
                {
                    "sentence": ": 9",
                    "refs": [
                        "https://www.ipcc.ch/report/ar6/wg2/downloads/report/IPCC_AR6_WGII_SummaryForPolicymakers.pdf"
                    ]
                }
            ],
            "subsections": [
                {
                    "section_title": "Hot and dry conditions",
                    "section_content": [],
                    "subsections": [
                        {
                            "section_title": "Heat waves",
                            "section_content": [
                                {
                                    "sentence": "A heat wave is a period of unusually and excessively hot weather",
                                    "refs": []
                                },
                                {
                                    "sentence": "Heat waves are rare and require specific combinations of weather events to take place, and may include temperature inversions, katabatic winds, or other phenomena",
                                    "refs": []
                                },
                                {
                                    "sentence": "The worst heat wave in recent history was the European Heat Wave of 2003",
                                    "refs": []
                                },
                                {
                                    "sentence": "The 2010 Northern Hemisphere summer resulted in severe heat waves which killed over 2,000 people",
                                    "refs": []
                                },
                                {
                                    "sentence": "The heat caused hundreds of wildfires which led to widespread air pollution and burned thousands of square kilometers of forest.",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Droughts",
                            "section_content": [
                                {
                                    "sentence": "Well-known historical droughts include the 1997–2009 Millennium Drought in Australia which led to a water supply crisis across much of the country",
                                    "refs": []
                                },
                                {
                                    "sentence": "As a result, many desalination plants were built for the first time (see list)",
                                    "refs": []
                                },
                                {
                                    "sentence": "In 2011, the State of Texas lived under a drought emergency declaration for the entire calendar year and suffered severe economic losses",
                                    "refs": []
                                },
                                {
                                    "sentence": "The drought caused the Bastrop fires.",
                                    "refs": [
                                        "http://www.ncdc.noaa.gov/billions/events"
                                    ]
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Duststorms",
                            "section_content": [],
                            "subsections": []
                        },
                        {
                            "section_title": "Firestorms",
                            "section_content": [],
                            "subsections": []
                        },
                        {
                            "section_title": "Wildfires",
                            "section_content": [
                                {
                                    "sentence": "Wildfires are large fires which often start in wildland areas",
                                    "refs": []
                                },
                                {
                                    "sentence": "Common causes include lightning and drought but wildfires may also be started by human negligence or arson",
                                    "refs": []
                                },
                                {
                                    "sentence": "They can spread to populated areas and thus be a threat to humans and property, as well as wildlife",
                                    "refs": []
                                },
                                {
                                    "sentence": "One example for a notable wildfire is the 1871 Peshtigo Fire in the United States, which killed at least 1700 people",
                                    "refs": []
                                },
                                {
                                    "sentence": "Another one is the 2009 Victorian bushfires in Australia (collectively known as \"Black Saturday bushfires\")",
                                    "refs": [
                                        "https://www.weather.gov/grb/peshtigofire",
                                        "https://www.history.com/this-day-in-history/massive-fire-burns-in-wisconsin"
                                    ]
                                },
                                {
                                    "sentence": "In that year, a summer heat wave in Victoria, Australia, created conditions which fueled the massive bushfires in 2009",
                                    "refs": [
                                        "http://www.vic.gov.au/2009-bushfires",
                                        "https://www.nma.gov.au/defining-moments/resources/black-saturday-bushfires",
                                        "http://knowledge.aidr.org.au/resources/bushfire-black-saturday-victoria-2009/"
                                    ]
                                },
                                {
                                    "sentence": "Melbourne experienced three days in a row of temperatures exceeding 40 °C (104 °F), with some regional areas sweltering through much higher temperatures.",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "section_title": "Storms and heavy rain",
                    "section_content": [],
                    "subsections": [
                        {
                            "section_title": "Floods",
                            "section_content": [
                                {
                                    "sentence": "A flood is an overflow of water that 'submerges' land",
                                    "refs": []
                                },
                                {
                                    "sentence": "The EU Floods Directive defines a flood as a temporary covering of land that is usually dry with water",
                                    "refs": [
                                        "https://encarta.msn.com/encnet/features/dictionary/DictionaryResults.aspx?refid=1861612277"
                                    ]
                                },
                                {
                                    "sentence": "In the sense of 'flowing water', the word may also be applied to the inflow of the tides",
                                    "refs": [
                                        "http://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=OJ:L:2007:288:0027:0034:EN:PDF"
                                    ]
                                },
                                {
                                    "sentence": "Flooding may result from the volume of a body of water, such as a river or lake, becoming higher than usual, causing some of the water to escape its usual boundaries",
                                    "refs": []
                                },
                                {
                                    "sentence": "While the size of a lake or other body of water will vary with seasonal changes in precipitation and snow melt, a flood is not considered significant unless the water covers land used by humans, such as a village, city or other inhabited area, roads or expanses of farmland.",
                                    "refs": [
                                        "http://amsglossary.allenpress.com/glossary/search?id=flood1"
                                    ]
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Thunderstorms",
                            "section_content": [
                                {
                                    "sentence": "Severe storms, dust clouds and volcanic eruptions can generate lightning",
                                    "refs": []
                                },
                                {
                                    "sentence": "Apart from the damage typically associated with storms, such as winds, hail and flooding, the lightning itself can damage buildings, ignite fires and kill by direct contact",
                                    "refs": []
                                },
                                {
                                    "sentence": "Most deaths from lightning occur in the poorer countries of the Americas and Asia, where lightning is common and adobe mud brick housing provides little protection",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Tropical cyclone",
                            "section_content": [
                                {
                                    "sentence": "Typhoon, cyclone, cyclonic storm and hurricane are different names for the same phenomenon: a tropical storm that forms over an ocean",
                                    "refs": []
                                },
                                {
                                    "sentence": "It is caused by evaporated water that comes off of the ocean and becomes a storm",
                                    "refs": []
                                },
                                {
                                    "sentence": "It is characterized by strong winds, heavy rainfall and thunderstorms",
                                    "refs": []
                                },
                                {
                                    "sentence": "The determining factor on which term is used is based on where the storm originates",
                                    "refs": []
                                },
                                {
                                    "sentence": "In the Atlantic and Northeast Pacific, the term \"hurricane\" is used; in the Northwest Pacific, it is referred to as a \"typhoon\"; a \"cyclone\" occurs in the South Pacific and Indian Ocean.",
                                    "refs": []
                                },
                                {
                                    "sentence": "The deadliest hurricane ever was the 1970 Bhola cyclone; the deadliest Atlantic hurricane was the Great Hurricane of 1780, which devastated Martinique, St",
                                    "refs": []
                                },
                                {
                                    "sentence": "Eustatius and Barbados",
                                    "refs": []
                                },
                                {
                                    "sentence": "Another notable hurricane is Hurricane Katrina, which devastated the Gulf Coast of the United States in 2005",
                                    "refs": []
                                },
                                {
                                    "sentence": "Hurricanes may become more intense and produce more heavy rainfall as a consequence of human-induced climate change.",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Tornadoes",
                            "section_content": [
                                {
                                    "sentence": "A tornado is a violent and dangerous rotating column of air that is in contact with both the surface of the Earth and a cumulonimbus cloud, or, in rare cases, the base of a cumulus cloud",
                                    "refs": []
                                },
                                {
                                    "sentence": "It is also referred to as a twister or a cyclone,  although the word cyclone is used in meteorology in a wider sense to refer to any closed low pressure circulation",
                                    "refs": [
                                        "https://www.merriam-webster.com/dictionary/cyclone"
                                    ]
                                },
                                {
                                    "sentence": "Tornadoes come in many shapes and sizes but typically take the form of a visible condensation funnel, the narrow end of which touches the Earth and is often encircled by a cloud of debris and dust",
                                    "refs": []
                                },
                                {
                                    "sentence": "Tornadoes can occur one at a time, or can occur in large tornado outbreaks associated with supercells or in other large areas of thunderstorm development.",
                                    "refs": []
                                },
                                {
                                    "sentence": "Most tornadoes have wind speeds of less than 180 km/h (110 mph), are approximately 75 m (250 ft) across, and travel a few kilometers before dissipating",
                                    "refs": []
                                },
                                {
                                    "sentence": "The most extreme tornadoes can attain wind speeds of more than 480 km/h (300 mph), attain a width exceeding 3 km (2 mi) across, and stay on the ground for perhaps more than 100 km (60 mi)",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "section_title": "Cold-weather events",
                    "section_content": [],
                    "subsections": [
                        {
                            "section_title": "Blizzards",
                            "section_content": [
                                {
                                    "sentence": "Blizzards are severe winter storms characterized by heavy snow and strong winds",
                                    "refs": []
                                },
                                {
                                    "sentence": "When high winds stir up snow that has already fallen, it is known as a ground blizzard",
                                    "refs": []
                                },
                                {
                                    "sentence": "Blizzards can impact local economic activities, especially in regions where snowfall is rare",
                                    "refs": []
                                },
                                {
                                    "sentence": "The Great Blizzard of 1888 affected the United States, when many tons of wheat crops were destroyed",
                                    "refs": []
                                },
                                {
                                    "sentence": "In Asia, the 1972 Iran blizzard and the 2008 Afghanistan blizzard, were the deadliest blizzards in history; in the former, an area the size of Wisconsin was entirely buried in snow",
                                    "refs": []
                                },
                                {
                                    "sentence": "The 1993 Superstorm originated in the Gulf of Mexico and traveled north, causing damage in 26 American states as well as in Canada and leading to more than 300 deaths",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Hailstorms",
                            "section_content": [
                                {
                                    "sentence": "Hail is precipitation in the form of ice that does not melt before it hits the ground",
                                    "refs": []
                                },
                                {
                                    "sentence": "Hailstorms are produced by thunderstorms",
                                    "refs": []
                                },
                                {
                                    "sentence": "Hailstones usually measure between 5 and 150 mm (1⁄4 and 6 in) in diameter",
                                    "refs": []
                                },
                                {
                                    "sentence": "These can damage the location in which they fall",
                                    "refs": []
                                },
                                {
                                    "sentence": "Hailstorms can be especially devastating to farm fields, ruining crops and damaging equipment",
                                    "refs": []
                                },
                                {
                                    "sentence": "A particularly damaging hailstorm hit Munich, Germany, on July 12, 1984, causing about $2 billion in insurance claims.",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        },
        {
            "section_title": "Multi-hazard analysis",
            "section_content": [
                {
                    "sentence": "Each of the natural hazard types outlined above have very different characteristics, in terms of the spatial and temporal scales they influence, hazard frequency and return period, and measures of intensity and impact",
                    "refs": []
                },
                {
                    "sentence": "These complexities result in \"single-hazard\" assessments being commonplace, where the hazard potential from one particular hazard type is constrained",
                    "refs": []
                },
                {
                    "sentence": "In these examples, hazards are often treated as isolated or independent",
                    "refs": []
                },
                {
                    "sentence": "An alternative is a \"multi-hazard\" approach which seeks to identify all possible natural hazards and their interactions or interrelationships",
                    "refs": []
                },
                {
                    "sentence": "Many examples exist of one natural hazard triggering or increasing the probability of one or more other natural hazards",
                    "refs": []
                },
                {
                    "sentence": "For example, an earthquake may trigger landslides, whereas a wildfire may increase the probability of landslides being generated in the future",
                    "refs": []
                },
                {
                    "sentence": "A detailed review of such interactions across 21 natural hazards identified 90 possible interactions, of varying likelihood and spatial importance",
                    "refs": [
                        "https://kclpure.kcl.ac.uk/portal/en/publications/reviewing-and-visualizing-the-interactions-of-natural-hazards(614b146d-63d1-48a0-944a-e87a4a6ed464).html"
                    ]
                },
                {
                    "sentence": "There may also be interactions between these natural hazards and anthropic processes",
                    "refs": [
                        "https://kclpure.kcl.ac.uk/portal/en/publications/reviewing-and-visualizing-the-interactions-of-natural-hazards(614b146d-63d1-48a0-944a-e87a4a6ed464).html"
                    ]
                },
                {
                    "sentence": "For example, groundwater abstraction may trigger groundwater-related subsidence",
                    "refs": [
                        "https://meetingorganizer.copernicus.org/EGU2014/EGU2014-3049.pdf"
                    ]
                },
                {
                    "sentence": "Effective hazard analysis in any given area (e.g., for the purposes of disaster risk reduction) should ideally include an examination of all relevant hazards and their interactions",
                    "refs": []
                },
                {
                    "sentence": "To be of most use for risk reduction, hazard analysis should be extended to risk assessment wherein the vulnerability of the built environment to each of the hazards is taken into account",
                    "refs": []
                },
                {
                    "sentence": "This step is well developed for seismic risk, where the possible effect of future earthquakes on structures and infrastructure is assessed, as well as for risk from extreme wind and to a lesser extent flood risk",
                    "refs": []
                },
                {
                    "sentence": "For other types of natural hazard the calculation of risk is more challenging, principally because of the lack of functions linking the intensity of a hazard and the probability of different levels of damage (fragility curves)",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "Responses",
            "section_content": [
                {
                    "sentence": "Disaster management is a main function of civil protection (or civil defense) authorities",
                    "refs": []
                },
                {
                    "sentence": "It should address all four of the phases of disasters: mitigation and prevention, disaster response, recovery and preparedness.",
                    "refs": []
                }
            ],
            "subsections": [
                {
                    "section_title": "Mitigation and prevention",
                    "section_content": [],
                    "subsections": [
                        {
                            "section_title": "Disaster risk reduction",
                            "section_content": [],
                            "subsections": []
                        }
                    ]
                },
                {
                    "section_title": "Response",
                    "section_content": [],
                    "subsections": []
                },
                {
                    "section_title": "Recovery",
                    "section_content": [],
                    "subsections": []
                },
                {
                    "section_title": "Preparedness",
                    "section_content": [],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Society and culture",
            "section_content": [],
            "subsections": [
                {
                    "section_title": "International law",
                    "section_content": [
                        {
                            "sentence": "The 1951 Refugee Convention  and its 1967 Protocol are the cornerstone documents for refugee protection and population displacement",
                            "refs": [
                                "https://www.unhcr.org/us/about-unhcr/overview/1951-refugee-convention"
                            ]
                        },
                        {
                            "sentence": "The 1998 UN Guiding Principles on Internal Displacement and 2009 Kampala Convention protect people displaced due to natural disasters",
                            "refs": [
                                "https://www.unhcr.org/us/what-we-do/build-better-futures/climate-change-and-displacement/law-and-policy-protection"
                            ]
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "See also",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "References",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "External links",
            "section_content": [],
            "subsections": []
        }
    ],
    "references": {
        "1": "https://hazards.fema.gov/nri/natural-hazards",
        "2": "ISBN: 1-85383-964-7",
        "3": "https://opendemocracy.net/en/why-natural-disasters-arent-all-that-natural",
        "4": "https://www.preventionweb.net/blog/nonaturaldisasters-changing-discourse-disaster-reporting",
        "5": "https://researchgate.net/publication/248360551_Vulnerability_Analysis_and_The_Explanation_Of_'Natural'_Disasters",
        "6": "https://www.preventionweb.net/news/why-natural-disasters-arent-all-natural",
        "7": "https://doi.org/10.2458%2Fv23i1.20181",
        "8": "https://items.ssrc.org/understanding-katrina/theres-no-such-thing-as-a-natural-disaster/",
        "9": "https://www.iitk.ac.in/nicee/wcee/article/10_vol10_5989.pdf",
        "10": "https://www.nps.gov/articles/wildfire-causes-and-evaluation.htm",
        "11": "https://www.anthropocenemagazine.org/2020/09/humans-cause-most-wildfires-that-threaten-homes-in-the-united-states/",
        "12": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1127087",
        "13": "https://1lib.eu/book/2583950/77162a",
        "14": "https://doi.org/10.1007/978-3-319-59002-8_4",
        "15": "ISBN: 1-903544-10-6",
        "16": "ISBN: 0-415-25216-4",
        "17": "https://www.ifrc.org/our-work/disasters-climate-and-crises/what-disaster",
        "18": "http://www.oas.org/dsd/publications/Unit/oea54e/oea54e.pdf",
        "19": "ISBN: 978-0898621594",
        "20": "https://doi.org/10.1016%2Fj.earscirev.2017.01.002",
        "21": "https://www.preventionweb.net/blog/time-say-goodbye-natural-disasters",
        "22": "https://www.who.int/data/gho/data/themes/mortality-and-global-health-estimates/global-health-estimates-leading-causes-of-dalys",
        "23": "https://www.who.int/docs/default-source/gho-documents/global-health-estimates/ghe2019_dalys-2019-country.xlsx",
        "24": "[ERROR retrieving ref link]",
        "25": "https://reliefweb.int/report/world/factbox-asia-pacific-worlds-most-disaster-prone-region",
        "26": "https://www.economist.com/blogs/graphicdetail/2017/08/daily-chart-19",
        "27": "http://www.worldwatch.org/natural-catastrophes-2012-dominated-us-weather-extremes-0",
        "28": "https://web.archive.org/web/20231218182313/https://public-old.wmo.int/en/our-mandate/focus-areas/natural-hazards-and-disaster-risk-reduction",
        "29": "https://books.google.com/books?id=fpZNDwAAQBAJ",
        "30": "https://library.wmo.int/idurl/4/57564",
        "31": "https://sendaiframework-mtr.undrr.org/publication/report-midterm-review-implementation-sendai-framework-disaster-risk-reduction-2015-2030",
        "32": "https://doi.org/10.1007%2F978-3-319-72026-5_3",
        "33": "https://doi.org/10.1017%2F9781009157896.013",
        "34": "https://doi.org/10.1038%2Fs41467-023-41888-1",
        "35": "http://www.unep.org/resources/report/drowning-plastics-marine-litter-and-plastic-waste-vital-graphics",
        "36": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3100103",
        "37": "https://www.theguardian.com/environment/commentisfree/2015/sep/01/easiest-way-respond-natural-disaster-blame-god-global-warming",
        "38": "https://www.newindianexpress.com/states/tamil-nadu/2018/aug/15/kerala-flood-blamed-on-womens-entry-into-sabarimala-by-hindu-makkal-katchi-1858022.html",
        "39": "https://www.thequint.com/videos/kerala-floods-women-in-sabarimala-beef-muslims-christians",
        "40": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3472448",
        "41": "https://www.directrelief.org/2019/12/pregnant-women-are-particularly-vulnerable-to-disasters/",
        "42": "https://insight.cumbria.ac.uk/id/eprint/5950",
        "43": "https://library.oapen.org/handle/20.500.12657/32368",
        "44": "https://www.aeaweb.org/articles?id=10.1257/mic.20150349",
        "45": "https://doi.org/10.1111%2Fj.1540-5907.2010.00503.x",
        "46": "https://www.cambridge.org/core/journals/american-political-science-review/article/abs/myopic-voters-and-natural-disaster-policy/039708A3223EC114365ADF56F1D26423",
        "47": "http://www.thesaurus.com/browse/landslide",
        "48": "ISBN: 9780071778343",
        "49": "https://pubs.usgs.gov/fs/2004/3072/fs-2004-3072.html",
        "50": "https://doi.org/10.1007/s10346-013-0436-y",
        "51": "https://www.sciencedirect.com/science/article/pii/S0025322704002713",
        "52": "https://doi.org/10.3390%2Fw11081552",
        "53": "https://climate.nasa.gov/news/2951/climate-change-could-trigger-more-landslides-in-high-mountain-asia",
        "54": "https://nsidc.org/cryosphere/snow/science/avalanches.html",
        "55": "https://doi.org/10.1093%2Foso%2F9780198866930.001.0001",
        "56": "ISBN: 9780849302251",
        "57": "https://www.science.org/content/article/human-ancestors-were-endangered-species",
        "58": "https://www.ipcc.ch/report/ar6/wg2/downloads/report/IPCC_AR6_WGII_SummaryForPolicymakers.pdf",
        "59": "https://www.ipcc.ch/report/ar6/wg1/downloads/report/IPCC_AR6_WGI_Chapter08.pdf",
        "60": "http://www.bom.gov.au/climate/drought/livedrought.shtml",
        "61": "http://www.lilith-ezine.com/articles/environmental/Australian-Drought.html",
        "62": "https://doi.org/10.1146%2Fannurev-earth-082517-010235",
        "63": "https://climate.nasa.gov/news/2891/a-drier-future-sets-the-stage-for-more-wildfires/",
        "64": "https://doi.org/10.1146%2Fannurev-arplant-102820-012804",
        "65": "http://www.ncdc.noaa.gov/billions/events",
        "66": "https://web.archive.org/web/20231218183419/https://public-old.wmo.int/en/resources/bulletin/airborne-dust-hazard-human-health-environment-and-society",
        "67": "ISBN: 978-0-7844-0739-4",
        "68": "[ERROR retrieving ref link]",
        "69": "https://web.archive.org/web/20130218040912/http://www.dtic.mil/cgi-bin/GetTRDoc?AD=AD673703&Location=U2&doc=GetTRDoc.pdf",
        "70": "https://www.weather.gov/grb/peshtigofire",
        "71": "https://www.history.com/this-day-in-history/massive-fire-burns-in-wisconsin",
        "72": "http://www.vic.gov.au/2009-bushfires",
        "73": "https://www.nma.gov.au/defining-moments/resources/black-saturday-bushfires",
        "74": "http://knowledge.aidr.org.au/resources/bushfire-black-saturday-victoria-2009/",
        "75": "https://encarta.msn.com/encnet/features/dictionary/DictionaryResults.aspx?refid=1861612277",
        "76": "http://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=OJ:L:2007:288:0027:0034:EN:PDF",
        "77": "http://amsglossary.allenpress.com/glossary/search?id=flood1",
        "78": "https://www.theguardian.com/world/2015/jul/31/deadly-lightning-mexico-government-failure",
        "79": "https://www.merriam-webster.com/dictionary/cyclone",
        "80": "https://web.archive.org/web/20070205124033/http://www.cswr.org/dow/dow.htm",
        "81": "http://www.crh.noaa.gov/oax/archive/hallam/hallam.php",
        "82": "https://web.archive.org/web/20060929185156/http://www.spc.ncep.noaa.gov/faq/tornado/",
        "83": "http://www.n-d-a.org/snow-hail-storm.php",
        "84": "https://boris.unibe.ch/17542/1/Kappes2012_Article_ChallengesOfAnalyzingMulti-haz.pdf",
        "85": "https://kclpure.kcl.ac.uk/portal/en/publications/reviewing-and-visualizing-the-interactions-of-natural-hazards(614b146d-63d1-48a0-944a-e87a4a6ed464).html",
        "86": "https://meetingorganizer.copernicus.org/EGU2014/EGU2014-3049.pdf",
        "87": "https://water.usgs.gov/edu/earthgwlandsubside.html",
        "88": "https://hal.archives-ouvertes.fr/hal-00330925/file/nhess-7-283-2007.pdf",
        "89": "https://ourworldindata.org/grapher/disaster-risk-reduction-progress?tab=chart&time=earliest..latest&country=CAN~MNG~BRA~DEU~JPN~CHE~USA~BGD~IND~LBN~KEN~NGA~SEN~LKA~SLE~MEX~PAK~GHA~DZA~ARG",
        "90": "https://www.preventionweb.net/publication/report-open-ended-intergovernmental-expert-working-group-indicators-and-terminology",
        "91": "https://wires.onlinelibrary.wiley.com/doi/10.1002/wcc.77",
        "92": "http://www.tandfonline.com/doi/abs/10.1111/j.1467-8306.2007.00563.x",
        "93": "http://cdkn.org/wp-content/uploads/2014/03/CDKN_Gender_DRR_PolicyBrief_Final_WEB.pdf",
        "94": "https://sendaiframework-mtr.undrr.org/publication/report-midterm-review-implementation-sendai-framework-disaster-risk-reduction-2015-2030",
        "95": "https://www.undrr.org/publication/report-midterm-review-implementation-sendai-framework-disaster-risk-reduction-2015-2030",
        "96": "https://www.preventionweb.net/publication/report-open-ended-intergovernmental-expert-working-group-indicators-and-terminology",
        "97": "https://www.sciencedirect.com/science/article/pii/S2352710220303478",
        "98": "http://www.fema.gov/",
        "99": "https://doi.org/10.1186%2F2048-7010-2-8",
        "100": "https://web.archive.org/web/20150714234229/http://www.training.fema.gov/emiweb/downloads/is10_unit3.doc",
        "101": "http://www.memphis.edu/ifti/pdfs/cait_phases_of_emergency_mngt.pdf",
        "102": "https://www.unhcr.org/us/about-unhcr/overview/1951-refugee-convention",
        "103": "https://www.unhcr.org/us/what-we-do/build-better-futures/climate-change-and-displacement/law-and-policy-protection",
        "104": "https://nbn-resolving.org/urn:nbn:de:0168-ssoar-329056",
        "105": "https://www.unhcr.org/5cd569877.pdf"
    },
    "flair_entities": [
        "san francisco",
        "sahrawi",
        "katrina",
        "santorini",
        "spitak earthquake",
        "hindutva",
        "us federal emergency management agency",
        "gulf of mexico",
        "jordan",
        "pacific ocean.",
        "asia",
        "india",
        "earth",
        "refugee convention",
        "asia-pacific",
        "st. eustatius",
        "peshtigo fire",
        "northwest pacific",
        "ministry of the environment",
        "us",
        "victoria",
        "syria",
        "f",
        "toba",
        "wisconsin",
        "iran",
        "lo et al",
        "sumatra",
        "ayyappan",
        "stis",
        "china",
        "united states",
        "germany",
        "fema",
        "national risk index",
        "japanese",
        "japan",
        "south pacific",
        "hong kong",
        "tindouf",
        "azraq",
        "armero",
        "kampala convention",
        "state of texas",
        "atlantic",
        "barbados",
        "sabarimala",
        "millennium drought in australia",
        "martinique",
        "australia",
        "boxing day",
        "tangiwai",
        "lituya bay",
        "melbourne",
        "great blizzard of 1888",
        "northeast pacific",
        "un guiding principles on internal displacement",
        "gulf coast",
        "kerala",
        "victorian",
        "american",
        "algeria",
        "lake toba",
        "blizzards  blizzards",
        "indian ocean",
        "lava",
        "european heat wave of 2003",
        "armenia",
        "pompeii",
        "hindu makkal katchi",
        "zimbabwe",
        "alaska",
        "fukushima",
        "bahamas",
        "munich",
        "haiti",
        "english",
        "america",
        "americas",
        "bhola",
        "afghanistan",
        "bastrop",
        "lgbt",
        "northern hemisphere",
        "indian ocean.",
        "canada",
        "great hurricane of 1780",
        "protocol",
        "eu floods directive"
    ]
}