{
    "title": "Boltzmann_distribution",
    "url": "https://en.wikipedia.org/wiki/Boltzmann_distribution",
    "summary": "In statistical mechanics and mathematics, a Boltzmann distribution (also called Gibbs distribution) is a probability distribution or probability measure that gives the probability that a system will be in a certain state as a function of that state's energy and the temperature of the system. The distribution is expressed in the form:\n\n  \n    \n      \n        \n          p\n          \n            i\n          \n        \n        ∝\n        exp\n        ⁡\n        \n          (\n          \n            −\n            \n              \n                \n                  ε\n                  \n                    i\n                  \n                \n                \n                  k\n                  T\n                \n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle p_{i}\\propto \\exp \\left(-{\\frac {\\varepsilon _{i}}{kT}}\\right)}\n  \n\nwhere pi is the probability of the system being in state i, exp is the exponential function, εi is the energy of that state, and a constant kT of the distribution is the product of the Boltzmann constant k and thermodynamic temperature T. The symbol \n  \n    \n      \n        ∝\n      \n    \n    {\\textstyle \\propto }\n  \n denotes proportionality (see § The distribution for the proportionality constant).\nThe term system here has a wide meaning; it can range from a collection of 'sufficient number' of atoms or a single atom to a macroscopic system such as a natural gas storage tank. Therefore, the Boltzmann distribution can be used to solve a wide variety of problems. The distribution shows that states with lower energy will always have a higher probability of being occupied.\nThe ratio of probabilities of two states is known as the Boltzmann factor and characteristically only depends on the states' energy difference:\n\n  \n    \n      \n        \n          \n            \n              p\n              \n                i\n              \n            \n            \n              p\n              \n                j\n              \n            \n          \n        \n        =\n        exp\n        ⁡\n        \n          (\n          \n            \n              \n                \n                  ε\n                  \n                    j\n                  \n                \n                −\n                \n                  ε\n                  \n                    i\n                  \n                \n              \n              \n                k\n                T\n              \n            \n          \n          )\n        \n      \n    \n    {\\displaystyle {\\frac {p_{i}}{p_{j}}}=\\exp \\left({\\frac {\\varepsilon _{j}-\\varepsilon _{i}}{kT}}\\right)}\n  \n\nThe Boltzmann distribution is named after Ludwig Boltzmann who first formulated it in 1868 during his studies of the statistical mechanics of gases in thermal equilibrium. Boltzmann's statistical work is borne out in his paper “On the Relationship between the Second Fundamental Theorem of the Mechanical Theory of Heat and Probability Calculations Regarding the Conditions for Thermal Equilibrium\"\nThe distribution was later investigated extensively, in its modern generic form, by Josiah Willard Gibbs in 1902.\nThe Boltzmann distribution should not be confused with the Maxwell–Boltzmann distribution or Maxwell-Boltzmann statistics. The Boltzmann distribution gives the probability that a system will be in a certain state as a function of that state's energy, while the Maxwell-Boltzmann distributions give the probabilities of particle speeds or energies in ideal gases. The distribution of energies in a one-dimensional gas however, does follow the Boltzmann distribution.",
    "content": [
        {
            "section_title": "The distribution",
            "section_content": [
                {
                    "sentence": "The Boltzmann distribution is a probability distribution that gives the probability of a certain state as a function of that state's energy and  temperature of the system to which the distribution is applied",
                    "refs": []
                },
                {
                    "sentence": "It is given aspi=1Qexp⁡(−εikT)=exp⁡(−εikT)∑j=1Mexp⁡(−εjkT){\\displaystyle p_{i}={\\frac {1}{Q}}\\exp \\left(-{\\frac {\\varepsilon _{i}}{kT}}\\right)={\\frac {\\exp \\left(-{\\tfrac {\\varepsilon _{i}}{kT}}\\right)}{\\displaystyle \\sum _{j=1}^{M}\\exp \\left(-{\\tfrac {\\varepsilon _{j}}{kT}}\\right)}}}",
                    "refs": [
                        "ISBN: 1-891389-15-7"
                    ]
                },
                {
                    "sentence": "where:",
                    "refs": []
                },
                {
                    "sentence": "Using Lagrange multipliers, one can prove that the Boltzmann distribution is the distribution that maximizes the entropyS(p1,p2,⋯,pM)=−∑i=1Mpilog2⁡pi{\\displaystyle S(p_{1},p_{2},\\cdots ,p_{M})=-\\sum _{i=1}^{M}p_{i}\\log _{2}p_{i}}",
                    "refs": []
                },
                {
                    "sentence": "subject to the normalization constraint that ∑pi=1{\\textstyle \\sum p_{i}=1} and the constraint that ∑piεi{\\textstyle \\sum {p_{i}{\\varepsilon }_{i}}} equals a particular mean energy value, except for two special cases",
                    "refs": []
                },
                {
                    "sentence": "(These special cases occur when the mean value is either the minimum or maximum of the energies εi",
                    "refs": []
                },
                {
                    "sentence": "In these cases, the entropy maximizing distribution is a limit of Boltzmann distributions where T approaches zero from above or below, respectively.)",
                    "refs": []
                },
                {
                    "sentence": "The partition function can be calculated if we know the energies of the states accessible to the system of interest",
                    "refs": []
                },
                {
                    "sentence": "For atoms the partition function values can be found in the NIST Atomic Spectra Database",
                    "refs": []
                },
                {
                    "sentence": "The distribution shows that states with lower energy will always have a higher probability of being occupied than the states with higher energy",
                    "refs": []
                },
                {
                    "sentence": "It can also give us the quantitative relationship between the probabilities of the two states being occupied",
                    "refs": []
                },
                {
                    "sentence": "The ratio of probabilities for states i and j is given aspipj=exp⁡(εj−εikT){\\displaystyle {\\frac {p_{i}}{p_{j}}}=\\exp \\left({\\frac {\\varepsilon _{j}-\\varepsilon _{i}}{kT}}\\right)}",
                    "refs": []
                },
                {
                    "sentence": "where:",
                    "refs": []
                },
                {
                    "sentence": "The corresponding ratio of populations of energy levels must also take their degeneracies into account.",
                    "refs": []
                },
                {
                    "sentence": "The Boltzmann distribution is often used to describe the distribution of particles, such as atoms or molecules, over bound states accessible to them",
                    "refs": []
                },
                {
                    "sentence": "If we have a system consisting of many particles, the probability of a particle being in state i is practically the probability that, if we pick a random particle from that system and check what state it is in, we will find it is in state i",
                    "refs": []
                },
                {
                    "sentence": "This probability is equal to the number of particles in state i divided by the total number of particles in the system, that is the fraction of particles that occupy state i.",
                    "refs": []
                },
                {
                    "sentence": "where Ni is the number of particles in state i and N is the total number of particles in the system",
                    "refs": []
                },
                {
                    "sentence": "We may use the Boltzmann distribution to find this probability that is, as we have seen, equal to the fraction of particles that are in state i",
                    "refs": []
                },
                {
                    "sentence": "So the equation that gives the fraction of particles in state i as a function of the energy of that state is   NiN=exp⁡(−εikT)∑j=1Mexp⁡(−εjkT){\\displaystyle {\\frac {N_{i}}{N}}={\\frac {\\exp \\left(-{\\frac {\\varepsilon _{i}}{kT}}\\right)}{\\displaystyle \\sum _{j=1}^{M}\\exp \\left(-{\\tfrac {\\varepsilon _{j}}{kT}}\\right)}}}",
                    "refs": [
                        "[ERROR retrieving ref link]"
                    ]
                },
                {
                    "sentence": "This equation is of great importance to spectroscopy",
                    "refs": []
                },
                {
                    "sentence": "In spectroscopy we observe a spectral line of atoms or molecules undergoing transitions from one state to another",
                    "refs": []
                },
                {
                    "sentence": "In order for this to be possible, there must be some particles in the first state to undergo the transition",
                    "refs": [
                        "[ERROR retrieving ref link]",
                        "ISBN: 978-0-19-954337-3"
                    ]
                },
                {
                    "sentence": "We may find that this condition is fulfilled by finding the fraction of particles in the first state",
                    "refs": []
                },
                {
                    "sentence": "If it is negligible, the transition is very likely not observed at the temperature for which the calculation was done",
                    "refs": []
                },
                {
                    "sentence": "In general, a larger fraction of molecules in the first state means a higher number of transitions to the second state",
                    "refs": []
                },
                {
                    "sentence": "This gives a stronger spectral line",
                    "refs": [
                        "ISBN: 978-0-495-12570-9"
                    ]
                },
                {
                    "sentence": "However, there are other factors that influence the intensity of a spectral line, such as whether it is caused by an allowed or a forbidden transition.",
                    "refs": []
                },
                {
                    "sentence": "The softmax function commonly used in machine learning is related to the Boltzmann distribution:",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "Generalized Boltzmann distribution",
            "section_content": [
                {
                    "sentence": "Distribution of the form",
                    "refs": []
                },
                {
                    "sentence": "is called generalized Boltzmann distribution by some authors",
                    "refs": []
                },
                {
                    "sentence": "The Boltzmann distribution is a special case of the generalized Boltzmann distribution",
                    "refs": []
                },
                {
                    "sentence": "The generalized Boltzmann distribution is used in statistical mechanics to describe canonical ensemble, grand canonical ensemble and isothermal–isobaric ensemble",
                    "refs": []
                },
                {
                    "sentence": "The generalized Boltzmann distribution is usually derived from the principle of maximum entropy, but there are other derivations",
                    "refs": []
                },
                {
                    "sentence": "The generalized Boltzmann distribution has the following properties:",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "In statistical mechanics",
            "section_content": [
                {
                    "sentence": "The Boltzmann distribution appears in statistical mechanics when considering closed systems of fixed composition that are in thermal equilibrium (equilibrium with respect to energy exchange)",
                    "refs": []
                },
                {
                    "sentence": "The most general case is the probability distribution for the canonical ensemble",
                    "refs": []
                },
                {
                    "sentence": "Some special cases (derivable from the canonical ensemble) show the Boltzmann distribution in different aspects:",
                    "refs": []
                },
                {
                    "sentence": "Although these cases have strong similarities, it is helpful to distinguish them as they generalize in different ways when the crucial assumptions are changed:",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "In mathematics",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "In economics",
            "section_content": [
                {
                    "sentence": "The Boltzmann distribution can be introduced to allocate permits in emissions trading",
                    "refs": []
                },
                {
                    "sentence": "The new allocation method using the Boltzmann distribution can describe the most probable, natural, and unbiased distribution of emissions permits among multiple countries.",
                    "refs": [
                        "[ERROR retrieving ref link]",
                        "http://www.technologyreview.com/view/425051/the-thorny-problem-of-fair-allocation/"
                    ]
                },
                {
                    "sentence": "The Boltzmann distribution has the same form as the multinomial logit model",
                    "refs": []
                },
                {
                    "sentence": "As a discrete choice model, this is very well known in economics since Daniel McFadden made the connection to random utility maximization",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "See also",
            "section_content": [],
            "subsections": []
        }
    ],
    "references": {
        "1": "ISBN: 0-7506-3372-7",
        "2": "[ERROR retrieving ref link]",
        "3": "https://web.archive.org/web/20210305005604/http://crystal.med.upenn.edu/sharp-lab-pdfs/2015SharpMatschinsky_Boltz1877_Entropy17.pdf",
        "4": "[ERROR retrieving ref link]",
        "5": "[ERROR retrieving ref link]",
        "6": "ISBN: 1-891389-15-7",
        "7": "http://physics.nist.gov/PhysRefData/ASD/levels_form.html",
        "8": "ISBN: 978-0-19-954337-3",
        "9": "ISBN: 978-0-495-12570-9",
        "10": "https://aip.scitation.org/doi/abs/10.1063/1.5111333",
        "11": "https://www.sciencedirect.com/science/article/pii/S2211379722000390",
        "12": "[ERROR retrieving ref link]",
        "13": "[ERROR retrieving ref link]",
        "14": "http://www.technologyreview.com/view/425051/the-thorny-problem-of-fair-allocation/",
        "15": "https://books.google.com/books?id=0bzGQE14CwEC&pg=PA296"
    },
    "flair_entities": [
        "lagrange",
        "nist atomic spectra database",
        "ludwig boltzmann",
        "on the relationship between the second fundamental theorem of the mechanical theory of heat and probability calculations regarding the conditions for thermal equilibrium",
        "daniel mcfadden",
        "josiah willard gibbs",
        "maxwell-boltzmann",
        "maxwell–boltzmann",
        "boltzmann"
    ]
}