{
    "title": "Neural_oscillation",
    "url": "https://en.wikipedia.org/wiki/Neural_oscillation",
    "summary": "Neural oscillations, or brainwaves, are rhythmic or repetitive patterns of neural activity in the central nervous system. Neural tissue can generate oscillatory activity in many ways, driven either by mechanisms within individual neurons or by interactions between neurons.  In individual neurons, oscillations can appear either as oscillations in membrane potential or as rhythmic patterns of action potentials, which then produce oscillatory activation of post-synaptic neurons.  At the level of neural ensembles, synchronized activity of large numbers of neurons can give rise to macroscopic oscillations, which can be observed in an electroencephalogram. Oscillatory activity in groups of neurons generally arises from feedback connections between the neurons that result in the synchronization of their firing patterns. The interaction between neurons can give rise to oscillations at a different frequency than the firing frequency of individual neurons. A well-known example of macroscopic neural oscillations is alpha activity.\nNeural oscillations in humans were observed by researchers as early as 1924 (by Hans Berger). More than 50 years later, intrinsic oscillatory behavior was encountered in vertebrate neurons, but its functional role is still not fully understood. The possible roles of neural oscillations include feature binding, information transfer mechanisms and the generation of rhythmic motor output. Over the last decades more insight has been gained, especially with advances in brain imaging. A major area of research in neuroscience involves determining how oscillations are generated and what their roles are. Oscillatory activity in the brain is widely observed at different levels of organization and is thought to play a key role in processing neural information. Numerous experimental studies support a functional role of neural oscillations; a unified interpretation, however, is still lacking.",
    "content": [
        {
            "section_title": "History",
            "section_content": [
                {
                    "sentence": "Richard Caton discovered electrical activity in the cerebral hemispheres of rabbits and monkeys and presented his findings in 1875",
                    "refs": []
                },
                {
                    "sentence": "Adolf Beck published in 1890 his observations of spontaneous electrical activity of the brain of rabbits and dogs that included rhythmic oscillations altered by light, detected with electrodes directly placed on the surface of the brain",
                    "refs": [
                        "http://echo.mpiwg-berlin.mpg.de/ECHOdocuView?url=/permanent/vlp/lit27690/index.meta&ww=0.7143&wh=0.7143&wx=0.2632"
                    ]
                },
                {
                    "sentence": "Before Hans Berger, Vladimir Vladimirovich Pravdich-Neminsky published the first animal EEG and the evoked potential of a dog",
                    "refs": [
                        "https://doi.org/10.1080%2F0964704x.2013.867600"
                    ]
                }
            ],
            "subsections": []
        },
        {
            "section_title": "Overview",
            "section_content": [
                {
                    "sentence": "Neural oscillations are observed throughout the central nervous system at all levels, and include spike trains, local field potentials and large-scale oscillations which can be measured by electroencephalography (EEG)",
                    "refs": []
                },
                {
                    "sentence": "In general, oscillations can be characterized by their frequency, amplitude and phase",
                    "refs": []
                },
                {
                    "sentence": "These signal properties can be extracted from neural recordings using time-frequency analysis",
                    "refs": []
                },
                {
                    "sentence": "In large-scale oscillations, amplitude changes are considered to result from changes in synchronization within a neural ensemble, also referred to as local synchronization",
                    "refs": []
                },
                {
                    "sentence": "In addition to local synchronization, oscillatory activity of distant neural structures (single neurons or neural ensembles) can synchronize",
                    "refs": []
                },
                {
                    "sentence": "Neural oscillations and synchronization have been linked to many cognitive functions such as information transfer, perception, motor control and memory",
                    "refs": []
                },
                {
                    "sentence": "The opposite of neuron synchronization is neural isolation, which is when electrical activity of neurons is not temporally synchronized",
                    "refs": []
                },
                {
                    "sentence": "This is when the likelihood of the neuron to reach its threshold potential for the signal to propagate to the next neuron decreases",
                    "refs": []
                },
                {
                    "sentence": "This phenomenon is typically observed as the spectral intensity decreases from the summation of these neurons firing, which can be utilized to differentiate cognitive function or neural isolation",
                    "refs": []
                },
                {
                    "sentence": "However, new non-linear methods have been used that couple temporal and spectral entropic relationships simultaneously to characterize how neurons are isolated, (the signal's inability to propagate to adjacent neurons), an indicator of impairment (e.g., hypoxia)",
                    "refs": []
                },
                {
                    "sentence": "Neural oscillations have been most widely studied in neural activity generated by large groups of neurons",
                    "refs": []
                },
                {
                    "sentence": "Large-scale activity can be measured by techniques such as EEG",
                    "refs": []
                },
                {
                    "sentence": "In general, EEG signals have a broad spectral content similar to pink noise, but also reveal oscillatory activity in specific frequency bands",
                    "refs": []
                },
                {
                    "sentence": "The first discovered and best-known frequency band is alpha activity (8–12 Hz)    that can be detected from the occipital lobe during relaxed wakefulness and which increases when the eyes are closed",
                    "refs": [
                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5675530",
                        "https://www.jneurosci.org/content/early/2021/08/24/JNEUROSCI.0583-21.2021",
                        "https://doi.org/10.1016%2Fj.neuron.2019.11.001"
                    ]
                },
                {
                    "sentence": "Other frequency bands are: delta (1–4 Hz), theta (4–8 Hz), beta (13–30 Hz), low gamma (30–70 Hz),  and high gamma (70–150 Hz) frequency bands",
                    "refs": [
                        "https://doi.org/10.1007%2FBF01797193",
                        "https://doi.org/10.1126%2Fscience.1247003"
                    ]
                },
                {
                    "sentence": "Faster rhythms such as gamma activity have been linked to cognitive processing",
                    "refs": []
                },
                {
                    "sentence": "Indeed, EEG signals change dramatically during sleep",
                    "refs": []
                },
                {
                    "sentence": "In fact, different sleep stages are commonly characterized by their spectral content",
                    "refs": []
                },
                {
                    "sentence": "Consequently, neural oscillations have been linked to cognitive states, such as awareness and consciousness",
                    "refs": [
                        "https://doi.org/10.1016%2F0013-4694%2857%2990088-3"
                    ]
                },
                {
                    "sentence": "Although neural oscillations in human brain activity are mostly investigated using EEG recordings, they are also observed using more invasive recording techniques such as single-unit recordings",
                    "refs": []
                },
                {
                    "sentence": "Neurons can generate rhythmic patterns of action potentials or spikes",
                    "refs": []
                },
                {
                    "sentence": "Some types of neurons have the tendency to fire at particular frequencies, either as resonators  or as intrinsic oscillators",
                    "refs": [
                        "[ERROR retrieving ref link]"
                    ]
                },
                {
                    "sentence": "Bursting is another form of rhythmic spiking",
                    "refs": [
                        "[ERROR retrieving ref link]"
                    ]
                },
                {
                    "sentence": "Spiking patterns are considered fundamental for information coding in the brain",
                    "refs": []
                },
                {
                    "sentence": "Oscillatory activity can also be observed in the form of subthreshold membrane potential oscillations (i.e",
                    "refs": []
                },
                {
                    "sentence": "in the absence of action potentials)",
                    "refs": []
                },
                {
                    "sentence": "If numerous neurons spike in synchrony, they can give rise to oscillations in local field potentials",
                    "refs": [
                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1182792"
                    ]
                },
                {
                    "sentence": "Quantitative models can estimate the strength of neural oscillations in recorded data",
                    "refs": []
                },
                {
                    "sentence": "Neural oscillations are commonly studied within a mathematical framework and belong to the field of \"neurodynamics\", an area of research in the cognitive sciences that places a strong focus on the dynamic character of neural activity in describing brain function",
                    "refs": []
                },
                {
                    "sentence": "It considers the brain a dynamical system and uses differential equations to describe how neural activity evolves over time",
                    "refs": [
                        "https://doi.org/10.1086%2F286819"
                    ]
                },
                {
                    "sentence": "In particular, it aims to relate dynamic patterns of brain activity to cognitive functions such as perception and memory",
                    "refs": []
                },
                {
                    "sentence": "In very abstract form, neural oscillations can be analyzed analytically",
                    "refs": []
                },
                {
                    "sentence": "When studied in a more physiologically realistic setting, oscillatory activity is generally studied using computer simulations of a computational model.",
                    "refs": [
                        "https://doi.org/10.1007/BF00337259",
                        "https://www.science.org/doi/10.1126/science.3281253"
                    ]
                },
                {
                    "sentence": "The functions of neural oscillations are wide-ranging and vary for different types of oscillatory activity",
                    "refs": []
                },
                {
                    "sentence": "Examples are the generation of rhythmic activity such as a heartbeat and the neural binding of sensory features in perception, such as the shape and color of an object",
                    "refs": []
                },
                {
                    "sentence": "Neural oscillations also play an important role in many neurological disorders, such as excessive synchronization during seizure activity in epilepsy, or tremor in patients with Parkinson's disease",
                    "refs": []
                },
                {
                    "sentence": "Oscillatory activity can also be used to control external devices such as a brain–computer interface",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "Physiology",
            "section_content": [
                {
                    "sentence": "Oscillatory activity is observed throughout the central nervous system at all levels of organization",
                    "refs": []
                },
                {
                    "sentence": "Three different levels have been widely recognized: the micro-scale (activity of a single neuron), the meso-scale (activity of a local group of neurons) and the macro-scale (activity of different brain regions)",
                    "refs": []
                }
            ],
            "subsections": [
                {
                    "section_title": "Microscopic",
                    "section_content": [
                        {
                            "sentence": "Neurons generate action potentials resulting from changes in the electric membrane potential",
                            "refs": []
                        },
                        {
                            "sentence": "Neurons can generate multiple action potentials in sequence forming so-called spike trains",
                            "refs": []
                        },
                        {
                            "sentence": "These spike trains are the basis for neural coding and information transfer in the brain",
                            "refs": []
                        },
                        {
                            "sentence": "Spike trains can form all kinds of patterns, such as rhythmic spiking and bursting, and often display oscillatory activity",
                            "refs": []
                        },
                        {
                            "sentence": "Oscillatory activity in single neurons can also be observed in sub-threshold fluctuations in membrane potential",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2923921"
                            ]
                        },
                        {
                            "sentence": "These rhythmic changes in membrane potential do not reach the critical threshold and therefore do not result in an action potential",
                            "refs": []
                        },
                        {
                            "sentence": "They can result from postsynaptic potentials from synchronous inputs or from intrinsic properties of neurons.",
                            "refs": []
                        },
                        {
                            "sentence": "Neuronal spiking can be classified by its activity pattern",
                            "refs": []
                        },
                        {
                            "sentence": "The excitability of neurons can be subdivided in Class I and II",
                            "refs": []
                        },
                        {
                            "sentence": "Class I neurons can generate action potentials with arbitrarily low frequency depending on the input strength, whereas Class II neurons generate action potentials in a certain frequency band, which is relatively insensitive to changes in input strength",
                            "refs": []
                        },
                        {
                            "sentence": "Class II neurons are also more prone to display sub-threshold oscillations in membrane potential.",
                            "refs": [
                                "[ERROR retrieving ref link]"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Mesoscopic",
                    "section_content": [
                        {
                            "sentence": "A group of neurons can also generate oscillatory activity",
                            "refs": []
                        },
                        {
                            "sentence": "Through synaptic interactions, the firing patterns of different neurons may become synchronized and the rhythmic changes in electric potential caused by their action potentials may accumulate (constructive interference)",
                            "refs": []
                        },
                        {
                            "sentence": "That is, synchronized firing patterns result in synchronized input into other cortical areas, which gives rise to large-amplitude oscillations of the local field potential",
                            "refs": []
                        },
                        {
                            "sentence": "These large-scale oscillations can also be measured outside the scalp using electroencephalography (EEG) and magnetoencephalography (MEG)",
                            "refs": []
                        },
                        {
                            "sentence": "The electric potentials generated by single neurons are far too small to be picked up outside the scalp, and EEG or MEG activity always reflects the summation of the synchronous activity of thousands or millions of neurons that have similar spatial orientation",
                            "refs": []
                        },
                        {
                            "sentence": "Neurons in a neural ensemble rarely all fire at exactly the same moment, i.e",
                            "refs": []
                        },
                        {
                            "sentence": "fully synchronized",
                            "refs": []
                        },
                        {
                            "sentence": "Instead, the probability of firing is rhythmically modulated such that neurons are more likely to fire at the same time, which gives rise to oscillations in their mean activity",
                            "refs": []
                        },
                        {
                            "sentence": "(See figure at top of page.) As such, the frequency of large-scale oscillations does not need to match the firing pattern of individual neurons",
                            "refs": []
                        },
                        {
                            "sentence": "Isolated cortical neurons fire regularly under certain conditions, but in the intact brain, cortical cells are bombarded by highly fluctuating synaptic inputs and typically fire seemingly at random",
                            "refs": []
                        },
                        {
                            "sentence": "However, if the probability of a large group of neurons firing is rhythmically modulated at a common frequency, they will generate oscillations in the mean field",
                            "refs": []
                        },
                        {
                            "sentence": "(See also figure at top of page.)",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2923921"
                            ]
                        },
                        {
                            "sentence": "Neural ensembles can generate oscillatory activity endogenously through local interactions between excitatory and inhibitory neurons",
                            "refs": []
                        },
                        {
                            "sentence": "In particular, inhibitory interneurons play an important role in producing neural ensemble synchrony by generating a narrow window for effective excitation and rhythmically modulating the firing rate of excitatory neurons",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Macroscopic",
                    "section_content": [
                        {
                            "sentence": "Neural oscillation can also arise from interactions between different brain areas coupled through the structural connectome",
                            "refs": []
                        },
                        {
                            "sentence": "Time delays play an important role here",
                            "refs": []
                        },
                        {
                            "sentence": "Because all brain areas are bidirectionally coupled, these connections between brain areas form feedback loops",
                            "refs": []
                        },
                        {
                            "sentence": "Positive feedback loops tend to cause oscillatory activity where frequency is inversely related to the delay time",
                            "refs": []
                        },
                        {
                            "sentence": "An example of such a feedback loop is the connections between the thalamus and cortex – the thalamocortical radiations",
                            "refs": []
                        },
                        {
                            "sentence": "This thalamocortical network is able to generate oscillatory activity known as recurrent thalamo-cortical resonance",
                            "refs": []
                        },
                        {
                            "sentence": "The thalamocortical network plays an important role in the generation of alpha activity",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1692417"
                            ]
                        },
                        {
                            "sentence": "In a whole-brain network model with realistic anatomical connectivity and propagation delays between brain areas, oscillations in the beta frequency range emerge from the partial synchronisation of subsets of brain areas oscillating in the gamma-band (generated at the mesoscopic level)",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3505610",
                                "https://doi.org/10.1016%2FS0167-8760%2801%2900177-5"
                            ]
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Mechanisms",
            "section_content": [],
            "subsections": [
                {
                    "section_title": "Neuronal properties",
                    "section_content": [
                        {
                            "sentence": "Scientists have identified some intrinsic neuronal properties that play an important role in generating membrane potential oscillations",
                            "refs": []
                        },
                        {
                            "sentence": "In particular, voltage-gated ion channels are critical in the generation of action potentials",
                            "refs": []
                        },
                        {
                            "sentence": "The dynamics of these ion channels have been captured in the well-established Hodgkin–Huxley model that describes how action potentials are initiated and propagated by means of a set of differential equations",
                            "refs": []
                        },
                        {
                            "sentence": "Using bifurcation analysis, different oscillatory varieties of these neuronal models can be determined, allowing for the classification of types of neuronal responses",
                            "refs": []
                        },
                        {
                            "sentence": "The oscillatory dynamics of neuronal spiking as identified in the Hodgkin–Huxley model closely agree with empirical findings.",
                            "refs": []
                        },
                        {
                            "sentence": "In addition to periodic spiking, subthreshold membrane potential oscillations, i.e",
                            "refs": []
                        },
                        {
                            "sentence": "resonance behavior that does not result in action potentials, may also contribute to oscillatory activity by facilitating synchronous activity of neighboring neurons",
                            "refs": []
                        },
                        {
                            "sentence": "Like pacemaker neurons in central pattern generators, subtypes of cortical cells fire bursts of spikes (brief clusters of spikes) rhythmically at preferred frequencies",
                            "refs": []
                        },
                        {
                            "sentence": "Bursting neurons have the potential to serve as pacemakers for synchronous network oscillations, and bursts of spikes may underlie or enhance neuronal resonance",
                            "refs": [
                                "[ERROR retrieving ref link]"
                            ]
                        },
                        {
                            "sentence": "Many of these neurons can be considered intrinsic oscillators, namely, neurons that generate their oscillations intrinsically, as their oscillation frequencies can be modified by local applications of glutamate in-vivo",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2923921"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Network properties",
                    "section_content": [
                        {
                            "sentence": "Apart from intrinsic properties of neurons, biological neural network properties are also an important source of oscillatory activity",
                            "refs": []
                        },
                        {
                            "sentence": "Neurons communicate with one another via synapses and affect the timing of spike trains in the post-synaptic neurons",
                            "refs": []
                        },
                        {
                            "sentence": "Depending on the properties of the connection, such as the coupling strength, time delay and whether coupling is excitatory or inhibitory, the spike trains of the interacting neurons may become synchronized",
                            "refs": []
                        },
                        {
                            "sentence": "Neurons are locally connected, forming small clusters that are called neural ensembles",
                            "refs": [
                                "https://research.vu.nl/ws/files/2548720/229630.pdf"
                            ]
                        },
                        {
                            "sentence": "Certain network structures promote oscillatory activity at specific frequencies",
                            "refs": []
                        },
                        {
                            "sentence": "For example, neuronal activity generated by two populations of interconnected inhibitory and excitatory cells can show spontaneous oscillations that are described by the Wilson-Cowan model.",
                            "refs": []
                        },
                        {
                            "sentence": "If a group of neurons engages in synchronized oscillatory activity, the neural ensemble can be mathematically represented as a single oscillator",
                            "refs": []
                        },
                        {
                            "sentence": "Different neural ensembles are coupled through long-range connections and form a network of weakly coupled oscillators at the next spatial scale",
                            "refs": [
                                "ISBN: 978-3-540-58967-9"
                            ]
                        },
                        {
                            "sentence": "Weakly coupled oscillators can generate a range of dynamics including oscillatory activity",
                            "refs": []
                        },
                        {
                            "sentence": "Long-range connections between different brain structures, such as the thalamus and the cortex (see thalamocortical oscillation), involve time-delays due to the finite conduction velocity of axons",
                            "refs": [
                                "ISBN: 978-0-521-53352-2"
                            ]
                        },
                        {
                            "sentence": "Because most connections are reciprocal, they form feed-back loops that support oscillatory activity",
                            "refs": []
                        },
                        {
                            "sentence": "Oscillations recorded from multiple cortical areas can become synchronized to form large-scale brain networks, whose dynamics and functional connectivity can be studied by means of spectral analysis and Granger causality measures",
                            "refs": []
                        },
                        {
                            "sentence": "Coherent activity of large-scale brain activity may form dynamic links between brain areas required for the integration of distributed information",
                            "refs": [
                                "http://www.pnas.org/cgi/reprint/101/26/9849.pdf"
                            ]
                        },
                        {
                            "sentence": "Microglia – the major immune cells of the brain – have been shown to play an important role in shaping network connectivity, and thus, influencing neuronal network oscillations both ex vivo and in vivo",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Neuromodulation",
                    "section_content": [
                        {
                            "sentence": "In addition to fast direct synaptic interactions between neurons forming a network, oscillatory activity is regulated by neuromodulators on a much slower time scale",
                            "refs": []
                        },
                        {
                            "sentence": "That is, the concentration levels of certain neurotransmitters are known to regulate the amount of oscillatory activity",
                            "refs": []
                        },
                        {
                            "sentence": "For instance, GABA concentration has been shown to be positively correlated with frequency of oscillations in induced stimuli",
                            "refs": []
                        },
                        {
                            "sentence": "A number of nuclei in the brainstem have diffuse projections throughout the brain influencing concentration levels of neurotransmitters such as norepinephrine, acetylcholine and serotonin",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2688873"
                            ]
                        },
                        {
                            "sentence": "These neurotransmitter systems affect the physiological state, e.g., wakefulness or arousal, and have a pronounced effect on amplitude of different brain waves, such as alpha activity",
                            "refs": []
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Mathematical description",
            "section_content": [
                {
                    "sentence": "Oscillations can often be described and analyzed using mathematics",
                    "refs": []
                },
                {
                    "sentence": "Mathematicians have identified several dynamical mechanisms that generate rhythmicity",
                    "refs": []
                },
                {
                    "sentence": "Among the most important are harmonic (linear) oscillators, limit cycle oscillators, and delayed-feedback oscillators",
                    "refs": []
                },
                {
                    "sentence": "Harmonic oscillations appear very frequently in nature—examples are sound waves, the motion of a pendulum, and vibrations of every sort",
                    "refs": [
                        "https://ui.adsabs.harvard.edu/abs/2004Sci...304.1926B"
                    ]
                },
                {
                    "sentence": "They generally arise when a physical system is perturbed by a small degree from a minimum-energy state, and are well understood mathematically.",
                    "refs": []
                },
                {
                    "sentence": "Noise-driven harmonic oscillators realistically simulate alpha rhythm in the waking EEG as well as slow waves and spindles in the sleep EEG",
                    "refs": []
                },
                {
                    "sentence": "Successful EEG analysis algorithms were based on such models",
                    "refs": []
                },
                {
                    "sentence": "Several other EEG components are better described by limit-cycle or delayed-feedback oscillations.",
                    "refs": []
                },
                {
                    "sentence": "Limit-cycle oscillations arise from physical systems that show large deviations from equilibrium, whereas delayed-feedback oscillations arise when components of a system affect each other after significant time delays",
                    "refs": []
                },
                {
                    "sentence": "Limit-cycle oscillations can be complex but there are powerful mathematical tools for analyzing them; the mathematics of delayed-feedback oscillations is primitive in comparison",
                    "refs": []
                },
                {
                    "sentence": "Linear oscillators and limit-cycle oscillators qualitatively differ in terms of how they respond to fluctuations in input",
                    "refs": []
                },
                {
                    "sentence": "In a linear oscillator, the frequency is more or less constant but the amplitude can vary greatly",
                    "refs": []
                },
                {
                    "sentence": "In a limit-cycle oscillator, the amplitude tends to be more or less constant but the frequency can vary greatly",
                    "refs": []
                },
                {
                    "sentence": "A heartbeat is an example of a limit-cycle oscillation in that the frequency of beats varies widely, while each individual beat continues to pump about the same amount of blood.",
                    "refs": []
                },
                {
                    "sentence": "Computational models adopt a variety of abstractions in order to describe complex oscillatory dynamics observed in brain activity",
                    "refs": []
                },
                {
                    "sentence": "Many models are used in the field, each defined at a different level of abstraction and trying to model different aspects of neural systems",
                    "refs": []
                },
                {
                    "sentence": "They range from models of the short-term behaviour of individual neurons, through models of how the dynamics of neural circuitry arise from interactions between individual neurons, to models of how behaviour can arise from abstract neural modules that represent complete subsystems.",
                    "refs": []
                }
            ],
            "subsections": [
                {
                    "section_title": "Single neuron model",
                    "section_content": [
                        {
                            "sentence": "A model of a biological neuron is a mathematical description of the properties of nerve cells, or neurons, that is designed to accurately describe and predict its biological processes",
                            "refs": []
                        },
                        {
                            "sentence": "One of the most successful neuron models is the Hodgkin–Huxley model, for which Hodgkin and Huxley won the 1963 Nobel Prize in physiology or medicine",
                            "refs": []
                        },
                        {
                            "sentence": "The model is based on data from the squid giant axon and consists of nonlinear differential equations that approximate the electrical characteristics of a neuron, including the generation and propagation of action potentials",
                            "refs": []
                        },
                        {
                            "sentence": "The model is so successful at describing these characteristics that variations of its \"conductance-based\" formulation continue to be utilized in neuron models over a half a century later",
                            "refs": []
                        },
                        {
                            "sentence": "The Hodgkin–Huxley model is too complicated to understand using classical mathematical techniques, so researchers often turn to simplifications such as the FitzHugh–Nagumo model and the Hindmarsh–Rose model, or highly idealized neuron models such as the leaky integrate-and-fire neuron, originally developed by Lapique in 1907",
                            "refs": []
                        },
                        {
                            "sentence": "Such models only capture salient membrane dynamics such as spiking or bursting at the cost of biophysical detail, but are more computationally efficient, enabling simulations of larger biological neural networks.",
                            "refs": [
                                "[ERROR retrieving ref link]",
                                "https://doi.org/10.1016%2FS0361-9230%2899%2900161-6"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Spiking model",
                    "section_content": [
                        {
                            "sentence": "A neural network model describes a population of physically interconnected neurons or a group of disparate neurons whose inputs or signalling targets define a recognizable circuit",
                            "refs": []
                        },
                        {
                            "sentence": "These models aim to describe how the dynamics of neural circuitry arise from interactions between individual neurons",
                            "refs": []
                        },
                        {
                            "sentence": "Local interactions between neurons can result in the synchronization of spiking activity and form the basis of oscillatory activity",
                            "refs": []
                        },
                        {
                            "sentence": "In particular, models of interacting pyramidal cells and inhibitory interneurons have been shown to generate brain rhythms such as gamma activity",
                            "refs": []
                        },
                        {
                            "sentence": "Similarly, it was shown that simulations of neural networks with a phenomenological model for neuronal response failures can predict spontaneous broadband neural oscillations",
                            "refs": [
                                "https://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.16.6410"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Neural mass model",
                    "section_content": [
                        {
                            "sentence": "Neural field models are another important tool in studying neural oscillations and are a mathematical framework describing evolution of variables such as mean firing rate in space and time",
                            "refs": []
                        },
                        {
                            "sentence": "In modeling the activity of large numbers of neurons, the central idea is to take the density of neurons to the continuum limit, resulting in spatially continuous neural networks",
                            "refs": []
                        },
                        {
                            "sentence": "Instead of modelling individual neurons, this approach approximates a group of neurons by its average properties and interactions",
                            "refs": []
                        },
                        {
                            "sentence": "It is based on the mean field approach, an area of statistical physics that deals with large-scale systems",
                            "refs": []
                        },
                        {
                            "sentence": "Models based on these principles have been used to provide mathematical descriptions of neural oscillations and EEG rhythms",
                            "refs": []
                        },
                        {
                            "sentence": "They have for instance been used to investigate visual hallucinations",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Kuramoto model",
                    "section_content": [
                        {
                            "sentence": "The Kuramoto model of coupled phase oscillators  is one of the most abstract and fundamental models used to investigate neural oscillations and synchronization",
                            "refs": [
                                "[ERROR retrieving ref link]"
                            ]
                        },
                        {
                            "sentence": "It captures the activity of a local system (e.g., a single neuron or neural ensemble) by its circular phase alone and hence ignores the amplitude of oscillations (amplitude is constant)",
                            "refs": []
                        },
                        {
                            "sentence": "Interactions amongst these oscillators are introduced by a simple algebraic form (such as a sine function) and collectively generate a dynamical pattern at the global scale.",
                            "refs": [
                                "[ERROR retrieving ref link]"
                            ]
                        },
                        {
                            "sentence": "The Kuramoto model is widely used to study oscillatory brain activity, and several extensions have been proposed that increase its neurobiological plausibility, for instance by incorporating topological properties of local cortical connectivity",
                            "refs": []
                        },
                        {
                            "sentence": "In particular, it describes how the activity of a group of interacting neurons can become synchronized and generate large-scale oscillations.",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2995481"
                            ]
                        },
                        {
                            "sentence": "Simulations using the Kuramoto model with realistic long-range cortical connectivity and time-delayed interactions reveal the emergence of slow patterned fluctuations that reproduce resting-state BOLD functional maps, which can be measured using fMRI",
                            "refs": []
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Activity patterns",
            "section_content": [
                {
                    "sentence": "Both single neurons and groups of neurons can generate oscillatory activity spontaneously",
                    "refs": []
                },
                {
                    "sentence": "In addition, they may show oscillatory responses to perceptual input or motor output",
                    "refs": []
                },
                {
                    "sentence": "Some types of neurons will fire rhythmically in the absence of any synaptic input",
                    "refs": []
                },
                {
                    "sentence": "Likewise, brain-wide activity reveals oscillatory activity while subjects do not engage in any activity, so-called resting-state activity",
                    "refs": []
                },
                {
                    "sentence": "These ongoing rhythms can change in different ways in response to perceptual input or motor output",
                    "refs": []
                },
                {
                    "sentence": "Oscillatory activity may respond by increases or decreases in frequency and amplitude or show a temporary interruption, which is referred to as phase resetting",
                    "refs": []
                },
                {
                    "sentence": "In addition, external activity may not interact with ongoing activity at all, resulting in an additive response.",
                    "refs": []
                }
            ],
            "subsections": [
                {
                    "section_title": "Ongoing activity",
                    "section_content": [
                        {
                            "sentence": "Spontaneous activity is brain activity in the absence of an explicit task, such as sensory input or motor output, and hence also referred to as resting-state activity",
                            "refs": []
                        },
                        {
                            "sentence": "It is opposed to induced activity, i.e",
                            "refs": []
                        },
                        {
                            "sentence": "brain activity that is induced by sensory stimuli or motor responses.",
                            "refs": []
                        },
                        {
                            "sentence": "The term ongoing brain activity is used in electroencephalography and magnetoencephalography for those signal components that are not associated with the processing of a stimulus or the occurrence of specific other events, such as moving a body part, i.e",
                            "refs": []
                        },
                        {
                            "sentence": "events that do not form evoked potentials/evoked fields, or induced activity.",
                            "refs": []
                        },
                        {
                            "sentence": "Spontaneous activity is usually considered to be noise if one is interested in stimulus processing; however, spontaneous activity is considered to play a crucial role during brain development, such as in network formation and synaptogenesis",
                            "refs": []
                        },
                        {
                            "sentence": "Spontaneous activity may be informative regarding the current mental state of the person (e.g",
                            "refs": []
                        },
                        {
                            "sentence": "wakefulness, alertness) and is often used in sleep research",
                            "refs": []
                        },
                        {
                            "sentence": "Certain types of oscillatory activity, such as alpha waves, are part of spontaneous activity",
                            "refs": []
                        },
                        {
                            "sentence": "Statistical analysis of power fluctuations of alpha activity reveals a bimodal distribution, i.e",
                            "refs": []
                        },
                        {
                            "sentence": "a high- and low-amplitude mode, and hence shows that resting-state activity does not just reflect a noise process",
                            "refs": []
                        },
                        {
                            "sentence": "In case of fMRI, spontaneous fluctuations in the blood-oxygen-level dependent (BOLD) signal reveal correlation patterns that are linked to resting state networks, such as the default network",
                            "refs": []
                        },
                        {
                            "sentence": "The temporal evolution of resting state networks is correlated with fluctuations of oscillatory EEG activity in different frequency bands",
                            "refs": [
                                "https://doi.org/10.1038%2Fnrn2201"
                            ]
                        },
                        {
                            "sentence": "Ongoing brain activity may also have an important role in perception, as it may interact with activity related to incoming stimuli",
                            "refs": []
                        },
                        {
                            "sentence": "Indeed, EEG studies suggest that visual perception is dependent on both the phase and amplitude of cortical oscillations",
                            "refs": []
                        },
                        {
                            "sentence": "For instance, the amplitude and phase of alpha activity at the moment of visual stimulation predicts whether a weak stimulus will be perceived by the subject",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Frequency response",
                    "section_content": [
                        {
                            "sentence": "In response to input, a neuron or neuronal ensemble may change the frequency at which it oscillates, thus changing the rate at which it spikes",
                            "refs": []
                        },
                        {
                            "sentence": "Often, a neuron's firing rate depends on the summed activity it receives",
                            "refs": []
                        },
                        {
                            "sentence": "Frequency changes are also commonly observed in central pattern generators and directly relate to the speed of motor activities, such as step frequency in walking",
                            "refs": []
                        },
                        {
                            "sentence": "However, changes in relative oscillation frequency between different brain areas is not so common because the frequency of oscillatory activity is often related to the time delays between brain areas.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Amplitude response",
                    "section_content": [
                        {
                            "sentence": "Next to evoked activity, neural activity related to stimulus processing may result in induced activity",
                            "refs": []
                        },
                        {
                            "sentence": "Induced activity refers to modulation in ongoing brain activity induced by processing of stimuli or movement preparation",
                            "refs": []
                        },
                        {
                            "sentence": "Hence, they reflect an indirect response in contrast to evoked responses",
                            "refs": []
                        },
                        {
                            "sentence": "A well-studied type of induced activity is amplitude change in oscillatory activity",
                            "refs": []
                        },
                        {
                            "sentence": "For instance, gamma activity often increases during increased mental activity such as during object representation",
                            "refs": []
                        },
                        {
                            "sentence": "Because induced responses may have different phases across measurements and therefore would cancel out during averaging, they can only be obtained using time-frequency analysis",
                            "refs": [
                                "https://doi.org/10.1016%2FS1364-6613%2899%2901299-1"
                            ]
                        },
                        {
                            "sentence": "Induced activity generally reflects the activity of numerous neurons: amplitude changes in oscillatory activity are thought to arise from the synchronization of neural activity, for instance by synchronization of spike timing or membrane potential fluctuations of individual neurons",
                            "refs": []
                        },
                        {
                            "sentence": "Increases in oscillatory activity are therefore often referred to as event-related synchronization, while decreases are referred to as event-related desynchronization",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Phase resetting",
                    "section_content": [
                        {
                            "sentence": "Phase resetting occurs when input to a neuron or neuronal ensemble resets the phase of ongoing oscillations",
                            "refs": []
                        },
                        {
                            "sentence": "It is very common in single neurons where spike timing is adjusted to neuronal input (a neuron may spike at a fixed delay in response to periodic input, which is referred to as phase locking ) and may also occur in neuronal ensembles when the phases of their neurons are adjusted simultaneously",
                            "refs": [
                                "ISBN: 978-3-540-65697-5",
                                "[ERROR retrieving ref link]"
                            ]
                        },
                        {
                            "sentence": "Phase resetting is fundamental for the synchronization of different neurons or different brain regions   because the timing of spikes can become phase locked to the activity of other neurons.",
                            "refs": [
                                "https://doi.org/10.1038%2F35067550",
                                "ISBN: 978-0-521-53352-2"
                            ]
                        },
                        {
                            "sentence": "Phase resetting also permits the study of evoked activity, a term used in electroencephalography and magnetoencephalography for responses in brain activity that are directly related to stimulus-related activity",
                            "refs": []
                        },
                        {
                            "sentence": "Evoked potentials and event-related potentials are obtained from an electroencephalogram by stimulus-locked averaging, i.e",
                            "refs": []
                        },
                        {
                            "sentence": "averaging different trials at fixed latencies around the presentation of a stimulus",
                            "refs": []
                        },
                        {
                            "sentence": "As a consequence, those signal components that are the same in each single measurement are conserved and all others, i.e",
                            "refs": []
                        },
                        {
                            "sentence": "ongoing or spontaneous activity, are averaged out",
                            "refs": []
                        },
                        {
                            "sentence": "That is, event-related potentials only reflect oscillations in brain activity that are phase-locked to the stimulus or event",
                            "refs": []
                        },
                        {
                            "sentence": "Evoked activity is often considered to be independent from ongoing brain activity, although this is an ongoing debate",
                            "refs": []
                        }
                    ],
                    "subsections": [
                        {
                            "section_title": "Asymmetric amplitude modulation",
                            "section_content": [
                                {
                                    "sentence": "It has recently been proposed that even if phases are not aligned across trials, induced activity may still cause event-related potentials because ongoing brain oscillations may not be symmetric and thus amplitude modulations may result in a baseline shift that does not average out",
                                    "refs": []
                                },
                                {
                                    "sentence": "This model implies that slow event-related responses, such as asymmetric alpha activity, could result from asymmetric brain oscillation amplitude modulations, such as an asymmetry of the intracellular currents that propagate forward and backward down the dendrites",
                                    "refs": [
                                        "https://doi.org/10.1111%2Fj.1460-9568.2007.05553.x",
                                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6670375"
                                    ]
                                },
                                {
                                    "sentence": "Under this assumption, asymmetries in the dendritic current would cause asymmetries in oscillatory activity measured by EEG and MEG, since dendritic currents in pyramidal cells are generally thought to generate EEG and MEG signals that can be measured at the scalp",
                                    "refs": [
                                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2972683"
                                    ]
                                }
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "section_title": "Cross-frequency coupling",
                    "section_content": [
                        {
                            "sentence": "Cross-frequency coupling (CFC) describes the coupling (statistical correlation) between a slow wave and a fast wave",
                            "refs": []
                        },
                        {
                            "sentence": "There are many kinds, generally written as A-B coupling, meaning the A of a slow wave is coupled with the B of a fast wave",
                            "refs": []
                        },
                        {
                            "sentence": "For example, phase–amplitude coupling is where the phase of a slow wave is coupled with the amplitude of a fast wave",
                            "refs": []
                        },
                        {
                            "sentence": "The theta-gamma code is a coupling between theta wave and gamma wave in the hippocampal network",
                            "refs": []
                        },
                        {
                            "sentence": "During a theta wave, 4 to 8 non-overlapping neuron ensembles are activated in sequence",
                            "refs": []
                        },
                        {
                            "sentence": "This has been hypothesized to form a neural code representing multiple items in a temporal frame",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3648857",
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6584963"
                            ]
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Function",
            "section_content": [
                {
                    "sentence": "Neural synchronization can be modulated by task constraints, such as attention, and is thought to play a role in feature binding,  neuronal communication,  and motor coordination",
                    "refs": [
                        "https://doi.org/10.1146%2Fannurev.ph.55.030193.002025",
                        "https://doi.org/10.1016%2Fj.tics.2005.08.011"
                    ]
                },
                {
                    "sentence": "Neuronal oscillations became a hot topic in neuroscience in the 1990s when the studies of the visual system of the brain by Gray, Singer and others appeared to support the neural binding hypothesis",
                    "refs": [
                        "https://doi.org/10.1038%2Fnrn1650"
                    ]
                },
                {
                    "sentence": "According to this idea, synchronous oscillations in neuronal ensembles bind neurons representing different features of an object",
                    "refs": [
                        "https://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.308.6735"
                    ]
                },
                {
                    "sentence": "For example, when a person looks at a tree, visual cortex neurons representing the tree trunk and those representing the branches of the same tree would oscillate in synchrony to form a single representation of the tree",
                    "refs": []
                },
                {
                    "sentence": "This phenomenon is best seen in local field potentials which reflect the synchronous activity of local groups of neurons, but has also been shown in EEG and MEG recordings providing increasing evidence for a close relation between synchronous oscillatory activity and a variety of cognitive functions such as perceptual grouping  and attentional top-down control",
                    "refs": [
                        "https://doi.org/10.1146%2Fannurev.ph.55.030193.002025"
                    ]
                }
            ],
            "subsections": [
                {
                    "section_title": "Pacemaker",
                    "section_content": [
                        {
                            "sentence": "Cells in the sinoatrial node, located in the right atrium of the heart, spontaneously depolarize approximately 100 times per minute",
                            "refs": []
                        },
                        {
                            "sentence": "Although all of the heart's cells have the ability to generate action potentials that trigger cardiac contraction, the sinoatrial node normally initiates it, simply because it generates impulses slightly faster than the other areas",
                            "refs": []
                        },
                        {
                            "sentence": "Hence, these cells generate the normal sinus rhythm and are called pacemaker cells as they directly control the heart rate",
                            "refs": []
                        },
                        {
                            "sentence": "In the absence of extrinsic neural and hormonal control, cells in the SA node will rhythmically discharge",
                            "refs": []
                        },
                        {
                            "sentence": "The sinoatrial node is richly innervated by the autonomic nervous system, which up or down regulates the spontaneous firing frequency of the pacemaker cells.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Central pattern generator",
                    "section_content": [
                        {
                            "sentence": "Synchronized firing of neurons also forms the basis of periodic motor commands for rhythmic movements",
                            "refs": []
                        },
                        {
                            "sentence": "These rhythmic outputs are produced by a group of interacting neurons that form a network, called a central pattern generator",
                            "refs": []
                        },
                        {
                            "sentence": "Central pattern generators are neuronal circuits that—when activated—can produce rhythmic motor patterns in the absence of sensory or descending inputs that carry specific timing information",
                            "refs": []
                        },
                        {
                            "sentence": "Examples are walking, breathing, and swimming,  Most evidence for central pattern generators comes from lower animals, such as the lamprey, but there is also evidence for spinal central pattern generators in humans",
                            "refs": [
                                "https://doi.org/10.1016%2FS0960-9822%2801%2900581-4"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Information processing",
                    "section_content": [
                        {
                            "sentence": "Neuronal spiking is generally considered the basis for information transfer in the brain",
                            "refs": []
                        },
                        {
                            "sentence": "For such a transfer, information needs to be coded in a spiking pattern",
                            "refs": []
                        },
                        {
                            "sentence": "Different types of coding schemes have been proposed, such as rate coding and temporal coding",
                            "refs": []
                        },
                        {
                            "sentence": "Neural oscillations could create periodic time windows in which input spikes have larger effect on neurons, thereby providing a mechanism for decoding temporal codes",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Temporal decoding",
                    "section_content": [
                        {
                            "sentence": "Single-cell intrinsic oscillators serve as valuable tools for decoding temporally-encoded sensory information",
                            "refs": []
                        },
                        {
                            "sentence": "This information is encoded through inter-spike intervals, and intrinsic oscillators can act as 'temporal rulers' for precisely measuring these intervals",
                            "refs": []
                        },
                        {
                            "sentence": "One notable mechanism for achieving this is the neuronal phase-locked loop (NPLL)",
                            "refs": []
                        },
                        {
                            "sentence": "In this mechanism, cortical oscillators undergo modulation influenced by the firing rates of thalamocortical 'phase detectors,' which, in turn, gauge the disparity between the cortical and sensory periodicity",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Perception",
                    "section_content": [
                        {
                            "sentence": "Synchronization of neuronal firing may serve as a means to group spatially segregated neurons that respond to the same stimulus in order to bind these responses for further joint processing, i.e",
                            "refs": []
                        },
                        {
                            "sentence": "to exploit temporal synchrony to encode relations",
                            "refs": []
                        },
                        {
                            "sentence": "Purely theoretical formulations of the binding-by-synchrony hypothesis were proposed first,  but subsequently extensive experimental evidence has been reported supporting the potential role of synchrony as a relational code",
                            "refs": [
                                "https://doi.org/10.1037%2Fh0037149"
                            ]
                        },
                        {
                            "sentence": "The functional role of synchronized oscillatory activity in the brain was mainly established in experiments performed on awake kittens with multiple electrodes implanted in the visual cortex",
                            "refs": []
                        },
                        {
                            "sentence": "These experiments showed that groups of spatially segregated neurons engage in synchronous oscillatory activity when activated by visual stimuli",
                            "refs": []
                        },
                        {
                            "sentence": "The frequency of these oscillations was in the range of 40 Hz and differed from the periodic activation induced by the grating, suggesting that the oscillations and their synchronization were due to internal neuronal interactions",
                            "refs": []
                        },
                        {
                            "sentence": "Similar findings were shown in parallel by the group of Eckhorn, providing further evidence for the functional role of neural synchronization in feature binding",
                            "refs": [
                                "https://ui.adsabs.harvard.edu/abs/1989Natur.338..334G"
                            ]
                        },
                        {
                            "sentence": "Since then, numerous studies have replicated these findings and extended them to different modalities such as EEG, providing extensive evidence of the functional role of gamma oscillations in visual perception.",
                            "refs": [
                                "https://doi.org/10.1007%2FBF00202899"
                            ]
                        },
                        {
                            "sentence": "Gilles Laurent and colleagues showed that oscillatory synchronization has an important functional role in odor perception",
                            "refs": []
                        },
                        {
                            "sentence": "Perceiving different odors leads to different subsets of neurons firing on different sets of oscillatory cycles",
                            "refs": []
                        },
                        {
                            "sentence": "These oscillations can be disrupted by GABA blocker picrotoxin,  and the disruption of the oscillatory synchronization leads to impairment of behavioral discrimination of chemically similar odorants in bees,  and to more similar responses across odors in downstream β-lobe neurons",
                            "refs": [
                                "https://ui.adsabs.harvard.edu/abs/1996Natur.384..162W",
                                "https://ui.adsabs.harvard.edu/abs/1996Sci...274..976M",
                                "https://ui.adsabs.harvard.edu/abs/1997Natur.390...70S"
                            ]
                        },
                        {
                            "sentence": "Recent follow-up of this work has shown that oscillations create periodic integration windows for Kenyon cells in the insect mushroom body, such that incoming spikes from the antennal lobe are more effective in activating Kenyon cells only at specific phases of the oscillatory cycle",
                            "refs": [
                                "https://ui.adsabs.harvard.edu/abs/1998Natur.395..693M"
                            ]
                        },
                        {
                            "sentence": "Neural oscillations are also thought be involved in the sense of time  and in somatosensory perception",
                            "refs": [
                                "https://doi.org/10.1038%2Fnrn1764"
                            ]
                        },
                        {
                            "sentence": "However, recent findings argue against a clock-like function of cortical gamma oscillations",
                            "refs": [
                                "https://doi.org/10.1016%2FS0079-6123%2801%2930007-9"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Motor coordination",
                    "section_content": [
                        {
                            "sentence": "Oscillations have been commonly reported in the motor system",
                            "refs": []
                        },
                        {
                            "sentence": "Pfurtscheller and colleagues found a reduction in alpha (8–12 Hz) and beta (13–30 Hz) oscillations in EEG activity when subjects made a movement",
                            "refs": []
                        },
                        {
                            "sentence": "Using intra-cortical recordings, similar changes in oscillatory activity were found in the motor cortex when the monkeys performed motor acts that required significant attention",
                            "refs": [
                                "https://doi.org/10.1016%2FS1388-2457%2899%2900141-8",
                                "https://doi.org/10.1016%2F0013-4694%2877%2990235-8"
                            ]
                        },
                        {
                            "sentence": "In addition, oscillations at spinal level become synchronised to beta oscillations in the motor cortex during constant muscle activation, as determined by cortico-muscular coherence",
                            "refs": [
                                "https://doi.org/10.1152%2Fjn.1996.76.6.3949",
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC46533"
                            ]
                        },
                        {
                            "sentence": "Likewise, muscle activity of different muscles reveals inter-muscular coherence at multiple distinct frequencies reflecting the underlying neural circuitry involved in motor coordination",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1156860",
                                "https://doi.org/10.1152%2Fjn.1997.77.6.3401",
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1159515"
                            ]
                        },
                        {
                            "sentence": "Recently it was found that cortical oscillations propagate as travelling waves across the surface of the motor cortex along dominant spatial axes characteristic of the local circuitry of the motor cortex",
                            "refs": []
                        },
                        {
                            "sentence": "It has been proposed that motor commands in the form of travelling waves can be spatially filtered by the descending fibres to selectively control muscle force",
                            "refs": [
                                "https://doi.org/10.1038%2Fnn1802"
                            ]
                        },
                        {
                            "sentence": "Simulations have shown that ongoing wave activity in cortex can elicit steady muscle force with physiological levels of EEG-EMG coherence",
                            "refs": [
                                "https://doi.org/10.1016%2Fj.neucom.2015.01.088"
                            ]
                        },
                        {
                            "sentence": "Oscillatory rhythms at 10 Hz have been recorded in a brain area called the inferior olive, which is associated with the cerebellum",
                            "refs": []
                        },
                        {
                            "sentence": "These oscillations are also observed in motor output of physiological tremor  and when performing slow finger movements",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1182792",
                                "https://doi.org/10.1152%2Fjn.1978.41.3.557"
                            ]
                        },
                        {
                            "sentence": "These findings may indicate that the human brain controls continuous movements intermittently",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1143894"
                            ]
                        },
                        {
                            "sentence": "In support, it was shown that these movement discontinuities are directly correlated to oscillatory activity in a cerebello-thalamo-cortical loop, which may represent a neural mechanism for the intermittent motor control",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Memory",
                    "section_content": [
                        {
                            "sentence": "Neural oscillations, in particular theta activity, are extensively linked to memory function",
                            "refs": []
                        },
                        {
                            "sentence": "Theta rhythms are very strong in rodent hippocampi and entorhinal cortex during learning and memory retrieval, and they are believed to be vital to the induction of long-term potentiation, a potential cellular mechanism for learning and memory",
                            "refs": []
                        },
                        {
                            "sentence": "Coupling between theta and gamma activity is thought to be vital for memory functions, including episodic memory",
                            "refs": []
                        },
                        {
                            "sentence": "Tight coordination of single-neuron spikes with local theta oscillations is linked to successful memory formation in humans, as more stereotyped spiking predicts better memory",
                            "refs": [
                                "[ERROR retrieving ref link]",
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2856712"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Sleep and consciousness",
                    "section_content": [
                        {
                            "sentence": "Sleep is a naturally recurring state characterized by reduced or absent consciousness and proceeds in cycles of rapid eye movement (REM) and non-rapid eye movement (NREM) sleep",
                            "refs": []
                        },
                        {
                            "sentence": "Sleep stages are characterized by spectral content of EEG: for instance, stage N1 refers to the transition of the brain from alpha waves (common in the awake state) to theta waves, whereas stage N3 (deep or slow-wave sleep) is characterized by the presence of delta waves",
                            "refs": []
                        },
                        {
                            "sentence": "The normal order of sleep stages is N1 → N2 → N3 → N2 → REM",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7181624"
                            ]
                        },
                        {
                            "sentence": "[citation needed]",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Development",
                    "section_content": [
                        {
                            "sentence": "Neural oscillations may play a role in neural development",
                            "refs": []
                        },
                        {
                            "sentence": "For example, retinal waves are thought to have properties that define early connectivity of circuits and synapses between cells in the retina",
                            "refs": []
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Pathology",
            "section_content": [
                {
                    "sentence": "Specific types of neural oscillations may also appear in pathological situations, such as Parkinson's disease or epilepsy",
                    "refs": []
                },
                {
                    "sentence": "These pathological oscillations often consist of an aberrant version of a normal oscillation",
                    "refs": []
                },
                {
                    "sentence": "For example, one of the best known types is the spike and wave oscillation, which is typical of generalized or absence epileptic seizures, and which resembles normal sleep spindle oscillations.",
                    "refs": []
                }
            ],
            "subsections": [
                {
                    "section_title": "Tremor",
                    "section_content": [
                        {
                            "sentence": "A tremor is an involuntary, somewhat rhythmic, muscle contraction and relaxation involving to-and-fro movements of one or more body parts",
                            "refs": []
                        },
                        {
                            "sentence": "It is the most common of all involuntary movements and can affect the hands, arms, eyes, face, head, vocal cords, trunk, and legs",
                            "refs": []
                        },
                        {
                            "sentence": "Most tremors occur in the hands",
                            "refs": []
                        },
                        {
                            "sentence": "In some people, tremor is a symptom of another neurological disorder",
                            "refs": []
                        },
                        {
                            "sentence": "Many different forms of tremor have been identified, such as essential tremor or Parkinsonian tremor",
                            "refs": []
                        },
                        {
                            "sentence": "It is argued that tremors are likely to be multifactorial in origin, with contributions from neural oscillations in the central nervous systems, but also from peripheral mechanisms such as reflex loop resonances",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Epilepsy",
                    "section_content": [
                        {
                            "sentence": "Epilepsy is a common chronic neurological disorder characterized by seizures",
                            "refs": []
                        },
                        {
                            "sentence": "These seizures are transient signs and/or symptoms of abnormal, excessive or hypersynchronous neuronal activity in the brain",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Thalamocortical dysrhythmia",
                    "section_content": [
                        {
                            "sentence": "In thalamocortical dysrhythmia (TCD), normal thalamocortical resonance is disrupted",
                            "refs": []
                        },
                        {
                            "sentence": "The thalamic loss of input allows the frequency of the thalamo-cortical column to slow into the theta or delta band as identified by MEG and EEG by machine learning",
                            "refs": []
                        },
                        {
                            "sentence": "TCD can be treated with neurosurgical methods like thalamotomy.",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5856824"
                            ]
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Applications",
            "section_content": [],
            "subsections": [
                {
                    "section_title": "Clinical endpoints",
                    "section_content": [
                        {
                            "sentence": "Neural oscillations are sensitive to several drugs influencing brain activity; accordingly, biomarkers based on neural oscillations are emerging as secondary endpoints in clinical trials and in quantifying effects in pre-clinical studies",
                            "refs": []
                        },
                        {
                            "sentence": "These biomarkers are often named \"EEG biomarkers\" or \"Neurophysiological Biomarkers\" and are quantified using quantitative electroencephalography (qEEG)",
                            "refs": []
                        },
                        {
                            "sentence": "EEG biomarkers can be extracted from the EEG using the open-source Neurophysiological Biomarker Toolbox.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Brain–computer interface",
                    "section_content": [
                        {
                            "sentence": "Neural oscillation has been applied as a control signal in various brain–computer interfaces (BCIs)",
                            "refs": []
                        },
                        {
                            "sentence": "For example, a non-invasive BCI  can be created by placing electrodes on the scalp and then measuring the weak electric signals",
                            "refs": [
                                "https://doi.org/10.1111%2Fj.1469-8986.2006.00456.x"
                            ]
                        },
                        {
                            "sentence": "Although individual neuron activities cannot be recorded through non-invasive BCI because the skull damps and blurs the electromagnetic signals, oscillatory activity can still be reliably detected",
                            "refs": []
                        },
                        {
                            "sentence": "The BCI was introduced by Vidal in 1973  as challenge of using EEG signals to control objects outside human body.",
                            "refs": [
                                "https://doi.org/10.1146%2Fannurev.bb.02.060173.001105"
                            ]
                        },
                        {
                            "sentence": "After the BCI challenge, in 1988, alpha rhythm was used in a brain rhythm based BCI for control of a physical object, a robot",
                            "refs": []
                        },
                        {
                            "sentence": "Alpha rhythm based BCI was the first BCI for control of a robot",
                            "refs": [
                                "https://doi.org/10.1109%2FIEMBS.1988.95357",
                                "https://doi.org/10.1109%2FIMC.1990.687362"
                            ]
                        },
                        {
                            "sentence": "In particular, some forms of BCI allow users to control a device by measuring the amplitude of oscillatory activity in specific frequency bands, including mu and beta rhythms.",
                            "refs": [
                                "https://doi.org/10.20388%2FOMP.003.0035",
                                "https://doi.org/10.1152%2Fphysrev.00027.2016"
                            ]
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Examples",
            "section_content": [
                {
                    "sentence": "A non-inclusive list of types of oscillatory activity found in the central nervous system:",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "See also",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "References",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "Further reading",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "External links",
            "section_content": [],
            "subsections": []
        }
    ],
    "references": {
        "1": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7054256",
        "2": "[ERROR retrieving ref link]",
        "3": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4219458",
        "4": "http://echo.mpiwg-berlin.mpg.de/ECHOdocuView?url=/permanent/vlp/lit27690/index.meta&ww=0.7143&wh=0.7143&wx=0.2632",
        "5": "https://doi.org/10.1080%2F0964704x.2013.867600",
        "6": "[ERROR retrieving ref link]",
        "7": "https://doi.org/10.1016%2Fj.tics.2005.08.011",
        "8": "https://doi.org/10.1038%2Fnrn2979",
        "9": "https://doi.org/10.1038%2Fnrn1650",
        "10": "https://doi.org/10.1126%2Fscience.1247003",
        "11": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5675530",
        "12": "https://www.jneurosci.org/content/early/2021/08/24/JNEUROSCI.0583-21.2021",
        "13": "https://doi.org/10.1016%2Fj.neuron.2019.11.001",
        "14": "https://doi.org/10.1007%2FBF01797193",
        "15": "https://doi.org/10.1126%2Fscience.1247003",
        "16": "https://doi.org/10.1016%2F0013-4694%2857%2990088-3",
        "17": "https://doi.org/10.1016%2FS1364-6613%2800%2901568-0",
        "18": "https://doi.org/10.1038%2F35067550",
        "19": "[ERROR retrieving ref link]",
        "20": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1182792",
        "21": "https://doi.org/10.1152%2Fjn.00772.2007",
        "22": "https://doi.org/10.1086%2F286819",
        "23": "https://doi.org/10.1007/BF00337259",
        "24": "https://www.science.org/doi/10.1126/science.3281253",
        "25": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5326682",
        "26": "ISBN: 978-3-540-58967-9",
        "27": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2923921",
        "28": "https://books.google.com/books?id=gu5qAAAAMAAJ",
        "29": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3655711",
        "30": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1692417",
        "31": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3505610",
        "32": "https://doi.org/10.1016%2FS0167-8760%2801%2900177-5",
        "33": "https://doi.org/10.1016%2Fj.neuroimage.2013.11.047",
        "34": "https://ui.adsabs.harvard.edu/abs/1988Sci...242.1654L",
        "35": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC50921",
        "36": "[ERROR retrieving ref link]",
        "37": "https://research.vu.nl/ws/files/2548720/229630.pdf",
        "38": "ISBN: 978-0-521-53352-2",
        "39": "http://www.pnas.org/cgi/reprint/101/26/9849.pdf",
        "40": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC11208608",
        "41": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2688873",
        "42": "https://doi.org/10.1016%2F0013-4694%2849%2990219-9",
        "43": "https://ui.adsabs.harvard.edu/abs/2004Sci...304.1926B",
        "44": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3500626",
        "45": "[ERROR retrieving ref link]",
        "46": "https://doi.org/10.1016%2FS0361-9230%2899%2900161-6",
        "47": "https://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.16.6410",
        "48": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4626558",
        "49": "https://doi.org/10.1007%2Fs004220000160",
        "50": "[ERROR retrieving ref link]",
        "51": "[ERROR retrieving ref link]",
        "52": "[ERROR retrieving ref link]",
        "53": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2995481",
        "54": "https://zenodo.org/record/3421175",
        "55": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6665653",
        "56": "https://doi.org/10.1038%2Fnrn2201",
        "57": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC196925",
        "58": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2724892",
        "59": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6665641",
        "60": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6671447",
        "61": "https://doi.org/10.1016%2FS1364-6613%2899%2901299-1",
        "62": "https://doi.org/10.1016%2FS1388-2457%2899%2900141-8",
        "63": "ISBN: 978-3-540-65697-5",
        "64": "https://ui.adsabs.harvard.edu/abs/2002Sci...295..690M",
        "65": "https://doi.org/10.1016%2Fj.neuroimage.2004.10.020",
        "66": "https://doi.org/10.1111%2Fj.1460-9568.2007.05553.x",
        "67": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6670375",
        "68": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2972683",
        "69": "https://aaltodoc.aalto.fi/handle/123456789/18757",
        "70": "https://www.sciencedirect.com/science/article/pii/S0166223615002088",
        "71": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3648857",
        "72": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6584963",
        "73": "https://doi.org/10.1146%2Fannurev.ph.55.030193.002025",
        "74": "https://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.308.6735",
        "75": "https://doi.org/10.1016%2FS0960-9822%2801%2900581-4",
        "76": "https://ui.adsabs.harvard.edu/abs/1998NYASA.860..360D",
        "77": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4408427",
        "78": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5171764",
        "79": "[ERROR retrieving ref link]",
        "80": "https://doi.org/10.1037%2Fh0037149",
        "81": "https://ui.adsabs.harvard.edu/abs/1989Natur.338..334G",
        "82": "https://doi.org/10.1007%2FBF00202899",
        "83": "https://ui.adsabs.harvard.edu/abs/1996Natur.384..162W",
        "84": "https://ui.adsabs.harvard.edu/abs/1996Sci...274..976M",
        "85": "https://ui.adsabs.harvard.edu/abs/1997Natur.390...70S",
        "86": "https://ui.adsabs.harvard.edu/abs/1998Natur.395..693M",
        "87": "https://doi.org/10.1038%2Fnrn1764",
        "88": "https://doi.org/10.1016%2FS0079-6123%2801%2930007-9",
        "89": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3518456",
        "90": "https://doi.org/10.1016%2F0013-4694%2877%2990235-8",
        "91": "https://doi.org/10.1152%2Fjn.1996.76.6.3949",
        "92": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC46533",
        "93": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1156860",
        "94": "https://doi.org/10.1152%2Fjn.1997.77.6.3401",
        "95": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1159515",
        "96": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4669476",
        "97": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6021138",
        "98": "https://doi.org/10.1038%2Fnn1802",
        "99": "https://doi.org/10.1016%2Fj.neucom.2015.01.088",
        "100": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3814333",
        "101": "https://doi.org/10.1152%2Fjn.1978.41.3.557",
        "102": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1143894",
        "103": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC122359",
        "104": "[ERROR retrieving ref link]",
        "105": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2856712",
        "106": "https://authors.library.caltech.edu/18277/2/nature08860-s1.pdf",
        "107": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7181624",
        "108": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2706239",
        "109": "https://doi.org/10.1093%2Fbrain%2F123.8.1545",
        "110": "https://ui.adsabs.harvard.edu/abs/2008PhRvE..77f1911S",
        "111": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5856824",
        "112": "https://doi.org/10.1111%2Fj.1469-8986.2006.00456.x",
        "113": "https://doi.org/10.1146%2Fannurev.bb.02.060173.001105",
        "114": "https://doi.org/10.1109%2FIEMBS.1988.95357",
        "115": "https://doi.org/10.1109%2FIMC.1990.687362",
        "116": "https://doi.org/10.20388%2FOMP.003.0035",
        "117": "https://doi.org/10.1152%2Fphysrev.00027.2016"
    },
    "flair_entities": [
        "adolf beck",
        "hans berger",
        "vidal",
        "gaba",
        "singer",
        "the kuramoto",
        "gray",
        "gilles laurent",
        "vladimir vladimirovich pravdich-neminsky",
        "granger",
        "eckhorn",
        "lapique",
        "tcd",
        "class i and ii",
        "meg",
        "huxley",
        "nobel prize",
        "kenyon",
        "pfurtscheller",
        "eeg-emg",
        "parkinson",
        "cfc",
        "wilson-cowan",
        "kuramoto",
        "hodgkin",
        "bci",
        "hodgkin–huxley",
        "parkinsonian",
        "fitzhugh–nagumo",
        "eeg",
        "richard caton",
        "hindmarsh–rose"
    ]
}