{
    "title": "Condensed_milk",
    "url": "https://en.wikipedia.org/wiki/Condensed_milk",
    "summary": "Condensed milk is cow's milk from which water has been removed (roughly 60% of it). It is most often found with sugar added, in the form of sweetened condensed milk, to the extent that the terms \"condensed milk\" and \"sweetened condensed milk\" are often used interchangeably today. Sweetened condensed milk is a very thick, sweet product, which when canned can last for years without refrigeration if not opened. The product is used in numerous dessert dishes in many countries.\nA related product is evaporated milk, which has undergone a lengthier preservation process because it is not sweetened. Evaporated milk is known in some countries as unsweetened condensed milk.",
    "content": [
        {
            "section_title": "History",
            "section_content": [
                {
                    "sentence": "According to the writings of Marco Polo, in the thirteenth century the Tatars were able to condense milk",
                    "refs": []
                },
                {
                    "sentence": "Marco Polo reported that ten pounds (4.5 kg) of milk paste was carried by each man, who would subsequently mix the product with water",
                    "refs": []
                },
                {
                    "sentence": "However, this probably refers to the soft Tatar curd (katyk), which can be made into a drink (ayran) by diluting it, and therefore refers to fermented, not fresh, milk concentrate.",
                    "refs": []
                },
                {
                    "sentence": "Nicolas Appert condensed milk in France in 1820  and in 1835, English civil engineer William Newton added sugar as an additional measure of preservation",
                    "refs": [
                        "[ERROR retrieving ref link]"
                    ]
                },
                {
                    "sentence": "Before these developments, milk could be kept fresh for only a short while and was available only in the immediate vicinity of a lactating cow",
                    "refs": [
                        "https://wellcomecollection.org/works/a85t2djs/items?canvas=3"
                    ]
                },
                {
                    "sentence": "While returning to the United States from a trip to England in 1851, Gail Borden Jr",
                    "refs": []
                },
                {
                    "sentence": "was devastated by the deaths of several children, apparently from poor milk obtained from shipboard cows",
                    "refs": []
                },
                {
                    "sentence": "With less than a year of schooling and following a series of failures, both of his own and of others, Borden was inspired by the vacuum pan he had seen being used by Shakers to condense fruit juice and managed to reduce milk without scorching or curdling it",
                    "refs": []
                },
                {
                    "sentence": "Even then his first two factories failed  and only the third, built with new partner Jeremiah Milbank  in Wassaic, New York, produced a usable milk derivative that was long-lasting and needed no refrigeration.",
                    "refs": [
                        "ISBN: 978-1-56158-218-1",
                        "https://books.google.com/books?id=SJGNAgAAQBAJ&pg=PA102",
                        "[ERROR retrieving ref link]"
                    ]
                },
                {
                    "sentence": "Probably of equal importance for the future of milk production were Borden's requirements (the \"Dairyman's Ten Commandments\") for farmers who wanted to sell him raw milk: they were required to wash the cows' udders before milking, keep barns swept clean, and scald and dry their strainers morning and night",
                    "refs": []
                },
                {
                    "sentence": "By 1858, Borden's milk, sold as Eagle Brand, had gained a reputation for purity, durability and economy",
                    "refs": []
                },
                {
                    "sentence": "In 1864, Gail Borden's New York Condensed Milk Company constructed the New York Milk Condensery in Brewster, New York",
                    "refs": []
                },
                {
                    "sentence": "This was the largest and most advanced milk factory of its day and was Borden's first commercially successful plant",
                    "refs": [
                        "https://web.archive.org/web/20080627164515/http://southeastmuseum.org/SE_Tour99/SE_Tour/html/borden_s_milk.htm"
                    ]
                },
                {
                    "sentence": "More than 200 dairy farmers supplied 20,000 US gallons (17,000 imperial gallons; 76,000 litres) of milk daily to the Brewster plant as demand increased driven by the American Civil War.",
                    "refs": []
                },
                {
                    "sentence": "The U.S",
                    "refs": []
                },
                {
                    "sentence": "government ordered huge amounts of condensed milk as a field ration for Union soldiers during the war",
                    "refs": []
                },
                {
                    "sentence": "This was an extraordinary field ration for the nineteenth century: a typical 10-oz (300-ml) can contained 1,300 calories (5440 kJ), 1 oz (28 g) each of protein and fat, and more than 7 oz (200 g) of carbohydrate.",
                    "refs": []
                },
                {
                    "sentence": "Soldiers returning home from the war soon spread the word, and by the late 1860s, condensed milk was a major product",
                    "refs": []
                },
                {
                    "sentence": "In 1866, American brothers George Ham Page and Charles Page established the Anglo-Swiss Condensed Milk Company and opened the first condensed milk factory in Europe in the Swiss municipality of Cham",
                    "refs": []
                },
                {
                    "sentence": "The first Canadian condensery was built at Truro, Nova Scotia, in 1871",
                    "refs": [
                        "https://inside.hochdorf.com/en/condensed-milk-a-snapshot-of-swiss-industrial-history#:~:text=Condensed%20milk%20is%20strongly%20linked,introduced%20canned%20milk%20to%20Europe."
                    ]
                },
                {
                    "sentence": "In 1899, E",
                    "refs": [
                        "http://faculty.marianopolis.edu/c.belanger/QuebecHistory/encyclopedia/DairyinginCanada-Canadiandairying.htm"
                    ]
                },
                {
                    "sentence": "B",
                    "refs": []
                },
                {
                    "sentence": "Stuart opened the first Pacific Coast Condensed Milk Company (later known as the Carnation Milk Products Company) plant in Kent, Washington",
                    "refs": []
                },
                {
                    "sentence": "The condensed milk market developed into a bubble, with too many manufacturers chasing too little demand",
                    "refs": []
                },
                {
                    "sentence": "In the early 1900s, Carnation and Eagle brands were introduced in Hong Kong, establishing significant market shares in the years to follow",
                    "refs": [
                        "https://www.newspapers.com/image/313844045"
                    ]
                },
                {
                    "sentence": "In 1911, Nestlé constructed the world's largest condensed milk plant in Dennington, Victoria, Australia",
                    "refs": [
                        "https://industrialhistoryhk.org/live-long-and-prosper-longevity-condensed-milk-%E5%A3%BD%E6%98%9F%E5%85%AC%E7%85%89%E5%A5%B6-black-and-white-evaporated-milk-%E9%BB%91%E7%99%BD%E6%B7%A1%E5%A5%B6-and-friesland-ice-cream/"
                    ]
                },
                {
                    "sentence": "By 1912, high stocks of condensed milk led to a drop in price and many condenseries went out of business.",
                    "refs": [
                        "https://web.archive.org/web/20070905025124/http://www.nestle.com.au/NR/rdonlyres/35AC5E96-10CC-48AB-8AA5-E5B417820854/59745/Historical_Timeline.pdf"
                    ]
                },
                {
                    "sentence": "In 1914, Otto F",
                    "refs": []
                },
                {
                    "sentence": "Hunziker, head of Purdue University's dairy department, self-published Condensed Milk and Milk Powder: Prepared for the Use of Milk Condenseries, Dairy Students and Pure Food Departments",
                    "refs": []
                },
                {
                    "sentence": "This text, along with the additional work of Hunziker and others involved with the American Dairy Science Association, standardized and improved condensery operations in the United States and internationally",
                    "refs": []
                },
                {
                    "sentence": "Hunziker's book was republished in a seventh edition in October 2007 by Cartwright Press",
                    "refs": []
                },
                {
                    "sentence": "The First World War regenerated interest in, and the market for, condensed milk, primarily due to its storage and transportation benefits",
                    "refs": []
                },
                {
                    "sentence": "In the U.S",
                    "refs": []
                },
                {
                    "sentence": "the higher price for raw milk paid by condenseries created significant problems for the cheese industry",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "Production",
            "section_content": [
                {
                    "sentence": "Raw milk is clarified  and standardised to a desired fat to solid-not-fat (SNF) ratio,  and is then heated to 85–90 °C (185–194 °F) for several seconds",
                    "refs": [
                        "https://www.uoguelph.ca/foodscience/book-page/clarification",
                        "https://doi.org/10.1002%2F9781118810279.ch13"
                    ]
                },
                {
                    "sentence": "This heating process destroys some microorganisms, decreases fat separation and inhibits oxidation",
                    "refs": []
                },
                {
                    "sentence": "Water is evaporated from the milk and sugar is added until a 9:11 ratio of sugar to (evaporated) milk is reached",
                    "refs": []
                },
                {
                    "sentence": "The sugar extends the shelf life of sweetened condensed milk",
                    "refs": []
                },
                {
                    "sentence": "Sucrose increases the liquid's osmotic pressure, which prevents microorganism growth",
                    "refs": []
                },
                {
                    "sentence": "The sweetened evaporated milk is cooled and lactose crystallization is induced",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "Current use",
            "section_content": [
                {
                    "sentence": "Condensed milk is used in recipes for the Brazilian candy brigadeiro (where condensed milk is the main ingredient), key lime pie, caramel candies, and other desserts",
                    "refs": []
                },
                {
                    "sentence": "Condensed milk and sweetened condensed milk are also sometimes used in combination with clotted cream to make fudge in certain countries such as the United Kingdom.",
                    "refs": []
                },
                {
                    "sentence": "In parts of Asia and Europe, sweetened condensed milk is the preferred milk to be added to coffee or tea",
                    "refs": []
                },
                {
                    "sentence": "Many countries in Southeast Asia, such as Vietnam and Cambodia, use condensed milk to flavor their hot or iced coffee",
                    "refs": []
                },
                {
                    "sentence": "In Malaysia and Singapore, teh tarik is made from tea mixed with condensed milk, and condensed milk is an integral element in Hong Kong tea culture",
                    "refs": []
                },
                {
                    "sentence": "In the Canary Islands, it is served as the bottom stripe in a glass of the local café cortado and, in Valencia, it is served as a café bombón",
                    "refs": []
                },
                {
                    "sentence": "In Myanmar, condensed milk is an essential part of a vast majority of beverages such as coffee, milk tea and fruit juices along with the use of it as a sweetener in many desserts such as popsicles.",
                    "refs": []
                },
                {
                    "sentence": "Borden's Eagle Brand sweetened condensed milk has noted that ice cream could be made quite simply at home with their product, cream, and various simple flavorings, being ready to serve after as little as four hours",
                    "refs": []
                },
                {
                    "sentence": "In New Orleans, sweetened condensed milk is commonly used as a topping on chocolate or similarly cream-flavored snowballs",
                    "refs": []
                },
                {
                    "sentence": "In Scotland, it is mixed with sugar and butter and then boiled to form a popular sweet candy called tablet or Swiss milk tablet, this recipe is very similar to another version of the Brazilian candy brigadeiro called branquinho",
                    "refs": []
                },
                {
                    "sentence": "In some parts of the Southern United States, condensed milk is a key ingredient in lemon ice box pie, a sort of cream pie",
                    "refs": []
                },
                {
                    "sentence": "In the Philippines, condensed milk is mixed with some evaporated milk and eggs, spooned into shallow metal containers over liquid caramelized sugar, and then steamed to make a stiffer and more filling version of crème caramel known as leche flan, also common in Brazil under the name pudim de leite.",
                    "refs": []
                },
                {
                    "sentence": "In Mexico, sweetened condensed milk is one of the main ingredients of the cold cake dessert (the leading brand is \"La Lechera\", the local version of Swiss Milchmädchen or La Laitière by Nestlé), combined with evaporated milk, Marie biscuits, lemon juice, and tropical fruit",
                    "refs": []
                },
                {
                    "sentence": "In Brazil, this recipe is also done by exchanging fruit for puddings, most commonly vanilla and chocolate, known as pavê or torta de bolacha",
                    "refs": []
                },
                {
                    "sentence": "It is also used to make homemade dulce de leche by baking it in an oven",
                    "refs": []
                },
                {
                    "sentence": "In Brazil, this is done by baking the unopened can in a bain-marie, the result being doce de leite",
                    "refs": []
                },
                {
                    "sentence": "In Britain and Ireland, the contents of a boiled can are used as the layer between the biscuit base and the banana and cream level in banoffee",
                    "refs": []
                },
                {
                    "sentence": "There is also a pastry-based tart that is popular in the county of Kent, England called Gypsy tart",
                    "refs": []
                },
                {
                    "sentence": "The pastry case is then filled with a mixture of brown sugar and either condensed milk, evaporated milk, or a mixture of the two before being baked",
                    "refs": []
                },
                {
                    "sentence": "In Latin American and Central American countries, condensed milk (along with evaporated milk and whole milk or canned cream) is used as a key ingredient in the tres leches cake dessert.",
                    "refs": []
                },
                {
                    "sentence": "In Soviet culture, it was once common to boil a can of condensed milk in water for about three hours",
                    "refs": []
                },
                {
                    "sentence": "The resulting product is a sweet semi-liquid substance that can be used as a cake icing or put between layers",
                    "refs": []
                },
                {
                    "sentence": "It is essentially the same as dulce de leche",
                    "refs": []
                },
                {
                    "sentence": "A similar product is called kajmak in Central Asia (although the original kaymak is a product similar to clotted cream)",
                    "refs": []
                },
                {
                    "sentence": "In Russia  its called varionaya sguschyonka (translates as \"boiled condensed milk\")",
                    "refs": [
                        "https://www.rbth.com/russian-kitchen/327600-why-russians-boil-sweetened-condensed-milk/amp",
                        "https://educalanguageschool.com/soviet-yummies"
                    ]
                },
                {
                    "sentence": "The Soviet tradition and kaymak are also known in Poland.",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "Substitutions",
            "section_content": [
                {
                    "sentence": "Condensed milk can be made from evaporated milk by mixing one volume measure of evaporated milk with one and a quarter volume measure of sugar in a saucepan, then heating and stirring the mixture until the sugar is completely dissolved, then cooling",
                    "refs": []
                },
                {
                    "sentence": "It can also be made by simmering regular milk and sugar, until it is reduced by 60%",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "See also",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "References",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "External links",
            "section_content": [],
            "subsections": []
        }
    ],
    "references": {
        "1": "https://www.silverson.com/us/resource-library/application-reports/manufacture-of-sweetened-condensed-milk/",
        "2": "https://books.google.com/books?id=Si9Dgsb5BHAC&pg=PA197+",
        "3": "[ERROR retrieving ref link]",
        "4": "https://wellcomecollection.org/works/a85t2djs/items?canvas=3",
        "5": "ISBN: 978-1-56158-218-1",
        "6": "https://books.google.com/books?id=SJGNAgAAQBAJ&pg=PA102",
        "7": "[ERROR retrieving ref link]",
        "8": "https://www.newspapers.com/image/313844045",
        "9": "http://findarticles.com/p/articles/mi_m3301/is_3_109/ai_n25380001/pg_7",
        "10": "https://web.archive.org/web/20080627164515/http://southeastmuseum.org/SE_Tour99/SE_Tour/html/borden_s_milk.htm",
        "11": "https://inside.hochdorf.com/en/condensed-milk-a-snapshot-of-swiss-industrial-history#:~:text=Condensed%20milk%20is%20strongly%20linked,introduced%20canned%20milk%20to%20Europe.",
        "12": "http://faculty.marianopolis.edu/c.belanger/QuebecHistory/encyclopedia/DairyinginCanada-Canadiandairying.htm",
        "13": "https://www.newspapers.com/image/313844045",
        "14": "https://industrialhistoryhk.org/live-long-and-prosper-longevity-condensed-milk-%E5%A3%BD%E6%98%9F%E5%85%AC%E7%85%89%E5%A5%B6-black-and-white-evaporated-milk-%E9%BB%91%E7%99%BD%E6%B7%A1%E5%A5%B6-and-friesland-ice-cream/",
        "15": "https://web.archive.org/web/20070905025124/http://www.nestle.com.au/NR/rdonlyres/35AC5E96-10CC-48AB-8AA5-E5B417820854/59745/Historical_Timeline.pdf",
        "16": "https://archive.org/details/condensedmilkan00hunzgoog",
        "17": "http://digicoll.library.wisc.edu/cgi-bin/WI/WI-idx?type=article&did=WI.WCA1916.PAULYCCF&isize=M",
        "18": "https://www.uoguelph.ca/foodscience/book-page/clarification",
        "19": "https://doi.org/10.1002%2F9781118810279.ch13",
        "20": "https://web.archive.org/web/20080611090413/http://www.foodsci.uoguelph.ca/dairyedu/concprod.html",
        "21": "https://www.nola.com/food/2010/08/post_46.html",
        "22": "https://www.rbth.com/russian-kitchen/327600-why-russians-boil-sweetened-condensed-milk/amp",
        "23": "https://educalanguageschool.com/soviet-yummies",
        "24": "http://www.ochef.com/125.htm"
    },
    "flair_entities": [
        "gail borden",
        "canadian",
        "united kingdom.",
        "vietnam",
        "first world war",
        "tatar",
        "nicolas appert",
        "russia",
        "cambodia",
        "europe",
        "hunziker",
        "borden",
        "eagle brand",
        "otto f",
        "wassaic",
        "brazilian",
        "asia",
        "shakers",
        "f",
        "ireland",
        "swiss",
        "george ham page",
        "kent",
        "scotland",
        "william newton",
        "carnation milk products company",
        "france",
        "pure food departments",
        "american dairy science association",
        "malaysia",
        "us",
        "brewster",
        "american civil war.",
        "tatars",
        "new orleans",
        "dennington",
        "mexico",
        "poland.",
        "new york milk condensery",
        "marco polo",
        "nova scotia",
        "charles page",
        "southeast asia",
        "britain",
        "cham",
        "truro",
        "la laitière",
        "new york condensed milk company",
        "pacific coast condensed milk company",
        "borden's eagle brand",
        "valencia",
        "u.s.",
        "english",
        "stuart",
        "gail borden jr.",
        "anglo-swiss condensed milk company",
        "new york",
        "brazil",
        "hong kong",
        "victoria",
        "cartwright press",
        "myanmar",
        "american",
        "gypsy",
        "washington",
        "england",
        "dairyman's ten commandments",
        "eagle",
        "canary islands",
        "union",
        "nestlé",
        "australia",
        "singapore",
        "carnation",
        "central american",
        "condensed milk",
        "latin american",
        "southern united states",
        "purdue university",
        "philippines",
        "jeremiah milbank",
        "central asia",
        "la lechera",
        "soviet",
        "united states"
    ]
}