{
    "title": "Economic_globalization",
    "url": "https://en.wikipedia.org/wiki/Economic_globalization",
    "summary": "Economic globalization is one of the three main dimensions of globalization commonly found in academic literature, with the two others being political globalization and cultural globalization, as well as the general term of globalization.\nEconomic globalization refers to the widespread international movement of goods, capital, services, technology and information. It is the increasing economic integration and interdependence of national, regional, and local economies across the world through an intensification of cross-border movement of goods, services, technologies and capital. Economic globalization primarily comprises the globalization of production, finance, markets, technology, organizational regimes, institutions, corporations, and people.\nWhile economic globalization has been in expanding since the emergence of trans-national trade, it has grown at an increased rate due to improvements in the efficiency of long-distance transportation, advances in telecommunication, the importance of information rather than physical capital in the modern economy, and by developments in science and technology. The rate of globalization has also increased under the framework of the General Agreement on Tariffs and Trade and the World Trade Organization, in which countries gradually cut down trade barriers and opened up their current accounts and capital accounts. This recent boom has been largely supported by developed economies integrating with developing countries through foreign direct investment, lowering costs of doing business, the reduction of trade barriers, and in many cases cross-border migration.",
    "content": [
        {
            "section_title": "Evolution of globalization",
            "section_content": [],
            "subsections": [
                {
                    "section_title": "History",
                    "section_content": [
                        {
                            "sentence": "International commodity markets, labor markets, and capital markets make up the economy and define economic globalization",
                            "refs": []
                        },
                        {
                            "sentence": "Beginning as early as 6500 BCE, people in Syria were trading livestock, tools, and other items",
                            "refs": []
                        },
                        {
                            "sentence": "In Sumer, an early civilization in Mesopotamia, a token system was one of the first forms of commodity money",
                            "refs": []
                        },
                        {
                            "sentence": "Labor markets consist of workers, employers, wages, income, supply and demand",
                            "refs": []
                        },
                        {
                            "sentence": "Labor markets have been around as long as commodity markets",
                            "refs": []
                        },
                        {
                            "sentence": "The first labor markets provided workers to grow crops and tend livestock for later sale in local markets",
                            "refs": []
                        },
                        {
                            "sentence": "Capital markets emerged in industries that require resources beyond those of an individual farmer",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Technology",
                    "section_content": [
                        {
                            "sentence": "World War I disrupted economic globalization, with countries adopting protectionist policies and trade barriers, slowing global trade",
                            "refs": []
                        },
                        {
                            "sentence": "The 1956 invention of containerized shipping and larger ship sizes reduced costs, facilitating global trade",
                            "refs": [
                                "https://www.imf.org/en/Publications/fandd/issues/2023/03/in-defense-of-globalization-harold-james"
                            ]
                        },
                        {
                            "sentence": "Globalization resumed in the 1970s as governments highlighted trade benefits",
                            "refs": []
                        },
                        {
                            "sentence": "Subsequent technology advancements have accelerated global trade expansion",
                            "refs": []
                        },
                        {
                            "sentence": "The follow-on advances in technology since then have played a pivotal role in the rapid expansion of global trade",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Policy and government",
                    "section_content": [
                        {
                            "sentence": "The GATT/WTO framework, which was initiated in 1947,  led participating countries to reduce their tariff and non-tariff barriers to trade",
                            "refs": [
                                "https://verdragenbank.overheid.nl/en/Treaty/Details/006960.html"
                            ]
                        },
                        {
                            "sentence": "Indeed, the idea of Most Favoured Nation was essential to the GATT",
                            "refs": []
                        },
                        {
                            "sentence": "In order to accede, governments had to shift their economies from central planning to market driven, especially after the fall of the Soviet Union",
                            "refs": [
                                "https://www.usitc.gov/publications/332/ec0206b.pdf",
                                "https://unctad.org/system/files/official-document/diaeia20101_en.pdf"
                            ]
                        },
                        {
                            "sentence": "On 27 October 1986, the London Stock Exchange enacted newly deregulated rules that enabled global interconnection of markets, with an expectation of huge increases in market activity",
                            "refs": []
                        },
                        {
                            "sentence": "This event came to be known as the Big Bang.",
                            "refs": []
                        },
                        {
                            "sentence": "By the time the World Trade Organization was established in 1994 as the baton was passed from the GATT,  it had grown to 128 countries, including Czech Republic, Slovakia and Slovenia",
                            "refs": [
                                "https://verdragenbank.overheid.nl/en/Treaty/Details/006960.html"
                            ]
                        },
                        {
                            "sentence": "The year 1995 saw the WTO pass the General Agreement on Trade in Services, while the 1998 defeat of the OECD's Multilateral Agreement on Investment was a hiccup on the route to economic globalization.",
                            "refs": []
                        },
                        {
                            "sentence": "Multinational corporations reorganized production to take advantage of these opportunities",
                            "refs": []
                        },
                        {
                            "sentence": "Labor-intensive production migrated to areas with lower labor costs,  especially China,  later followed by other functions as skill levels increased",
                            "refs": [
                                "https://doi.org/10.24148%2Fwp2013-27",
                                "https://doi.org/10.1257%2Faer.103.6.2121"
                            ]
                        },
                        {
                            "sentence": "Networks raised the level of wealth consumption and geographical mobility",
                            "refs": []
                        },
                        {
                            "sentence": "This highly dynamic worldwide system had powerful ramifications",
                            "refs": []
                        },
                        {
                            "sentence": "The World Trade Organization Ministerial Conference of 1999 and associated 1999 Seattle WTO protests were a significant step on the road to economic globalization",
                            "refs": [
                                "[ERROR retrieving ref link]"
                            ]
                        },
                        {
                            "sentence": "The People's Republic of China (2001) and the last remnants of ex-Soviet bloc countries like Ukraine (2008) and Russia (2012) were admitted much later to the WTO process after painful structural reforms.",
                            "refs": []
                        },
                        {
                            "sentence": "The Multilateral Convention to Implement Tax Treaty Related Measures to Prevent Base Erosion and Profit Shifting, which entered into force on 1 July 2018, is an effort to harmonize tax regimes in order to prevent multi-national firms from taking advantage of loopholes like Ireland's Green Jersey BEPS tool.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Global agents",
            "section_content": [],
            "subsections": [
                {
                    "section_title": "International governmental organizations",
                    "section_content": [
                        {
                            "sentence": "An intergovernmental organization or international governmental organization (IGO) is an entity created by treaty, involving two or more nations, to work in good faith, on issues of common interest",
                            "refs": []
                        },
                        {
                            "sentence": "IGO's strive for peace, security and deal with economic and social questions",
                            "refs": []
                        },
                        {
                            "sentence": "Examples include: The United Nations, The World Bank and on a regional level The North Atlantic Treaty Organization among others.",
                            "refs": [
                                "https://hls.harvard.edu/dept/opia/what-is-public-interest-law/public-service-practice-settings/public-international-law/intergovernmental-organizations-igos/"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "International non-governmental organizations (NGOs)",
                    "section_content": [
                        {
                            "sentence": "International non-governmental organizations include charities, non-profit advocacy groups, business associations, and cultural associations",
                            "refs": []
                        },
                        {
                            "sentence": "International charitable activities increased after World War II and on the whole NGOs provide more economic aid to developing countries than developed country governments.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Businesses",
                    "section_content": [
                        {
                            "sentence": "Since the 1970s, multinational businesses have increasingly relied on outsourcing and subcontracting across vast geographical spaces, due to the global nature of supply chains and the production of intermediate products",
                            "refs": []
                        },
                        {
                            "sentence": "Firms also engage in inter-firm alliances and rely on foreign research and development",
                            "refs": []
                        },
                        {
                            "sentence": "This is in contrast to past periods where firms kept production internalized or within a localized geography",
                            "refs": []
                        },
                        {
                            "sentence": "Innovations in communications and transportation technology, as well as greater economic openness and less government intervention have made a shift away from internalization more feasible",
                            "refs": []
                        },
                        {
                            "sentence": "Additionally, businesses going global learn the tools to effectively interact with cultural agility; with people of many diverse cultural backgrounds, expanding their market",
                            "refs": [
                                "https://www.jstor.org/stable/j.ctt7sjz7"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Immigrants",
                    "section_content": [
                        {
                            "sentence": "International immigrants transfer significant amounts of money through remittances to lower-income relatives",
                            "refs": []
                        },
                        {
                            "sentence": "Communities of immigrants in the destination country often provide new arrivals with information and ideas about how to earn money",
                            "refs": []
                        },
                        {
                            "sentence": "In some cases, this has resulted in disproportionately high representation of some ethnic groups in certain industries, especially if economy success encourages more people to move from the source country",
                            "refs": []
                        },
                        {
                            "sentence": "Movement of people also spreads technology and aspects of business culture, and moves accumulated financial assets.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Impact",
            "section_content": [],
            "subsections": [
                {
                    "section_title": "Economic growth and poverty reduction",
                    "section_content": [
                        {
                            "sentence": "Economic growth accelerated and poverty declined globally following the acceleration of globalization",
                            "refs": []
                        },
                        {
                            "sentence": "According to the International Monetary Fund, growth benefits of economic globalization are widely shared",
                            "refs": []
                        },
                        {
                            "sentence": "While several globalizers have seen an increase in inequality, most notably China, this increase in inequality is a result of domestic liberalization, restrictions on internal migration, and agricultural policies, rather than a result of international trade",
                            "refs": []
                        },
                        {
                            "sentence": "Poverty has been reduced as evidenced by a 5.4 percent annual growth in income for the poorest fifth of the population of Malaysia",
                            "refs": []
                        },
                        {
                            "sentence": "Even in China, where inequality continues to be a problem, the poorest fifth of the population saw a 3.8 percent annual growth in income",
                            "refs": []
                        },
                        {
                            "sentence": "In several countries, those living below the dollar-per-day poverty threshold declined",
                            "refs": []
                        },
                        {
                            "sentence": "In China, the rate declined from 20 to 15 percent and in Bangladesh the rate dropped from 43 to 36 percent",
                            "refs": []
                        },
                        {
                            "sentence": "[citation needed] [when?]",
                            "refs": []
                        },
                        {
                            "sentence": "Globalizers are narrowing the per capita income gap between the rich and the globalizing nations",
                            "refs": []
                        },
                        {
                            "sentence": "China, India, and Bangladesh, some of the newly industrialised nations in the world, have greatly narrowed inequality due to their economic expansion",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Global supply chain",
                    "section_content": [
                        {
                            "sentence": "The global supply chain consists of complex interconnected networks that allow companies to produce handle and distribute various goods and services to the public worldwide.",
                            "refs": []
                        },
                        {
                            "sentence": "Corporations manage their supply chain to take advantage of cheaper costs of production",
                            "refs": []
                        },
                        {
                            "sentence": "A supply chain is a system of organizations, people, activities, information, and resources involved in moving a product or service from supplier to customer",
                            "refs": []
                        },
                        {
                            "sentence": "Supply chain activities involve the transformation of natural resources, raw materials, and components into a finished product that is delivered to the end customer",
                            "refs": []
                        },
                        {
                            "sentence": "Supply chains link value chains",
                            "refs": [
                                "https://www.researchgate.net/publication/276212454"
                            ]
                        },
                        {
                            "sentence": "Supply and demand can be very fickle, depending on factors such as the weather, consumer demand, and large orders placed by multinational corporations",
                            "refs": [
                                "https://search.worldcat.org/oclc/317598837"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Labor conditions and environment",
                    "section_content": [],
                    "subsections": [
                        {
                            "section_title": "\"Race to the bottom\"",
                            "section_content": [
                                {
                                    "sentence": "Globalization is sometimes perceived as a cause of a phenomenon called the \"race to the bottom\" that implies that to minimize cost and increase delivery speed, businesses tend to locate operations in countries with the least stringent environmental and labor regulations",
                                    "refs": []
                                },
                                {
                                    "sentence": "Pressure to do this is increased if competitors lower costs by the same means",
                                    "refs": []
                                },
                                {
                                    "sentence": "This both directly results poor working conditions, low wages, job insecurity, and pollution, but also encourages governments to under-regulate in order to attract jobs and economic investment",
                                    "refs": []
                                },
                                {
                                    "sentence": "However, if business demand is sufficiently high, the labor pool in low-wage countries becomes exhausted (as has happened in China),  resulting in higher wages due to competition, and more demand from the public for government protection against exploitation and pollution",
                                    "refs": [
                                        "[ERROR retrieving ref link]",
                                        "http://smallbusiness.chron.com/effects-economic-globalization-developing-countries-3906.html"
                                    ]
                                },
                                {
                                    "sentence": "From 2003 to 2013, wages in China and India have gone up by around 10–20% a year",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Health risks",
                            "section_content": [
                                {
                                    "sentence": "In developing countries with loose labor regulations, there are adverse health consequences from working long hours, and individuals burden themselves from working within vast global supply chains",
                                    "refs": []
                                },
                                {
                                    "sentence": "Women in agriculture, for example, are often asked to work long hours handling chemicals such as pesticides and fertilizers without any protection",
                                    "refs": [
                                        "[ERROR retrieving ref link]"
                                    ]
                                },
                                {
                                    "sentence": "Although both men and women experience shortcomings with health, the final reports stated that women, with the double burden of domestic and paid work experience an increased the risk of psychological distress and suboptimal health",
                                    "refs": []
                                },
                                {
                                    "sentence": "Strazdins concluded that negative work-family spillover especially is associated with health problems among both women and men, and negative family-work spillover is related to a poorer health status among women.\"",
                                    "refs": [
                                        "https://doi.org/10.1111%2F1467-9566.12300"
                                    ]
                                },
                                {
                                    "sentence": "It is common for the work lifestyle to bring forth adverse health conditions or even death due to weak safety measure policies",
                                    "refs": []
                                },
                                {
                                    "sentence": "After the tragic collapse of the Rana Plaza factory in Bangladesh where over 800 deaths occurred the country has since then made efforts in boosting up their safety policies to better accommodate workers",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Mistreatment",
                            "section_content": [
                                {
                                    "sentence": "In developing countries with loose labor regulations and a large supply of low-skill, low-cost workers, there are risks for mistreatment of some workers, especially women and children",
                                    "refs": []
                                },
                                {
                                    "sentence": "Poor working conditions and sexual harassment are just some of the mistreatment faced by women in the textile supply chain",
                                    "refs": [
                                        "[ERROR retrieving ref link]"
                                    ]
                                },
                                {
                                    "sentence": "Marina Prieto-Carrón shows in her research in Central America that women in sweatshops are not even supplied with toilet paper in the bathroom every day",
                                    "refs": []
                                },
                                {
                                    "sentence": "The reason it costs corporations more is because people can not work to their full potential in poor conditions, affecting the global marketplace",
                                    "refs": []
                                },
                                {
                                    "sentence": "Furthermore, when corporations decide to change manufacturing rates or locations in industries that employ more women, they are often left with no job nor assistance",
                                    "refs": [
                                        "[ERROR retrieving ref link]"
                                    ]
                                },
                                {
                                    "sentence": "This kind of sudden reduction or elimination in hours is seen in industries such as the textile industry and agriculture industry, both of which employ a higher number of women than men",
                                    "refs": []
                                },
                                {
                                    "sentence": "One solution to mistreatment of women in the supply chain is more involvement from the corporation and trying to regulate the outsourcing of their product",
                                    "refs": [
                                        "[ERROR retrieving ref link]"
                                    ]
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Global labor and fair trade movements",
                            "section_content": [
                                {
                                    "sentence": "Several movements, such as the fair trade movement and the anti-sweatshop movement, claim to promote a more socially just global economy",
                                    "refs": []
                                },
                                {
                                    "sentence": "The fair trade movement works towards improving trade, development and production for disadvantaged producers",
                                    "refs": []
                                },
                                {
                                    "sentence": "The fair trade movement has reached 1.6 billion US dollars in annual sales",
                                    "refs": []
                                },
                                {
                                    "sentence": "The movement works to raise consumer awareness of exploitation of developing countries",
                                    "refs": [
                                        "[ERROR retrieving ref link]"
                                    ]
                                },
                                {
                                    "sentence": "Fair trade works under the motto of \"trade, not aid\", to improve the quality of life for farmers and merchants by participating in direct sales, providing better prices and supporting the community",
                                    "refs": []
                                },
                                {
                                    "sentence": "Meanwhile, the anti-sweatshop movement is to protest the unfair treatment caused by some companies.",
                                    "refs": [
                                        "[ERROR retrieving ref link]"
                                    ]
                                },
                                {
                                    "sentence": "Various transnational organizations advocate for improved labor standards in developing countries",
                                    "refs": []
                                },
                                {
                                    "sentence": "This including labor unions, who are put at a negotiating disadvantage when an employer can relocate or outsource operations to a different country",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "section_title": "Capital flight",
                    "section_content": [
                        {
                            "sentence": "Capital flight occurs when assets or money rapidly flow out of a country because of that country's recent increase in unfavorable financial conditions such as taxes, tariffs, labor costs, government debt or capital controls",
                            "refs": []
                        },
                        {
                            "sentence": "This is usually accompanied by a sharp drop in the exchange rate of the affected country or a forced devaluation for countries living under fixed exchange rates",
                            "refs": []
                        },
                        {
                            "sentence": "Currency declines improve the terms of trade, but reduce the monetary value of financial and other assets in the country",
                            "refs": []
                        },
                        {
                            "sentence": "This leads to decreases in the purchasing power of the country's assets.",
                            "refs": []
                        },
                        {
                            "sentence": "A 2008 paper published by Global Financial Integrity estimated capital flight to be leaving developing countries at the rate of \"$850 billion to $1 trillion a year.\"  But capital flight also affects developed countries",
                            "refs": [
                                "https://web.archive.org/web/20161019175719/http://www.gfintegrity.org/storage/gfip/executive%20-%20final%20version%201-5-09.pdf"
                            ]
                        },
                        {
                            "sentence": "A 2009 article in The Times reported that hundreds of wealthy financiers and entrepreneurs had recently fled the United Kingdom in response to recent tax increases, relocating to low tax destinations such as Jersey, Guernsey, the Isle of Man and the British Virgin Islands",
                            "refs": []
                        },
                        {
                            "sentence": "In May 2012 the scale of Greek capital flight in the wake of the first \"undecided\" legislative election was estimated at €4 billion a week",
                            "refs": [
                                "https://web.archive.org/web/20101029230344/http://www.timesonline.co.uk/tol/news/politics/article6954613.ece"
                            ]
                        },
                        {
                            "sentence": "Capital flight can cause liquidity crises in directly affected countries and can cause related difficulties in other countries involved in international commerce such as shipping and finance",
                            "refs": []
                        },
                        {
                            "sentence": "Asset holders may be forced into distress sales",
                            "refs": []
                        },
                        {
                            "sentence": "Borrowers typically face higher loan costs and collateral requirements, compared to periods of ample liquidity, and unsecured debt is nearly impossible to obtain",
                            "refs": []
                        },
                        {
                            "sentence": "Typically, during a liquidity crisis, the interbank lending market stalls.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Inequality",
                    "section_content": [
                        {
                            "sentence": "While within-country income inequality has increased throughout the globalization period, globally inequality has lessened as developing countries have experienced much more rapid growth",
                            "refs": []
                        },
                        {
                            "sentence": "Economic inequality varies between societies, historical periods, economic structures or economic systems, ongoing or past wars, between genders, and between differences in individuals' abilities to create wealth",
                            "refs": [
                                "https://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.691.2382"
                            ]
                        },
                        {
                            "sentence": "Among the various numerical indices for measuring economic inequality, the Gini coefficient is most often-cited.",
                            "refs": [
                                "https://doi.org/10.1162%2Fqjec.2010.125.1.91"
                            ]
                        },
                        {
                            "sentence": "Economic inequality includes equity, equality of outcome and subsequent equality of opportunity",
                            "refs": []
                        },
                        {
                            "sentence": "Although earlier studies considered economic inequality as necessary and beneficial,  some economists see it as an important social problem",
                            "refs": [
                                "http://www.stlouisfed.org/publications/itv/articles/?id=1920"
                            ]
                        },
                        {
                            "sentence": "Early studies suggesting that greater equality inhibits economic growth did not account for lags between inequality changes and growth changes",
                            "refs": [
                                "ISBN: 978-1-84614-039-6"
                            ]
                        },
                        {
                            "sentence": "Later studies claimed that one of the most robust determinants of sustained economic growth is the level of income inequality",
                            "refs": [
                                "https://web.archive.org/web/20210224123452/http://economics.mit.edu/files/753"
                            ]
                        },
                        {
                            "sentence": "International inequality is inequality between countries",
                            "refs": []
                        },
                        {
                            "sentence": "Income differences between rich and poor countries are very large, although they are changing rapidly",
                            "refs": []
                        },
                        {
                            "sentence": "Per capita incomes in China and India doubled in the prior twenty years, a feat that required 150 years in the US",
                            "refs": []
                        },
                        {
                            "sentence": "According to the United Nations Human Development Report for 2013, for countries at varying levels of the UN Human Development Index the GNP per capita grew between 2004 and 2013 from 24,806 to 33,391 or 35% (very high human development), 4,269 to 5,428 or 27% (medium) and 1,184 to 1,633 or 38% (low) PPP$, respectively (PPP$ = purchasing power parity measured in United States dollars)",
                            "refs": [
                                "[ERROR retrieving ref link]"
                            ]
                        },
                        {
                            "sentence": "Certain demographic changes in the developing world after active economic liberalization and international integration resulted in rising welfare and hence, reduced inequality",
                            "refs": []
                        },
                        {
                            "sentence": "According to Martin Wolf, in the developing world as a whole, life expectancy rose by four months each year after 1970 and infant mortality rate declined from 107 per thousand in 1970 to 58 in 2000 due to improvements in standards of living and health conditions",
                            "refs": []
                        },
                        {
                            "sentence": "Also, adult literacy in developing countries rose from 53% in 1970 to 74% in 1998 and much lower illiteracy rate among the young guarantees that rates will continue to fall as time passes",
                            "refs": []
                        },
                        {
                            "sentence": "Furthermore, the reduction in fertility rates in the developing world as a whole from 4.1 births per woman in 1980 to 2.8 in 2000 indicates improved education level of women on fertility, and control of fewer children with more parental attention and investment",
                            "refs": []
                        },
                        {
                            "sentence": "Consequentially, more prosperous and educated parents with fewer children have chosen to withdraw their children from the labor force to give them opportunities to be educated at school improving the issue of child labor",
                            "refs": [
                                "https://web.archive.org/web/20130510120230/http://yalepress.yale.edu/yupbooks/book.asp?isbn=9780300107777"
                            ]
                        },
                        {
                            "sentence": "Thus, despite seemingly unequal distribution of income within these developing countries, their economic growth and development have brought about improved standards of living and welfare for the population as a whole.",
                            "refs": []
                        },
                        {
                            "sentence": "Economic development spurred by international investment or trade can increase local income inequality as workers with more education and skills can find higher-paying work",
                            "refs": []
                        },
                        {
                            "sentence": "This can be mitigated with government funding of education",
                            "refs": []
                        },
                        {
                            "sentence": "Another way globalization increases income inequality is by increasing the size of the market available for any particular good or service",
                            "refs": [
                                "http://smallbusiness.chron.com/effects-economic-globalization-developing-countries-3906.html"
                            ]
                        },
                        {
                            "sentence": "This allows the owners of companies that service global markets to reap disproportionately larger profits",
                            "refs": []
                        },
                        {
                            "sentence": "This may happen at the expense of local companies that would have otherwise been able to dominate the domestic market, which would have spread profits around to a larger number of owners",
                            "refs": []
                        },
                        {
                            "sentence": "On the other hand, globalized stock markets allow more people to invest internationally, and get a share of profits from companies they otherwise could not.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Resource insecurity",
                    "section_content": [
                        {
                            "sentence": "A systematic, and possibly first large-scale, cross-sectoral analysis of water, energy and land in security in 189 countries that links national and sector consumption to sources showed that countries and sectors are highly exposed to over-exploited, insecure, and degraded such resources",
                            "refs": []
                        },
                        {
                            "sentence": "The 2020 study finds that economic globalization has decreased security of global supply chains with most countries exhibiting greater exposure to resource risks via international trade – mainly from remote production sources – and that diversifying trading partners is unlikely to help nations and sectors to reduce these or to improve their resource self-sufficiency",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Competitive advantages",
                    "section_content": [
                        {
                            "sentence": "Businesses in developed countries tend to be more highly automated, have more sophisticated technology and techniques, and have better national infrastructure",
                            "refs": []
                        },
                        {
                            "sentence": "For these reasons and sometimes due to economies of scale, they can sometimes out-compete similar businesses in developing countries",
                            "refs": []
                        },
                        {
                            "sentence": "This is a substantial issue in international agriculture, where Western farms tend to be large and highly productive due to agricultural machinery, fertilizer, and pesticides; but developing-country farms tend to be smaller and rely heavily on manual labor",
                            "refs": []
                        },
                        {
                            "sentence": "Conversely, cheaper manual labor in developing countries allowed workers there to out-compete workers in higher-wage countries for jobs in labor-intensive industries",
                            "refs": []
                        },
                        {
                            "sentence": "As the theory of competitive advantage predicts, instead of each country producing all the goods and services it needs domestically, a country's economy tends to specialize in certain areas where it is more productive (though in the long term the differences may be equalized, resulting in a more balanced economy).",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Tax havens",
                    "section_content": [
                        {
                            "sentence": "A tax haven is a state, country or territory where certain taxes are levied at a low rate or not at all, which are used by businesses for tax avoidance and tax evasion",
                            "refs": []
                        },
                        {
                            "sentence": "Individuals and/or corporate entities can find it attractive to move themselves to areas with reduced taxation",
                            "refs": [
                                "https://ssrn.com/abstract=952721"
                            ]
                        },
                        {
                            "sentence": "This creates a situation of tax competition among governments",
                            "refs": []
                        },
                        {
                            "sentence": "Taxes vary substantially across jurisdictions",
                            "refs": []
                        },
                        {
                            "sentence": "Sovereign states have theoretically unlimited powers to enact tax laws affecting their territories, unless limited by previous international treaties",
                            "refs": [
                                "http://www.taxjustice.net/cms/upload/pdf/FSI2012_BanksBig4.pdf"
                            ]
                        },
                        {
                            "sentence": "The central feature of a tax haven is that its laws and other measures can be used to evade or avoid the tax laws or regulations of other jurisdictions",
                            "refs": []
                        },
                        {
                            "sentence": "In its December 2008 report on the use of tax havens by American corporations,  the U.S",
                            "refs": [
                                "http://www.taxjustice.net/cms/upload/pdf/Identifying_Tax_Havens_Jul_07.pdf",
                                "http://www.gao.gov/products/GAO-09-157"
                            ]
                        },
                        {
                            "sentence": "Government Accountability Office regarded the following characteristics as indicative of a tax haven: nil or nominal taxes; lack of effective exchange of tax information with foreign tax authorities; lack of transparency in the operation of legislative, legal or administrative provisions; no requirement for a substantive local presence; and self-promotion as an offshore financial center.",
                            "refs": []
                        },
                        {
                            "sentence": "A 2012 report from the Tax Justice Network estimated that between US$21 trillion and $32 trillion is sheltered from taxes in tax havens worldwide",
                            "refs": []
                        },
                        {
                            "sentence": "If such hidden offshore assets are considered, many countries with governments nominally in debt would be net creditor nations",
                            "refs": [
                                "http://www.taxjustice.net/cms/upload/pdf/The_Price_of_Offshore_Revisited_Presser_120722.pdf"
                            ]
                        },
                        {
                            "sentence": "However, the tax policy director of the Chartered Institute of Taxation expressed skepticism over the accuracy of the figures",
                            "refs": [
                                "https://www.cbc.ca/news/world/wealthy-hiding-21-trillion-in-tax-havens-report-says-1.1253550"
                            ]
                        },
                        {
                            "sentence": "Daniel J",
                            "refs": [
                                "https://www.bbc.co.uk/news/business-18944097"
                            ]
                        },
                        {
                            "sentence": "Mitchell of the US-based Cato Institute says that the report also assumes, when considering notional lost tax revenue, that 100% of the money deposited offshore is evading payment of tax",
                            "refs": []
                        },
                        {
                            "sentence": "The tax shelter benefits result in a tax incidence disadvantaging the poor",
                            "refs": []
                        },
                        {
                            "sentence": "Many tax havens are thought to have connections to \"fraud, money laundering and terrorism.\"  Accountants' opinions on the propriety of tax havens have been evolving,  as have the opinions of their corporate users,  governments,   and politicians,   although their use by Fortune 500 companies  and others remains widespread",
                            "refs": [
                                "http://uspirgedfund.org/sites/pirg/files/reports/Picking_Up_the_Tab_USP.pdf",
                                "https://www.nytimes.com/2012/05/06/opinion/sunday/these-islands-arent-just-a-shelter-from-taxes.html",
                                "http://www.accountancyage.com/debate/4/tax-avoidance-fair-or-foul",
                                "https://www.theguardian.com/technology/2013/jan/29/google-tax-chairman",
                                "http://www.newstatesman.com/blogs/voices/2012/06/tax-avoidance-isnt-left-or-right-issue-its-cancer-eating-our-democracy",
                                "http://www.ipsnews.net/2012/10/helsinki-boycotts-tax-havens/",
                                "https://www.telegraph.co.uk/news/politics/david-cameron/9779983/David-Cameron-Tax-avoiding-foreign-firms-like-Starbucks-and-Amazon-lack-moral-scruples.html",
                                "https://www.reuters.com/article/us-g20-tax-germany-merkel-idUSBRE91C1G020130213",
                                "http://ctj.org/ctjreports/2012/10/which_fortune_500_companies_are_sheltering_income_in_overseas_tax_havens.php"
                            ]
                        },
                        {
                            "sentence": "Reform proposals centering on the Big Four accountancy firms have been advanced",
                            "refs": []
                        },
                        {
                            "sentence": "Some governments appear to be using computer spyware to scrutinize corporations' finances",
                            "refs": [
                                "https://www.theguardian.com/commentisfree/2012/dec/10/end-tax-scams-by-hitting-big-four"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Cultural effects",
                    "section_content": [
                        {
                            "sentence": "Economic globalization may affect culture",
                            "refs": []
                        },
                        {
                            "sentence": "Populations may mimic the international flow of capital and labor markets in the form of immigration and the merger of cultures",
                            "refs": []
                        },
                        {
                            "sentence": "Foreign resources and economic measures may affect different native cultures and may cause assimilation of a native people",
                            "refs": []
                        },
                        {
                            "sentence": "As these populations are exposed to the English language, computers, western music, and North American culture, changes are being noted in shrinking family size, immigration to larger cities, more casual dating practices, and gender roles are transformed.",
                            "refs": [
                                "ISBN: 978-0-203-39219-5"
                            ]
                        },
                        {
                            "sentence": "Yu Xintian noted two contrary trends in culture due to economic globalization",
                            "refs": []
                        },
                        {
                            "sentence": "Yu argued that culture and industry not only flow from the developed world to the rest, but trigger an effort to protect local cultures",
                            "refs": [
                                "ISBN: 978-1-56518-176-2"
                            ]
                        },
                        {
                            "sentence": "He notes that economic globalization began after World War II, whereas internationalization began over a century ago",
                            "refs": []
                        },
                        {
                            "sentence": "George Ritzer wrote about the McDonaldization of society and how fast food businesses spread throughout the United States and the rest of the world, attracting other places to adopt fast food culture",
                            "refs": []
                        },
                        {
                            "sentence": "Ritzer describes other businesses such as The Body Shop, a British cosmetics company, that have copied McDonald's business model for expansion and influence",
                            "refs": [
                                "ISBN: 978-1-4129-7582-7"
                            ]
                        },
                        {
                            "sentence": "In 2006, 233 of 280 or over 80% of new McDonald's opened outside the US",
                            "refs": []
                        },
                        {
                            "sentence": "In 2007, Japan had 2,828 McDonald's locations",
                            "refs": []
                        },
                        {
                            "sentence": "Global media companies export information around the world",
                            "refs": []
                        },
                        {
                            "sentence": "This creates a mostly one-way flow of information, and exposure to mostly western products and values",
                            "refs": []
                        },
                        {
                            "sentence": "Companies like CNN, Reuters and the BBC dominate the global airwaves with western points of view",
                            "refs": []
                        },
                        {
                            "sentence": "Other media news companies such as Qatar's Al Jazeera network offer a different point of view, but reach and influence fewer people",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Migration",
                    "section_content": [
                        {
                            "sentence": "\"With an estimated 210 million people living outside their country of origin (International Labour Organization  [ILO] 2010), international migration has touched the lives of almost everyone in both the sending and receiving countries of the Global South and the Global North\"",
                            "refs": []
                        },
                        {
                            "sentence": "Because of advances made in technology, human beings as well as goods are able to move through different countries and regions with relative ease.",
                            "refs": [
                                "https://doi.org/10.1080%2F13545701.2012.688998"
                            ]
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "See also",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "Notes",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "References",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "External links",
            "section_content": [],
            "subsections": []
        }
    ],
    "references": {
        "1": "https://books.google.com/books?id=XKnmvRATtfAC&pg=PA146",
        "2": "https://books.google.com/books?id=AL9cPgAACAAJ",
        "3": "[ERROR retrieving ref link]",
        "4": "[ERROR retrieving ref link]",
        "5": "https://hls.harvard.edu/dept/opia/what-is-public-interest-law/public-service-practice-settings/public-international-law/intergovernmental-organizations-igos/",
        "6": "http://smallbusiness.chron.com/effects-economic-globalization-developing-countries-3906.html",
        "7": "https://www.imf.org/en/Publications/fandd/issues/2023/03/in-defense-of-globalization-harold-james",
        "8": "[ERROR retrieving ref link]",
        "9": "[ERROR retrieving ref link]",
        "10": "[ERROR retrieving ref link]",
        "11": "[ERROR retrieving ref link]",
        "12": "https://verdragenbank.overheid.nl/en/Treaty/Details/006960.html",
        "13": "https://www.usitc.gov/publications/332/ec0206b.pdf",
        "14": "https://unctad.org/system/files/official-document/diaeia20101_en.pdf",
        "15": "[ERROR retrieving ref link]",
        "16": "https://www.wsj.com/articles/SB117607482355263550",
        "17": "https://doi.org/10.24148%2Fwp2013-27",
        "18": "https://doi.org/10.1257%2Faer.103.6.2121",
        "19": "[ERROR retrieving ref link]",
        "20": "https://www.theatlantic.com/business/archive/2014/01/the-dark-side-of-globalization-why-seattles-1999-protesters-were-right/282831/",
        "21": "https://www.jstor.org/stable/j.ctt7sjz7",
        "22": "https://www.econbiz.de/Record/developing-culturally-agile-global-business-leaders-caligiuri-paula/10010166200",
        "23": "http://www.imf.org/external/pubs/ft/fandd/2001/09/dollar.htm",
        "24": "https://www.researchgate.net/publication/276212454",
        "25": "https://search.worldcat.org/oclc/317598837",
        "26": "[ERROR retrieving ref link]",
        "27": "https://www.economist.com/sites/default/files/20130119_offshoring_davos.pdf",
        "28": "[ERROR retrieving ref link]",
        "29": "https://doi.org/10.1111%2F1467-9566.12300",
        "30": "[ERROR retrieving ref link]",
        "31": "[ERROR retrieving ref link]",
        "32": "[ERROR retrieving ref link]",
        "33": "https://doi.org/10.1080%2F09638199.2011.578752",
        "34": "https://web.archive.org/web/20161019175719/http://www.gfintegrity.org/storage/gfip/executive%20-%20final%20version%201-5-09.pdf",
        "35": "https://web.archive.org/web/20101029230344/http://www.timesonline.co.uk/tol/news/politics/article6954613.ece",
        "36": "https://www.telegraph.co.uk/finance/financialcrisis/9270884/Debt-crisis-Greek-euro-exit-looms-closer-as-banks-crumble.html",
        "37": "https://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.691.2382",
        "38": "https://doi.org/10.1162%2Fqjec.2010.125.1.91",
        "39": "http://www.imf.org/external/pubs/ft/fandd/2011/09/berg.htm",
        "40": "http://www.stlouisfed.org/publications/itv/articles/?id=1920",
        "41": "ISBN: 978-1-84614-039-6",
        "42": "https://web.archive.org/web/20210224123452/http://economics.mit.edu/files/753",
        "43": "[ERROR retrieving ref link]",
        "44": "[ERROR retrieving ref link]",
        "45": "https://web.archive.org/web/20130510120230/http://yalepress.yale.edu/yupbooks/book.asp?isbn=9780300107777",
        "46": "https://cosmosmagazine.com/earth/sustainability/global-trade-linked-to-resource-insecurity/",
        "47": "https://www.europeanscientist.com/en/agriculture/is-globalisation-compatible-with-sustainable-and-resilient-supply-chains/",
        "48": "https://phys.org/news/2020-10-globalized-economy-energy-insecurity-worse.html",
        "49": "https://www.sciencedirect.com/science/article/abs/pii/S095937802030741X",
        "50": "https://ssrn.com/abstract=1934164",
        "51": "https://ssrn.com/abstract=952721",
        "52": "http://www.taxjustice.net/cms/upload/pdf/FSI2012_BanksBig4.pdf",
        "53": "http://www.taxjustice.net/cms/upload/pdf/Identifying_Tax_Havens_Jul_07.pdf",
        "54": "http://www.gao.gov/products/GAO-09-157",
        "55": "http://www.taxjustice.net/cms/upload/pdf/The_Price_of_Offshore_Revisited_Presser_120722.pdf",
        "56": "https://www.cbc.ca/news/world/wealthy-hiding-21-trillion-in-tax-havens-report-says-1.1253550",
        "57": "https://www.bbc.co.uk/news/business-18944097",
        "58": "https://web.archive.org/web/20131227214302/http://thesovereigninvestor.com/2012/07/30/fighting-anti-tax-haven-demagoguery-on-cnn/",
        "59": "http://uspirgedfund.org/sites/pirg/files/reports/Picking_Up_the_Tab_USP.pdf",
        "60": "https://www.nytimes.com/2012/05/06/opinion/sunday/these-islands-arent-just-a-shelter-from-taxes.html",
        "61": "http://www.accountancyage.com/debate/4/tax-avoidance-fair-or-foul",
        "62": "https://www.theguardian.com/technology/2013/jan/29/google-tax-chairman",
        "63": "http://www.newstatesman.com/blogs/voices/2012/06/tax-avoidance-isnt-left-or-right-issue-its-cancer-eating-our-democracy",
        "64": "http://www.ipsnews.net/2012/10/helsinki-boycotts-tax-havens/",
        "65": "https://www.telegraph.co.uk/news/politics/david-cameron/9779983/David-Cameron-Tax-avoiding-foreign-firms-like-Starbucks-and-Amazon-lack-moral-scruples.html",
        "66": "https://www.reuters.com/article/us-g20-tax-germany-merkel-idUSBRE91C1G020130213",
        "67": "http://ctj.org/ctjreports/2012/10/which_fortune_500_companies_are_sheltering_income_in_overseas_tax_havens.php",
        "68": "https://www.theguardian.com/commentisfree/2012/dec/10/end-tax-scams-by-hitting-big-four",
        "69": "https://www.theatlantic.com/international/archive/2012/08/did-the-bounds-of-cyber-war-just-expand-to-banks-and-neutral-states/261230/",
        "70": "http://www.lem.sssup.it/WPLem/documents/fazzari2.pdf",
        "71": "ISBN: 978-0-203-39219-5",
        "72": "ISBN: 978-1-56518-176-2",
        "73": "ISBN: 978-1-56518-176-2",
        "74": "ISBN: 978-1-4129-7582-7",
        "75": "ISBN: 978-1-4129-7582-7",
        "76": "ISBN: 978-1-4051-8407-6",
        "77": "https://doi.org/10.1080%2F13545701.2012.688998"
    },
    "flair_entities": [
        "yu xintian",
        "bangladesh",
        "reuters",
        "fortune",
        "gatt",
        "china",
        "yu",
        "russia",
        "seattle wto",
        "ritzer",
        "united nations",
        "the body shop",
        "wto",
        "general agreement on trade in services",
        "western",
        "strazdins",
        "mesopotamia",
        "united states",
        "un human development index",
        "ireland",
        "bce",
        "bbc",
        "united nations human development report",
        "government accountability office",
        "world war ii",
        "japan",
        "central america",
        "qatar",
        "international monetary fund",
        "malaysia",
        "syria",
        "us",
        "soviet union",
        "united kingdom",
        "cato institute",
        "global south",
        "george ritzer",
        "mcdonald",
        "multilateral agreement on investment",
        "slovakia",
        "czech republic",
        "general agreement on tariffs and trade",
        "us-based",
        "oecd",
        "british virgin islands",
        "big bang.",
        "martin wolf",
        "the north atlantic treaty organization",
        "mcdonald's",
        "u.s",
        "green jersey beps",
        "tax justice network",
        "sumer",
        "slovenia",
        "igo",
        "international labour organization",
        "world trade organization",
        "most favoured nation",
        "ex-soviet",
        "english",
        "al jazeera",
        "jersey",
        "mcdonaldization",
        "greek",
        "cnn",
        "daniel j",
        "multilateral convention to implement tax treaty related measures to prevent base erosion",
        "global financial integrity",
        "ukraine",
        "india",
        "the world bank",
        "ilo",
        "american",
        "isle of man",
        "global north",
        "marina prieto-carrón",
        "people's republic of china",
        "guernsey",
        "mitchell",
        "chartered institute of taxation",
        "the times",
        "north american",
        "london stock exchange",
        "world trade organization ministerial conference of 1999",
        "gini",
        "rana plaza",
        "british",
        "big four"
    ]
}