{
    "title": "Reticular_formation",
    "url": "https://en.wikipedia.org/wiki/Reticular_formation",
    "summary": "The reticular formation is a set of interconnected nuclei in the brainstem that spans from the lower end of the medulla oblongata to the upper end of the midbrain. The neurons of the reticular formation make up a complex set of neural networks in the core of the brainstem. The reticular formation is made up of a diffuse net-like formation of reticular nuclei which is not well-defined. It may be seen as being made up of all the interspersed cells in the brainstem between the more compact and named structures.\nThe reticular formation is functionally divided into the ascending reticular activating system (ARAS), ascending pathways to the cerebral cortex, and the descending reticular system, descending pathways (reticulospinal tracts) to the spinal cord. Due to its extent along the brainstem it may be divided into different areas such as the midbrain reticular formation, the central mesencephalic reticular formation, the pontine reticular formation, the paramedian pontine reticular formation, the dorsolateral pontine reticular formation, and the medullary reticular formation.\nNeurons of the ARAS basically act as an on/off switch to the cerebral cortex and hence play a crucial role in regulating wakefulness; behavioral arousal and consciousness are functionally related in the reticular formation using a number of neurotransmitter arousal systems. The overall functions of the reticular formation are modulatory and premotor,\ninvolving somatic motor control, cardiovascular control, pain modulation, sleep and consciousness, and habituation. The modulatory functions are primarily found in the rostral sector of the reticular formation and the premotor functions are localized in the neurons in more caudal regions.\nThe reticular formation is divided into three columns: raphe nuclei (median), gigantocellular reticular nuclei (medial zone), and parvocellular reticular nuclei (lateral zone). The raphe nuclei are the place of synthesis of the neurotransmitter serotonin, which plays an important role in mood regulation. The gigantocellular nuclei are involved in motor coordination. The parvocellular nuclei regulate exhalation.\nThe reticular formation is essential for governing some of the basic functions of higher organisms. It is phylogenetically old and found in lower vertebrates.",
    "content": [
        {
            "section_title": "Structure",
            "section_content": [
                {
                    "sentence": "The ARAS is composed of several neural circuits connecting the dorsal part of the posterior midbrain and the ventral pons to the cerebral cortex via distinct pathways that project through the thalamus and hypothalamus",
                    "refs": []
                },
                {
                    "sentence": "The ARAS is a collection of different nuclei – more than 20 on each side in the upper brainstem, the pons, medulla, and posterior hypothalamus",
                    "refs": [
                        "https://doi.org/10.5603%2FAIT.2015.0015",
                        "ISBN: 978-0071481274",
                        "https://www.semanticscholar.org/paper/070f1866276d1f1ff224384dcce6c9ed958b7063"
                    ]
                },
                {
                    "sentence": "The neurotransmitters that these neurons release include dopamine, norepinephrine, serotonin, histamine, acetylcholine, and glutamate",
                    "refs": [
                        "http://thebrain.mcgill.ca/flash/a/a_11/a_11_cr/a_11_cr_cyc/a_11_cr_cyc.html"
                    ]
                },
                {
                    "sentence": "They exert cortical influence through direct axonal projections and indirect projections through thalamic relays",
                    "refs": [
                        "https://doi.org/10.5603%2FAIT.2015.0015",
                        "ISBN: 978-0123858702",
                        "ISBN: 978-0071481274",
                        "https://www.semanticscholar.org/paper/070f1866276d1f1ff224384dcce6c9ed958b7063"
                    ]
                },
                {
                    "sentence": "The thalamic pathway consists primarily of cholinergic neurons in the pontine tegmentum, whereas the hypothalamic pathway is composed primarily of neurons that release monoamine neurotransmitters, namely dopamine, norepinephrine, serotonin, and histamine",
                    "refs": []
                },
                {
                    "sentence": "The glutamate-releasing neurons in the ARAS were identified much more recently relative to the monoaminergic and cholinergic nuclei;  the glutamatergic component of the ARAS includes one nucleus in the hypothalamus and various brainstem nuclei",
                    "refs": [
                        "https://doi.org/10.5603%2FAIT.2015.0015",
                        "ISBN: 978-0123858702",
                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4660253"
                    ]
                },
                {
                    "sentence": "The orexin neurons of the lateral hypothalamus innervate every component of the ascending reticular activating system and coordinate activity within the entire system",
                    "refs": [
                        "ISBN: 978-0071481274",
                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4660253",
                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5531075"
                    ]
                },
                {
                    "sentence": "The ARAS consists of evolutionarily ancient areas of the brain, which are crucial to the animal's survival and protected during adverse periods, such as during inhibitory periods of animal hypnosis also known as Totstellreflex",
                    "refs": []
                },
                {
                    "sentence": "The ascending reticular activating system which sends neuromodulatory projections to the cortex - mainly connects to the prefrontal cortex",
                    "refs": [
                        "https://ui.adsabs.harvard.edu/abs/1996Sci...271..512K"
                    ]
                },
                {
                    "sentence": "There seems to be low connectivity to the motor areas of the cortex",
                    "refs": [
                        "https://ui.adsabs.harvard.edu/abs/1957Sci...125..156S"
                    ]
                }
            ],
            "subsections": [
                {
                    "section_title": "Medial and lateral reticular formation",
                    "section_content": [
                        {
                            "sentence": "The medial reticular formation and lateral reticular formation are two columns of nuclei with ill-defined boundaries that send projections through the medulla and into the midbrain",
                            "refs": []
                        },
                        {
                            "sentence": "The nuclei can be differentiated by function, cell type, and projections of efferent or afferent nerves",
                            "refs": []
                        },
                        {
                            "sentence": "Moving caudally from the rostral midbrain, at the site of the rostral pons and the midbrain, the medial RF becomes less prominent, and the lateral RF becomes more prominent",
                            "refs": []
                        },
                        {
                            "sentence": "[citation needed]",
                            "refs": []
                        },
                        {
                            "sentence": "Existing on the sides of the medial reticular formation is its lateral cousin, which is particularly pronounced in the rostral medulla and caudal pons",
                            "refs": []
                        },
                        {
                            "sentence": "Out from this area spring the cranial nerves, including the very important vagus nerve",
                            "refs": []
                        },
                        {
                            "sentence": "[clarification needed]  The lateral RF is known for its ganglions and areas of interneurons around the cranial nerves, which serve to mediate their characteristic reflexes and functions.",
                            "refs": []
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Major subsystems",
            "section_content": [
                {
                    "sentence": "The subsystems of the reticular formation are the ascending reticular activating system, and the descending reticular system",
                    "refs": []
                }
            ],
            "subsections": [
                {
                    "section_title": "Ascending reticular activating system",
                    "section_content": [
                        {
                            "sentence": "The ascending reticular activating system (ARAS), also known as the extrathalamic control modulatory system or simply the reticular activating system (RAS), is a set of connected nuclei in the brains of vertebrates that is responsible for regulating wakefulness and sleep-wake transitions",
                            "refs": []
                        },
                        {
                            "sentence": "The ARAS is in the midbrain reticular formation",
                            "refs": []
                        },
                        {
                            "sentence": "It is mostly composed of various nuclei in the  thalamus/hypothalamus and a number of dopaminergic, noradrenergic, serotonergic, histaminergic, cholinergic, and glutamatergic brain nuclei",
                            "refs": [
                                "http://thebrain.mcgill.ca/flash/a/a_11/a_11_cr/a_11_cr_cyc/a_11_cr_cyc.html"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Structure",
                    "section_content": [
                        {
                            "sentence": "The ARAS is composed of several neural circuits connecting the dorsal part of the posterior midbrain and the ventral pons to the cerebral cortex via distinct pathways that project through the thalamus and hypothalamus",
                            "refs": []
                        },
                        {
                            "sentence": "The ARAS is a collection of different nuclei – more than 20 on each side in the upper brainstem, the pons, medulla, and posterior hypothalamus",
                            "refs": [
                                "https://doi.org/10.5603%2FAIT.2015.0015",
                                "ISBN: 978-0071481274",
                                "https://www.semanticscholar.org/paper/070f1866276d1f1ff224384dcce6c9ed958b7063"
                            ]
                        },
                        {
                            "sentence": "The neurotransmitters that these neurons release include dopamine, norepinephrine, serotonin, histamine, acetylcholine, and glutamate",
                            "refs": [
                                "http://thebrain.mcgill.ca/flash/a/a_11/a_11_cr/a_11_cr_cyc/a_11_cr_cyc.html"
                            ]
                        },
                        {
                            "sentence": "They exert cortical influence through direct axonal projections and indirect projections through thalamic relays",
                            "refs": [
                                "https://doi.org/10.5603%2FAIT.2015.0015",
                                "ISBN: 978-0123858702",
                                "ISBN: 978-0071481274",
                                "https://www.semanticscholar.org/paper/070f1866276d1f1ff224384dcce6c9ed958b7063"
                            ]
                        },
                        {
                            "sentence": "The thalamic pathway consists primarily of cholinergic neurons in the pontine tegmentum, whereas the hypothalamic pathway is composed primarily of neurons that release monoamine neurotransmitters, namely dopamine, norepinephrine, serotonin, and histamine",
                            "refs": []
                        },
                        {
                            "sentence": "The glutamate-releasing neurons in the ARAS were identified much more recently relative to the monoaminergic and cholinergic nuclei;  the glutamatergic component of the ARAS includes one nucleus in the hypothalamus and various brainstem nuclei",
                            "refs": [
                                "https://doi.org/10.5603%2FAIT.2015.0015",
                                "ISBN: 978-0123858702",
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4660253"
                            ]
                        },
                        {
                            "sentence": "The orexin neurons of the lateral hypothalamus innervate every component of the ascending reticular activating system and coordinate activity within the entire system",
                            "refs": [
                                "ISBN: 978-0071481274",
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4660253",
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5531075"
                            ]
                        },
                        {
                            "sentence": "The ARAS consists of evolutionarily ancient areas of the brain, which are crucial to the animal's survival and protected during adverse periods, such as during inhibitory periods of animal hypnosis also known as Totstellreflex",
                            "refs": []
                        },
                        {
                            "sentence": "The ascending reticular activating system which sends neuromodulatory projections to the cortex - mainly connects to the prefrontal cortex",
                            "refs": [
                                "https://ui.adsabs.harvard.edu/abs/1996Sci...271..512K"
                            ]
                        },
                        {
                            "sentence": "There seems to be low connectivity to the motor areas of the cortex",
                            "refs": [
                                "https://ui.adsabs.harvard.edu/abs/1957Sci...125..156S"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Function",
                    "section_content": [],
                    "subsections": [
                        {
                            "section_title": "Consciousness",
                            "section_content": [
                                {
                                    "sentence": "The ascending reticular activating system is an important enabling factor for the state of consciousness",
                                    "refs": []
                                },
                                {
                                    "sentence": "The ascending system is seen to contribute to wakefulness as characterised by cortical and behavioural arousal",
                                    "refs": [
                                        "http://thebrain.mcgill.ca/flash/a/a_11/a_11_cr/a_11_cr_cyc/a_11_cr_cyc.html"
                                    ]
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Regulating sleep-wake transitions",
                            "section_content": [
                                {
                                    "sentence": "The main function of the ARAS is to modify and potentiate thalamic and cortical function such that electroencephalogram (EEG) desynchronization ensues",
                                    "refs": []
                                },
                                {
                                    "sentence": "[B]   There are distinct differences in the brain's electrical activity during periods of wakefulness and sleep: Low voltage fast burst brain waves (EEG desynchronization) are associated with wakefulness and REM sleep (which are electrophysiologically similar); high voltage slow waves are found during non-REM sleep",
                                    "refs": [
                                        "[ERROR retrieving ref link]",
                                        "[ERROR retrieving ref link]"
                                    ]
                                },
                                {
                                    "sentence": "Generally speaking, when thalamic relay neurons are in burst mode the EEG is synchronized and when they are in tonic mode it is desynchronized",
                                    "refs": []
                                },
                                {
                                    "sentence": "Stimulation of the ARAS produces EEG desynchronization by suppressing slow cortical waves (0.3–1 Hz), delta waves (1–4 Hz), and spindle wave oscillations (11–14 Hz) and by promoting gamma band (20–40 Hz) oscillations",
                                    "refs": [
                                        "[ERROR retrieving ref link]"
                                    ]
                                },
                                {
                                    "sentence": "The physiological change from a state of deep sleep to wakefulness is reversible and mediated by the ARAS",
                                    "refs": []
                                },
                                {
                                    "sentence": "The ventrolateral preoptic nucleus (VLPO) of the hypothalamus inhibits the neural circuits responsible for the awake state, and VLPO activation contributes to the sleep onset",
                                    "refs": [
                                        "https://ui.adsabs.harvard.edu/abs/1996Sci...272..225S"
                                    ]
                                },
                                {
                                    "sentence": "During sleep, neurons in the ARAS will have a much lower firing rate; conversely, they will have a higher activity level during the waking state",
                                    "refs": [
                                        "https://doi.org/10.1006%2Fsmns.1995.0038"
                                    ]
                                },
                                {
                                    "sentence": "In order that the brain may sleep, there must be a reduction in ascending afferent activity reaching the cortex by suppression of the ARAS",
                                    "refs": [
                                        "https://doi.org/10.1016%2Fs0987-7053%2803%2900002-9"
                                    ]
                                },
                                {
                                    "sentence": "Dysfunction of the paraventricular nucleus of the hypothalamus can lead to drowsiness for up to 20 hours per day",
                                    "refs": [
                                        "https://ui.adsabs.harvard.edu/abs/1996Sci...272..225S"
                                    ]
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Attention",
                            "section_content": [
                                {
                                    "sentence": "The ARAS also helps mediate transitions from relaxed wakefulness to periods of high attention",
                                    "refs": []
                                },
                                {
                                    "sentence": "There is increased regional blood flow (presumably indicating an increased measure of neuronal activity) in the midbrain reticular formation (MRF) and thalamic intralaminar nuclei during tasks requiring increased alertness and attention",
                                    "refs": [
                                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3119596"
                                    ]
                                },
                                {
                                    "sentence": "[citation needed]",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Clinical significance of the ARAS",
                            "section_content": [
                                {
                                    "sentence": "Mass lesions in the ARAS nuclei can cause a loss of consciousness",
                                    "refs": []
                                },
                                {
                                    "sentence": "Bilateral damage to the ARAS nuclei may lead to coma or death",
                                    "refs": [
                                        "http://thebrain.mcgill.ca/flash/a/a_11/a_11_cr/a_11_cr_cyc/a_11_cr_cyc.html",
                                        "https://doi.org/10.1016%2F0014-4886%2884%2990065-7"
                                    ]
                                },
                                {
                                    "sentence": "Direct electrical stimulation of the ARAS produces pain responses in cats and elicits verbal reports of pain in humans",
                                    "refs": []
                                },
                                {
                                    "sentence": "[citation needed] Ascending reticular activation in cats can produce mydriasis,  which can result from prolonged pain",
                                    "refs": [
                                        "https://www.ncbi.nlm.nih.gov/books/NBK380/#A1740"
                                    ]
                                },
                                {
                                    "sentence": "These results suggest some relationship between ARAS circuits and physiological pain pathways",
                                    "refs": []
                                },
                                {
                                    "sentence": "Some pathologies of the ARAS may be attributed to ageing, as there appears to be a general decline in reactivity of the ARAS with advancing years",
                                    "refs": []
                                },
                                {
                                    "sentence": "Changes in electrical coupling [C] have been suggested to account for some changes in ARAS activity: if coupling were down-regulated, there would be a corresponding decrease in higher-frequency synchronization (gamma band)",
                                    "refs": [
                                        "[ERROR retrieving ref link]"
                                    ]
                                },
                                {
                                    "sentence": "Conversely, up-regulated electrical coupling would increase synchronization of fast rhythms that could lead to increased arousal and REM sleep drive",
                                    "refs": []
                                },
                                {
                                    "sentence": "Specifically, disruption of the ARAS has been implicated in the following disorders:",
                                    "refs": [
                                        "https://doi.org/10.1016%2FS1388-2457%2899%2900078-4"
                                    ]
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Developmental influences",
                            "section_content": [
                                {
                                    "sentence": "There are several potential factors that may adversely influence the development of the ascending reticular activating system:",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "section_title": "Descending reticulospinal system",
                    "section_content": [
                        {
                            "sentence": "The reticulospinal tracts, are extrapyramidal motor tracts that descend from the reticular formation  in two tracts to act on the motor neurons supplying the trunk and proximal limb flexors and extensors",
                            "refs": [
                                "https://doi.org/10.1016%2FS0891-0618%2899%2900048-4"
                            ]
                        },
                        {
                            "sentence": "The reticulospinal tracts are involved mainly in locomotion and postural control, although they do have other functions as well",
                            "refs": []
                        },
                        {
                            "sentence": "The descending reticulospinal tracts are one of four major cortical pathways to the spinal cord for musculoskeletal activity",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2670248"
                            ]
                        },
                        {
                            "sentence": "The reticulospinal tracts work with the other three pathways to give a coordinated control of movement, including delicate manipulations",
                            "refs": []
                        },
                        {
                            "sentence": "The four pathways can be grouped into two main system pathways – a medial system and a lateral system",
                            "refs": [
                                "https://doi.org/10.1016%2FS0891-0618%2899%2900048-4"
                            ]
                        },
                        {
                            "sentence": "The medial system includes the reticulospinal tract and the vestibulospinal tract, and provides control of posture",
                            "refs": []
                        },
                        {
                            "sentence": "The corticospinal tract and the rubrospinal tract belong to the lateral system which provides fine control of movement",
                            "refs": []
                        },
                        {
                            "sentence": "The reticulospinal tracts are the medial reticulospinal tract, and the lateral reticulospinal tract",
                            "refs": []
                        },
                        {
                            "sentence": "[citation needed]",
                            "refs": []
                        },
                        {
                            "sentence": "The ascending sensory tract conveying information in the opposite direction is the spinoreticular tract.",
                            "refs": []
                        }
                    ],
                    "subsections": [
                        {
                            "section_title": "Function",
                            "section_content": [],
                            "subsections": []
                        },
                        {
                            "section_title": "Clinical significance",
                            "section_content": [
                                {
                                    "sentence": "The reticulospinal tracts provide a pathway by which the hypothalamus can control sympathetic thoracolumbar outflow and parasympathetic sacral outflow",
                                    "refs": []
                                },
                                {
                                    "sentence": "[citation needed]",
                                    "refs": []
                                },
                                {
                                    "sentence": "Two major descending systems carrying signals from the brainstem and cerebellum to the spinal cord can trigger automatic postural response for balance and orientation: vestibulospinal tracts from the vestibular nuclei and reticulospinal tracts from the pons and medulla",
                                    "refs": []
                                },
                                {
                                    "sentence": "Lesions of these tracts result in profound ataxia and postural instability",
                                    "refs": []
                                },
                                {
                                    "sentence": "Physical or vascular damage to the brainstem disconnecting the red nucleus (midbrain) and the vestibular nuclei (pons) may cause decerebrate rigidity, which has the neurological sign of increased muscle tone and hyperactive stretch reflexes",
                                    "refs": []
                                },
                                {
                                    "sentence": "Responding to a startling or painful stimulus, both arms and legs extend and turn internally",
                                    "refs": []
                                },
                                {
                                    "sentence": "The cause is the tonic activity of lateral vestibulospinal and reticulospinal tracts stimulating extensor motoneurons without the inhibitions from rubrospinal tract",
                                    "refs": []
                                },
                                {
                                    "sentence": "Brainstem damage above the red nucleus level may cause decorticate rigidity",
                                    "refs": []
                                },
                                {
                                    "sentence": "Responding to a startling or painful stimulus, the arms flex and the legs extend",
                                    "refs": []
                                },
                                {
                                    "sentence": "The cause is the red nucleus, via the rubrospinal tract, counteracting the extensor motorneuron's excitation from the lateral vestibulospinal and reticulospinal tracts",
                                    "refs": []
                                },
                                {
                                    "sentence": "Because the rubrospinal tract only extends to the cervical spinal cord, it mostly acts on the arms by exciting the flexor muscles and inhibiting the extensors, rather than the legs",
                                    "refs": []
                                },
                                {
                                    "sentence": "Damage to the medulla below the vestibular nuclei may cause flaccid paralysis, hypotonia, loss of respiratory drive, and quadriplegia",
                                    "refs": []
                                },
                                {
                                    "sentence": "There are no reflexes resembling early stages of spinal shock because of complete loss of activity in the motorneurons, as there is no longer any tonic activity arising from the lateral vestibulospinal and reticulospinal tracts",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        },
        {
            "section_title": "History",
            "section_content": [
                {
                    "sentence": "The term \"reticular formation\" was coined in the late 19th century by Otto Deiters, coinciding with Ramon y Cajal's neuron doctrine",
                    "refs": []
                },
                {
                    "sentence": "Allan Hobson states in his book The Reticular Formation Revisited that the name is an etymological vestige from the fallen era of the aggregate field theory in the neural sciences",
                    "refs": []
                },
                {
                    "sentence": "The term \"reticulum\" means \"netlike structure\", which is what the reticular formation resembles at first glance",
                    "refs": []
                },
                {
                    "sentence": "It has been described as being either too complex to study or an undifferentiated part of the brain with no organization at all",
                    "refs": []
                },
                {
                    "sentence": "Eric Kandel describes the reticular formation as being organized in a similar manner to the intermediate gray matter of the spinal cord",
                    "refs": []
                },
                {
                    "sentence": "This chaotic, loose, and intricate form of organization is what has turned off many researchers from looking farther into this particular area of the brain",
                    "refs": []
                },
                {
                    "sentence": "[citation needed] The cells lack clear ganglionic boundaries, but do have clear functional organization and distinct cell types",
                    "refs": []
                },
                {
                    "sentence": "The term \"reticular formation\" is seldom used anymore except to speak in generalities",
                    "refs": []
                },
                {
                    "sentence": "Modern scientists usually refer to the individual nuclei that compose the reticular formation",
                    "refs": []
                },
                {
                    "sentence": "[citation needed]",
                    "refs": []
                },
                {
                    "sentence": "Moruzzi and Magoun first investigated the neural components regulating the brain's sleep-wake mechanisms in 1949",
                    "refs": []
                },
                {
                    "sentence": "Physiologists had proposed that some structure deep within the brain controlled mental wakefulness and alertness",
                    "refs": []
                },
                {
                    "sentence": "It had been thought that wakefulness depended only on the direct reception of afferent (sensory) stimuli at the cerebral cortex",
                    "refs": [
                        "[ERROR retrieving ref link]"
                    ]
                },
                {
                    "sentence": "[citation needed]",
                    "refs": []
                },
                {
                    "sentence": "As direct electrical stimulation of the brain could simulate electrocortical relays, Magoun used this principle to demonstrate, on two separate areas of the brainstem of a cat, how to produce wakefulness from sleep",
                    "refs": []
                },
                {
                    "sentence": "He first stimulated the ascending somatic and auditory paths; second, a series of \"ascending relays from the reticular formation of the lower brain stem through the midbrain tegmentum, subthalamus and hypothalamus to the internal capsule.\"  The latter was of particular interest, as this series of relays did not correspond to any known anatomical pathways for the wakefulness signal transduction and was coined the ascending reticular activating system (ARAS)",
                    "refs": [
                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5915564"
                    ]
                },
                {
                    "sentence": "[citation needed]",
                    "refs": []
                },
                {
                    "sentence": "Next, the significance of this newly identified relay system was evaluated by placing lesions in the medial and lateral portions of the front of the midbrain",
                    "refs": []
                },
                {
                    "sentence": "Cats with mesencephalic interruptions to the ARAS entered into a deep sleep and displayed corresponding brain waves",
                    "refs": []
                },
                {
                    "sentence": "In alternative fashion, cats with similarly placed interruptions to ascending auditory and somatic pathways exhibited normal sleeping and wakefulness, and could be awakened with physical stimuli",
                    "refs": []
                },
                {
                    "sentence": "Because these external stimuli would be blocked on their way to the cortex by the interruptions, this indicated that the ascending transmission must travel through the newly discovered ARAS",
                    "refs": []
                },
                {
                    "sentence": "[citation needed]",
                    "refs": []
                },
                {
                    "sentence": "Finally, Magoun recorded potentials within the medial portion of the brain stem and discovered that auditory stimuli directly fired portions of the reticular activating system",
                    "refs": []
                },
                {
                    "sentence": "Furthermore, single-shock stimulation of the sciatic nerve also activated the medial reticular formation, hypothalamus, and thalamus",
                    "refs": []
                },
                {
                    "sentence": "Excitation of the ARAS did not depend on further signal propagation through the cerebellar circuits, as the same results were obtained following decerebellation and decortication",
                    "refs": []
                },
                {
                    "sentence": "The researchers proposed that a column of cells surrounding the midbrain reticular formation received input from all the ascending tracts of the brain stem and relayed these afferents to the cortex and therefore regulated wakefulness",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "See also",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "Footnotes",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "References",
            "section_content": [],
            "subsections": [
                {
                    "section_title": "Other references",
                    "section_content": [],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "External links",
            "section_content": [],
            "subsections": []
        }
    ],
    "references": {
        "10": "[ERROR retrieving ref link]",
        "27": "[ERROR retrieving ref link]",
        "39": "[ERROR retrieving ref link]",
        "1": "https://web.archive.org/web/20180421094316/http://www.bartleby.com/107/illus701.html",
        "2": "ISBN: 9780195381153",
        "3": "ISBN: 978-0878936953",
        "4": "ISBN: 9780323396325",
        "5": "ISBN: 9788131237274",
        "6": "https://doi.org/10.5603%2FAIT.2015.0015",
        "7": "https://books.google.com/books?id=5lvEDQAAQBAJ&q=%22descending%20reticular%20formation%22%20reticulospinal&pg=PT426",
        "8": "https://ui.adsabs.harvard.edu/abs/2008NYASA1129...26J",
        "9": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5403835",
        "11": "ISBN: 9780071222075",
        "12": "http://thebrain.mcgill.ca/flash/a/a_11/a_11_cr/a_11_cr_cyc/a_11_cr_cyc.html",
        "13": "ISBN: 978-0123858702",
        "14": "ISBN: 978-0071481274",
        "15": "https://www.semanticscholar.org/paper/070f1866276d1f1ff224384dcce6c9ed958b7063",
        "16": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4660253",
        "17": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5531075",
        "18": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5680228",
        "19": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6758338",
        "20": "ISBN: 978-0071481274",
        "21": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5713303",
        "22": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3119596",
        "23": "https://ui.adsabs.harvard.edu/abs/1996Sci...271..512K",
        "24": "https://ui.adsabs.harvard.edu/abs/1957Sci...125..156S",
        "25": "https://doi.org/10.1016%2Fj.neulet.2015.09.004",
        "26": "[ERROR retrieving ref link]",
        "28": "https://ui.adsabs.harvard.edu/abs/1996Sci...272..225S",
        "29": "https://doi.org/10.1006%2Fsmns.1995.0038",
        "30": "https://doi.org/10.1016%2Fs0987-7053%2803%2900002-9",
        "31": "[ERROR retrieving ref link]",
        "32": "https://doi.org/10.1016%2F0014-4886%2884%2990065-7",
        "33": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8964012",
        "34": "https://www.ncbi.nlm.nih.gov/books/NBK380/#A1740",
        "35": "[ERROR retrieving ref link]",
        "36": "https://doi.org/10.1016%2F0014-4886%2877%2990043-7",
        "37": "https://doi.org/10.1016%2FS1388-2457%2899%2900078-4",
        "38": "https://archive.org/details/hendersonsdictio0000unse_q5a4/page/195",
        "40": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2082101",
        "41": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2701283",
        "42": "https://doi.org/10.1016%2FS0891-0618%2899%2900048-4",
        "43": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2670248",
        "44": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3320145",
        "45": "ISBN: 978-0123858702",
        "46": "ISBN: 978-0702037382",
        "47": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5915564",
        "48": "ISBN: 978-0071390118",
        "49": "[ERROR retrieving ref link]",
        "50": "https://doi.org/10.1001%2Farchneurpsyc.1952.02320140013002"
    },
    "flair_entities": [
        "ras",
        "aras",
        "allan hobson",
        "totstellreflex",
        "eric kandel",
        "magoun",
        "ramon y cajal",
        "moruzzi",
        "eeg",
        "the reticular formation revisited",
        "otto deiters"
    ]
}