{
    "title": "Preventive_healthcare",
    "url": "https://en.wikipedia.org/wiki/Preventive_healthcare",
    "summary": "Preventive healthcare, or prophylaxis, is the application of healthcare measures to prevent diseases. Disease and disability are affected by environmental factors, genetic predisposition, disease agents, and lifestyle choices, and are dynamic processes that begin before individuals realize they are affected. Disease prevention relies on anticipatory actions that can be categorized as primal, primary, secondary, and tertiary prevention.\nEach year, millions of people die of preventable causes. A 2004 study showed that about half of all deaths in the United States in 2000 were due to preventable behaviors and exposures. Leading causes included cardiovascular disease, chronic respiratory disease, unintentional injuries, diabetes, and certain infectious diseases. This same study estimates that 400,000 people die each year in the United States due to poor diet and a sedentary lifestyle. According to estimates made by the World Health Organization (WHO), about 55 million people died worldwide in 2011, and two-thirds of these died from non-communicable diseases, including cancer, diabetes, and chronic cardiovascular and lung diseases. This is an increase from the year 2000, during which 60% of deaths were attributed to these diseases.)\nPreventive healthcare is especially important given the worldwide rise in the prevalence of chronic diseases and deaths from these diseases. There are many methods for prevention of disease. One of them is prevention of teenage smoking through information giving. It is recommended that adults and children aim to visit their doctor for regular check-ups, even if they feel healthy, to perform disease screening, identify risk factors for disease, discuss tips for a healthy and balanced lifestyle, stay up to date with immunizations and boosters, and maintain a good relationship with a healthcare provider. In pediatrics, some common examples of primary prevention are encouraging parents to turn down the temperature of their home water heater in order to avoid scalding burns, encouraging children to wear bicycle helmets, and suggesting that people use the air quality index (AQI) to check the level of pollution in the outside air before engaging in sporting activities. Some common disease screenings include checking for hypertension (high blood pressure), hyperglycemia (high blood sugar, a risk factor for diabetes mellitus), hypercholesterolemia (high blood cholesterol), screening for colon cancer, depression, HIV and other common types of sexually transmitted disease such as chlamydia, syphilis, and gonorrhea, mammography (to screen for breast cancer), colorectal cancer screening, a Pap test (to check for cervical cancer), and screening for osteoporosis. Genetic testing can also be performed to screen for mutations that cause genetic disorders or predisposition to certain diseases such as breast or ovarian cancer. However, these measures are not affordable for every individual and the cost effectiveness of preventive healthcare is still a topic of debate.",
    "content": [
        {
            "section_title": "Overview",
            "section_content": [
                {
                    "sentence": "Preventive healthcare strategies are described as taking place at the primal,  primary,  secondary, and tertiary prevention levels.Although advocated as preventive medicine in the early twentieth century by Sara Josephine Baker,  in the 1940s, Hugh R",
                    "refs": [
                        "http://primalprevention.org",
                        "[ERROR retrieving ref link]",
                        "[ERROR retrieving ref link]"
                    ]
                },
                {
                    "sentence": "Leavell and E",
                    "refs": []
                },
                {
                    "sentence": "Gurney Clark coined the term primary prevention",
                    "refs": []
                },
                {
                    "sentence": "They worked at the Harvard and Columbia University Schools of Public Health, respectively, and later expanded the levels to include secondary and tertiary prevention",
                    "refs": []
                },
                {
                    "sentence": "Goldston (1987) notes that these levels might be better described as \"prevention, treatment, and rehabilitation\", although the terms primary, secondary, and tertiary prevention are still in use today",
                    "refs": []
                },
                {
                    "sentence": "The concept of primal prevention has been created much more recently, in relation to the new developments in molecular biology over the last fifty years,  more particularly in epigenetics, which point to the paramount importance of environmental conditions, both physical and affective, on the organism during its fetal and newborn life, or so-called primal period of life",
                    "refs": [
                        "[ERROR retrieving ref link]"
                    ]
                }
            ],
            "subsections": [
                {
                    "section_title": "Primal and primordial preventions",
                    "section_content": [
                        {
                            "sentence": "Primal prevention is health promotion par excellence",
                            "refs": []
                        },
                        {
                            "sentence": "New knowledge in molecular biology, in particular epigenetics, points to how much affective as well as physical environment during fetal and newborn life may determine adult health",
                            "refs": [
                                "http://www.primalprevention.org"
                            ]
                        },
                        {
                            "sentence": "This way of promoting health consists mainly in providing future parents with pertinent, unbiased information on primal health and supporting them during their child's primal period of life (i.e., \"from conception to first anniversary\" according to definition by the Primal Health Research Centre, London)",
                            "refs": [
                                "[ERROR retrieving ref link]",
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3923653",
                                "[ERROR retrieving ref link]",
                                "https://doi.org/10.1016%2Fj.it.2015.09.009"
                            ]
                        },
                        {
                            "sentence": "This includes adequate parental leave, ideally for both parents, with kin caregiving and financial help where needed",
                            "refs": []
                        },
                        {
                            "sentence": "Primordial prevention refers to all measures designed to prevent the development of risk factors in the first place, early in life,   and even preconception, as Ruth A",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4349501",
                                "https://doi.org/10.1093%2Fije%2Fdyv102"
                            ]
                        },
                        {
                            "sentence": "Etzel has described it \"all population-level actions and measures that inhibit the emergence and establishment of adverse environmental, economic, and social conditions\"",
                            "refs": []
                        },
                        {
                            "sentence": "This could be reducing air pollution  or prohibiting endocrine-disrupting chemicals in food-handling equipment and food contact materials",
                            "refs": [
                                "https://doi.org/10.1016/j.cppeds.2015.12.008"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Primary prevention",
                    "section_content": [
                        {
                            "sentence": "Primary prevention consists of traditional health promotion and \"specific protection\"",
                            "refs": []
                        },
                        {
                            "sentence": "Health promotion activities include prevention strategies such as health education and lifestyle medicine, and are current, non-clinical life choices such as eating nutritious meals and exercising often, that prevent lifestyle-related medical conditions, improve the quality of life, and create a sense of overall well-being",
                            "refs": [
                                "https://web.archive.org/web/20100827091640/http://www.iom.edu/~/media/Files/Activity%20Files/Quality/IntegrativeMed/Preventive%20Medicine%20Integrative%20Medicine%20and%20the%20Health%20of%20the%20Public.pdf"
                            ]
                        },
                        {
                            "sentence": "Preventing disease and creating overall well-being prolongs life expectancy",
                            "refs": [
                                "https://books.google.com/books?id=7gPNCwAAQBAJ&pg=PA9"
                            ]
                        },
                        {
                            "sentence": "Health-promotional activities do not target a specific disease or condition but rather promote health and well-being on a very general level",
                            "refs": [
                                "[ERROR retrieving ref link]",
                                "https://web.archive.org/web/20100827091640/http://www.iom.edu/~/media/Files/Activity%20Files/Quality/IntegrativeMed/Preventive%20Medicine%20Integrative%20Medicine%20and%20the%20Health%20of%20the%20Public.pdf"
                            ]
                        },
                        {
                            "sentence": "On the other hand, specific protection targets a type or group of diseases and complements the goals of health promotion",
                            "refs": [
                                "[ERROR retrieving ref link]"
                            ]
                        }
                    ],
                    "subsections": [
                        {
                            "section_title": "Food",
                            "section_content": [
                                {
                                    "sentence": "Food is the most basic tool in preventive health care",
                                    "refs": []
                                },
                                {
                                    "sentence": "Poor nutrition is linked to various chronic illnesses",
                                    "refs": []
                                },
                                {
                                    "sentence": "Because of this, having a healthy diet and proper nutrition can be used to prevent illnesses",
                                    "refs": []
                                }
                            ],
                            "subsections": [
                                {
                                    "section_title": "Access",
                                    "section_content": [
                                        {
                                            "sentence": "The 2011 National Health Interview Survey performed by the Centers for Disease Control was the first national survey to include questions about ability to pay for food",
                                            "refs": []
                                        },
                                        {
                                            "sentence": "Difficulty with paying for food, medicine, or both is a problem facing 1 out of 3 Americans",
                                            "refs": []
                                        },
                                        {
                                            "sentence": "If better food options were available through food banks, soup kitchens, and other resources for low-income people, obesity and the chronic conditions that come along with it would be better controlled",
                                            "refs": []
                                        },
                                        {
                                            "sentence": "A food desert is an area with restricted access to healthy foods due to a lack of supermarkets within a reasonable distance",
                                            "refs": [
                                                "https://www.theatlantic.com/health/archive/2014/04/access-to-good-food-as-preventive-medicine/360049"
                                            ]
                                        },
                                        {
                                            "sentence": "These are often low-income neighborhoods with the majority of residents lacking transportation",
                                            "refs": []
                                        },
                                        {
                                            "sentence": "There have been several grassroots movements since 1995 to encourage urban gardening, using vacant lots to grow food cultivated by local residents",
                                            "refs": [
                                                "http://www.foodispower.org/food-deserts"
                                            ]
                                        },
                                        {
                                            "sentence": "Mobile fresh markets are another resource for residents in a \"food desert\", which are specially outfitted buses bringing affordable fresh fruits and vegetables to low-income neighborhoods",
                                            "refs": [
                                                "http://www.greenthumbnyc.org"
                                            ]
                                        }
                                    ],
                                    "subsections": []
                                },
                                {
                                    "section_title": "Food education and guidance",
                                    "section_content": [
                                        {
                                            "sentence": "It has been proposed that healthy longevity diets are included in standard healthcare as switching from a \"typical Western diet\" could often extend life by a decade",
                                            "refs": []
                                        }
                                    ],
                                    "subsections": []
                                }
                            ]
                        },
                        {
                            "section_title": "Protective measures",
                            "section_content": [
                                {
                                    "sentence": "Specific protective measures such as water purification, sewage treatment, and the development of personal hygienic routines, such as regular hand-washing, safe sex to prevent sexually transmitted infections, became mainstream upon the discovery of infectious disease agents and have decreased the rates of communicable diseases which are spread in unsanitary conditions",
                                    "refs": []
                                },
                                {
                                    "sentence": "Scientific advancements in genetics have contributed to the knowledge of hereditary diseases and have facilitated progress in specific protective measures in individuals who are carriers of a disease gene or have an increased predisposition to a specific disease",
                                    "refs": []
                                },
                                {
                                    "sentence": "Genetic testing has allowed physicians to make quicker and more accurate diagnoses and has allowed for tailored treatments or personalized medicine",
                                    "refs": []
                                },
                                {
                                    "sentence": "Food safety has a significant impact on human health and food quality monitoring has increased",
                                    "refs": []
                                },
                                {
                                    "sentence": "Water, including drinking water, is also monitored in many cases for securing health",
                                    "refs": [
                                        "https://doi.org/10.3390%2Fchemosensors10010022"
                                    ]
                                },
                                {
                                    "sentence": "There also is some monitoring of air pollution",
                                    "refs": []
                                },
                                {
                                    "sentence": "In many cases, environmental standards such as via maximum pollution levels, regulation of chemicals, occupational hygiene requirements or consumer protection regulations establish some protection in combination with the monitoring",
                                    "refs": []
                                },
                                {
                                    "sentence": "[citation needed]",
                                    "refs": []
                                },
                                {
                                    "sentence": "Preventive measures like vaccines and medical screenings are also important",
                                    "refs": []
                                },
                                {
                                    "sentence": "Using PPE properly and getting the recommended vaccines and screenings can help decrease the spread of respiratory diseases, protecting the healthcare workers as well as their patients",
                                    "refs": [
                                        "https://www.aana.com/docs/default-source/practice-aana-com-web-documents-(all)/professional-practice-manual/infection-prevention-and-control-guidelines-for-anesthesia-care.pdf?sfvrsn=850049b1_4"
                                    ]
                                }
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "section_title": "Secondary prevention",
                    "section_content": [
                        {
                            "sentence": "Secondary prevention deals with latent diseases and attempts to prevent an asymptomatic disease from progressing to symptomatic disease",
                            "refs": []
                        },
                        {
                            "sentence": "Certain diseases can be classified as primary or secondary",
                            "refs": [
                                "https://web.archive.org/web/20100827091640/http://www.iom.edu/~/media/Files/Activity%20Files/Quality/IntegrativeMed/Preventive%20Medicine%20Integrative%20Medicine%20and%20the%20Health%20of%20the%20Public.pdf"
                            ]
                        },
                        {
                            "sentence": "This depends on definitions of what constitutes a disease, though, in general, primary prevention addresses the root cause of a disease or injury  whereas secondary prevention aims to detect and treat a disease early on",
                            "refs": [
                                "https://web.archive.org/web/20100827091640/http://www.iom.edu/~/media/Files/Activity%20Files/Quality/IntegrativeMed/Preventive%20Medicine%20Integrative%20Medicine%20and%20the%20Health%20of%20the%20Public.pdf"
                            ]
                        },
                        {
                            "sentence": "Secondary prevention consists of \"early diagnosis and prompt treatment\" to contain the disease and prevent its spread to other individuals, and \"disability limitation\" to prevent potential future complications and disabilities from the disease",
                            "refs": [
                                "https://web.archive.org/web/20120222170737/https://www.cdc.gov/excite/skincancer/mod13.htm"
                            ]
                        },
                        {
                            "sentence": "Early diagnosis and prompt treatment for a syphilis patient would include a course of antibiotics to destroy the pathogen and screening and treatment of any infants born to syphilitic mothers",
                            "refs": [
                                "[ERROR retrieving ref link]"
                            ]
                        },
                        {
                            "sentence": "Disability limitation for syphilitic patients includes continued check-ups on the heart, cerebrospinal fluid, and central nervous system of patients to curb any damaging effects such as blindness or paralysis",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Tertiary prevention",
                    "section_content": [
                        {
                            "sentence": "Finally, tertiary prevention attempts to reduce the damage caused by symptomatic disease by focusing on mental, physical, and social rehabilitation",
                            "refs": []
                        },
                        {
                            "sentence": "Unlike secondary prevention, which aims to prevent disability, the objective of tertiary prevention is to maximize the remaining capabilities and functions of an already disabled patient",
                            "refs": []
                        },
                        {
                            "sentence": "Goals of tertiary prevention include: preventing pain and damage, halting progression and complications from disease, and restoring the health and functions of the individuals affected by disease",
                            "refs": [
                                "[ERROR retrieving ref link]"
                            ]
                        },
                        {
                            "sentence": "For syphilitic patients, rehabilitation includes measures to prevent complete disability from the disease, such as implementing work-place adjustments for the blind and paralyzed or providing counseling to restore normal daily functions to the greatest extent possible",
                            "refs": [
                                "https://web.archive.org/web/20120222170737/https://www.cdc.gov/excite/skincancer/mod13.htm"
                            ]
                        },
                        {
                            "sentence": "The general use of machinery that has adequate ventilation and airflow is suggested for these patients in order to halt progression and complications of disease",
                            "refs": []
                        },
                        {
                            "sentence": "A study conducted in nursing homes to prevent diseases concluded that the use of evaporative humidifiers to maintain the indoor humidity within the range 40–60% can reduce respiratory risk",
                            "refs": []
                        },
                        {
                            "sentence": "Certain diseases thrive in different humidities, so the use of the humidifiers can help kill the particles of diseases",
                            "refs": []
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Leading causes of preventable death",
            "section_content": [],
            "subsections": [
                {
                    "section_title": "United States",
                    "section_content": [
                        {
                            "sentence": "The leading preventable cause of death in the United States is tobacco; however, poor diet and lack of exercise may soon surpass tobacco as a leading cause of death",
                            "refs": []
                        },
                        {
                            "sentence": "These behaviors are modifiable and public health and prevention efforts could make a difference to reduce these deaths",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Worldwide",
                    "section_content": [
                        {
                            "sentence": "The leading causes of preventable death worldwide share similar trends to the United States",
                            "refs": []
                        },
                        {
                            "sentence": "There are a few differences between the two, such as malnutrition, pollution, and unsafe sanitation, that reflect health disparities between the developing and developed world",
                            "refs": []
                        },
                        {
                            "sentence": "However, several of the leading causes of death – or underlying contributors to earlier death – may not be included as \"preventable\" causes of death",
                            "refs": []
                        },
                        {
                            "sentence": "A study concluded that pollution was \"responsible for approximately 9 million deaths per year\" in 2019",
                            "refs": []
                        },
                        {
                            "sentence": "And another study concluded that the global mean loss of life expectancy (a measure similar to years of potential life lost) from air pollution in 2015 was 2.9 years, substantially more than, for example, 0.3 years from all forms of direct violence, albeit a significant fraction of the LLE is considered to be unavoidable (such as pollution from some natural wildfires)",
                            "refs": [
                                "https://doi.org/10.1016%2FS2542-5196%2822%2900090-0"
                            ]
                        },
                        {
                            "sentence": "A landmark study conducted by the World Health Organization and the International Labour Organization found that exposure to long working hours is the occupational risk factor with the largest attributable burden of disease, i.e",
                            "refs": []
                        },
                        {
                            "sentence": "an estimated 745,000 fatalities from ischemic heart disease and stroke events in 2016",
                            "refs": []
                        },
                        {
                            "sentence": "With this study, prevention of exposure to long working hours has emerged as a priority for prevention healthcare in workplace settings",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8204267"
                            ]
                        },
                        {
                            "sentence": "[citation needed]",
                            "refs": []
                        }
                    ],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Child mortality",
            "section_content": [
                {
                    "sentence": "In 2010, 7.6 million children died before reaching the age of 5",
                    "refs": []
                },
                {
                    "sentence": "While this is a decrease from 9.6 million in 2000,  it was still far from the fourth Millennium Development Goal to decrease child mortality by two-thirds by 2015",
                    "refs": [
                        "https://doi.org/10.1016%2Fs0140-6736%2812%2960560-1"
                    ]
                },
                {
                    "sentence": "Of these deaths, about 64% were due to infection including diarrhea, pneumonia, and malaria",
                    "refs": [
                        "[ERROR retrieving ref link]"
                    ]
                },
                {
                    "sentence": "About 40% of these deaths occurred in neonates (children ages 1–28 days) due to pre-term birth complications",
                    "refs": [
                        "https://doi.org/10.1016%2Fs0140-6736%2812%2960560-1"
                    ]
                },
                {
                    "sentence": "The highest number of child deaths occurred in Africa and Southeast Asia",
                    "refs": [
                        "[ERROR retrieving ref link]"
                    ]
                },
                {
                    "sentence": "As of 2015 in Africa, almost no progress has been made in reducing neonatal death since 1990",
                    "refs": [
                        "https://doi.org/10.1016%2Fs0140-6736%2812%2960560-1"
                    ]
                },
                {
                    "sentence": "In 2010, India, Nigeria, Democratic Republic of the Congo, Pakistan, and China contributed to almost 50% of global child deaths",
                    "refs": [
                        "[ERROR retrieving ref link]"
                    ]
                },
                {
                    "sentence": "Targeting efforts in these countries is essential to reducing the global child death rate",
                    "refs": []
                },
                {
                    "sentence": "Child mortality is caused by factors including poverty, environmental hazards, and lack of maternal education",
                    "refs": []
                },
                {
                    "sentence": "In 2003, the World Health Organization created a list of interventions in the following table that were judged economically and operationally \"feasible,\" based on the healthcare resources and infrastructure in 42 nations that contribute to 90% of all infant and child deaths",
                    "refs": [
                        "https://doi.org/10.1016%2Fs0140-6736%2803%2913811-1"
                    ]
                },
                {
                    "sentence": "The table indicates how many infant and child deaths could have been prevented in 2000, assuming universal healthcare coverage",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "Preventive methods",
            "section_content": [],
            "subsections": [
                {
                    "section_title": "Obesity",
                    "section_content": [
                        {
                            "sentence": "Policies that address the obesity epidemic should be proactive and far-reaching, including a variety of stakeholders both in healthcare and in other sectors",
                            "refs": []
                        },
                        {
                            "sentence": "Recommendations from the Institute of Medicine in 2012 suggest that \"concerted action be taken across and within five environments (physical activity (PA), food and beverage, marketing and messaging, healthcare and worksites, and schools) and all sectors of society (including government, business and industry, schools, child care, urban planning, recreation, transportation, media, public health, agriculture, communities, and home) in order for obesity prevention efforts to truly be successful.\"",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3916087"
                            ]
                        },
                        {
                            "sentence": "There are dozens of current policies acting at either (or all of) the federal, state, local and school levels",
                            "refs": []
                        },
                        {
                            "sentence": "Most states employ a physical education requirement of 150 minutes of physical education per week at school, a policy of the National Association of Sport and Physical Education",
                            "refs": []
                        },
                        {
                            "sentence": "In some cities, including Philadelphia, a sugary food tax is employed",
                            "refs": []
                        },
                        {
                            "sentence": "This is a part of an amendment to Title 19 of the Philadelphia Code, \"Finance, Taxes and Collections\", Chapter 19-4100, Sugar-Sweetened Beverage Tax that was approved 2016, which establishes an excise tax of $0.015 per fluid ounce on distributors of beverages sweetened with both caloric and non-caloric sweeteners",
                            "refs": []
                        },
                        {
                            "sentence": "Distributors are required to file a return with the department, and the department can collect taxes, among other responsibilities",
                            "refs": [
                                "https://beta.phila.gov/media/20170209150802/CertifiedCopy16017601-1.pdf"
                            ]
                        },
                        {
                            "sentence": "These policies can be a source of tax credits",
                            "refs": []
                        },
                        {
                            "sentence": "Under the Philadelphia policy, businesses can apply for tax credits with the revenue department on a first-come, first-served basis",
                            "refs": []
                        },
                        {
                            "sentence": "This applies until the total amount of credits for a particular year reaches one million dollars",
                            "refs": []
                        },
                        {
                            "sentence": "Recently, advertisements for food and beverages directed at children have received much attention",
                            "refs": []
                        },
                        {
                            "sentence": "The Children's Food and Beverage Advertising Initiative (CFBAI) is a self-regulatory program of the food industry",
                            "refs": []
                        },
                        {
                            "sentence": "Each participating company makes a public pledge that details its commitment to advertise only foods that meet certain nutritional criteria to children under 12 years old",
                            "refs": []
                        },
                        {
                            "sentence": "This is a self-regulated program with policies written by the Council of Better Business Bureaus",
                            "refs": [
                                "https://bbbprograms.org/programs/all-programs/cfbai"
                            ]
                        },
                        {
                            "sentence": "The Robert Wood Johnson Foundation funded research to test the efficacy of the CFBAI",
                            "refs": []
                        },
                        {
                            "sentence": "The results showed progress in terms of decreased advertising of food products that target children and adolescents",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Sexually transmitted infections",
                    "section_content": [
                        {
                            "sentence": "Sexually transmitted infections (STIs), such as syphilis and HIV, are common but preventable with safe-sex practices",
                            "refs": []
                        },
                        {
                            "sentence": "STIs can be asymptomatic, or cause a range of symptoms",
                            "refs": []
                        },
                        {
                            "sentence": "Preventive measures for STIs are called prophylactics",
                            "refs": []
                        },
                        {
                            "sentence": "The term especially applies to the use of condoms,  which are highly effective at preventing disease,  but also to other devices meant to prevent STIs,  such as dental dams and latex gloves",
                            "refs": [
                                "https://www.merriam-webster.com/dictionary/prophylactic",
                                "https://www.cdc.gov/std/stats13/syphilis.htm",
                                "https://www.merriam-webster.com/dictionary/prophylactic"
                            ]
                        },
                        {
                            "sentence": "Other means for preventing STIs include education on how to use condoms or other such barrier devices, testing partners before having unprotected sex, receiving regular STI screenings, to both receive treatment and prevent spreading STIs to partners, and, specifically for HIV, regularly taking prophylactic antiretroviral drugs, such as Truvada",
                            "refs": []
                        },
                        {
                            "sentence": "Post-exposure prophylaxis, started within 72 hours (optimally less than 1 hour) after exposure to high-risk fluids, can also protect against HIV transmission",
                            "refs": []
                        },
                        {
                            "sentence": "[citation needed]",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Malaria prevention using genetic modification",
                    "section_content": [
                        {
                            "sentence": "Genetically modified mosquitoes are being used in developing countries to control malaria",
                            "refs": []
                        },
                        {
                            "sentence": "This approach has been subject to objections and controversy",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Thrombosis",
                    "section_content": [
                        {
                            "sentence": "Thrombosis is a serious circulatory disease affecting thousands, usually older persons undergoing surgical procedures, women taking oral contraceptives and travelers",
                            "refs": []
                        },
                        {
                            "sentence": "The consequences of thrombosis can be heart attacks and strokes",
                            "refs": []
                        },
                        {
                            "sentence": "Prevention can include exercise, anti-embolism stockings, pneumatic devices, and pharmacological treatments",
                            "refs": []
                        },
                        {
                            "sentence": "[citation needed]",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Cancer",
                    "section_content": [
                        {
                            "sentence": "In recent years [when?], cancer has become a global problem",
                            "refs": []
                        },
                        {
                            "sentence": "Low and middle income countries share a majority of the cancer burden largely due to exposure to carcinogens resulting from industrialization and globalization",
                            "refs": []
                        },
                        {
                            "sentence": "However, primary prevention of cancer and knowledge of cancer risk factors can reduce over one third of all cancer cases",
                            "refs": [
                                "https://doi.org/10.1016%2Fs0140-6736%2813%2962224-2"
                            ]
                        },
                        {
                            "sentence": "Primary prevention of cancer can also prevent other diseases, both communicable and non-communicable, that share common risk factors with cancer",
                            "refs": []
                        }
                    ],
                    "subsections": [
                        {
                            "section_title": "Lung cancer",
                            "section_content": [
                                {
                                    "sentence": "Lung cancer is the leading cause of cancer-related deaths in the United States and Europe and is a major cause of death in other countries",
                                    "refs": []
                                },
                                {
                                    "sentence": "Tobacco is an environmental carcinogen and the major underlying cause of lung cancer",
                                    "refs": [
                                        "https://doi.org/10.1016%2Fs1040-8428%2899%2900074-8"
                                    ]
                                },
                                {
                                    "sentence": "Between 25% and 40% of all cancer deaths and about 90% of lung cancer cases are associated with tobacco use",
                                    "refs": [
                                        "https://doi.org/10.1016%2Fs1040-8428%2899%2900074-8"
                                    ]
                                },
                                {
                                    "sentence": "Other carcinogens include asbestos and radioactive materials",
                                    "refs": []
                                },
                                {
                                    "sentence": "Both smoking and second-hand exposure from other smokers can lead to lung cancer and eventually death",
                                    "refs": [
                                        "https://doi.org/10.1016%2FS0749-2081%2896%2980024-6"
                                    ]
                                },
                                {
                                    "sentence": "Prevention of tobacco use is paramount to prevention of lung cancer",
                                    "refs": []
                                },
                                {
                                    "sentence": "Individual, community, and statewide interventions can prevent or cease tobacco use",
                                    "refs": []
                                },
                                {
                                    "sentence": "90% of adults in the U.S",
                                    "refs": []
                                },
                                {
                                    "sentence": "who have ever smoked did so prior to the age of 20",
                                    "refs": []
                                },
                                {
                                    "sentence": "In-school prevention/educational programs, as well as counseling resources, can help prevent and cease adolescent smoking",
                                    "refs": []
                                },
                                {
                                    "sentence": "Other cessation techniques include group support programs, nicotine replacement therapy (NRT), hypnosis, and self-motivated behavioral change",
                                    "refs": [
                                        "https://doi.org/10.1016%2FS0749-2081%2896%2980024-6"
                                    ]
                                },
                                {
                                    "sentence": "Studies have shown long term success rates (>1 year) of 20% for hypnosis and 10%-20% for group therapy",
                                    "refs": []
                                },
                                {
                                    "sentence": "Cancer screening programs serve as effective sources of secondary prevention",
                                    "refs": []
                                },
                                {
                                    "sentence": "The Mayo Clinic, Johns Hopkins, and Memorial Sloan-Kettering hospitals conducted annual x-ray screenings and sputum cytology tests and found that lung cancer was detected at higher rates, earlier stages, and had more favorable treatment outcomes, which supports widespread investment in such programs",
                                    "refs": []
                                },
                                {
                                    "sentence": "Legislation can also affect smoking prevention and cessation",
                                    "refs": []
                                },
                                {
                                    "sentence": "In 1992, Massachusetts (United States) voters passed a bill adding an extra 25 cent tax to each pack of cigarettes, despite intense lobbying and $7.3 million spent by the tobacco industry to oppose this bill",
                                    "refs": []
                                },
                                {
                                    "sentence": "Tax revenue goes toward tobacco education and control programs and has led to a decline of tobacco use in the state",
                                    "refs": []
                                },
                                {
                                    "sentence": "Lung cancer and tobacco smoking are increasing worldwide, especially in China",
                                    "refs": []
                                },
                                {
                                    "sentence": "China is responsible for about one-third of the global consumption and production of tobacco products",
                                    "refs": []
                                },
                                {
                                    "sentence": "Tobacco control policies have been ineffective as China is home to 350 million regular smokers and 750 million passive smokers and the annual death toll is over 1 million",
                                    "refs": [
                                        "https://doi.org/10.1111%2Fj.1440-1843.2011.02062.x"
                                    ]
                                },
                                {
                                    "sentence": "Recommended actions to reduce tobacco use include decreasing tobacco supply, increasing tobacco taxes, widespread educational campaigns, decreasing advertising from the tobacco industry, and increasing tobacco cessation support resources",
                                    "refs": [
                                        "https://doi.org/10.1111%2Fj.1440-1843.2011.02062.x"
                                    ]
                                },
                                {
                                    "sentence": "In Wuhan, China, a 1998 school-based program implemented an anti-tobacco curriculum for adolescents and reduced the number of regular smokers, though it did not significantly decrease the number of adolescents who initiated smoking",
                                    "refs": [
                                        "https://doi.org/10.1111%2Fj.1440-1843.2011.02062.x"
                                    ]
                                },
                                {
                                    "sentence": "This program was therefore effective in secondary but not primary prevention and shows that school-based programs have the potential to reduce tobacco use",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Skin cancer",
                            "section_content": [
                                {
                                    "sentence": "Skin cancer is the most common cancer in the United States",
                                    "refs": []
                                },
                                {
                                    "sentence": "The most lethal form of skin cancer, melanoma, leads to over 50,000 annual deaths in the United States",
                                    "refs": [
                                        "[ERROR retrieving ref link]"
                                    ]
                                },
                                {
                                    "sentence": "Childhood prevention is particularly important because a significant portion of ultraviolet radiation exposure from the sun occurs during childhood and adolescence and can subsequently lead to skin cancer in adulthood",
                                    "refs": [
                                        "[ERROR retrieving ref link]"
                                    ]
                                },
                                {
                                    "sentence": "Furthermore, childhood prevention can lead to the development of healthy habits that continue to prevent cancer for a lifetime",
                                    "refs": []
                                },
                                {
                                    "sentence": "The Centers for Disease Control and Prevention (CDC) recommends several primary prevention methods including: limiting sun exposure between 10 AM and 4 PM, when the sun is strongest, wearing tighter-weave natural cotton clothing, wide-brim hats, and sunglasses as protective covers, using sunscreens that protect against both UV-A and UV-B rays, and avoiding tanning salons",
                                    "refs": []
                                },
                                {
                                    "sentence": "Sunscreen should be reapplied after sweating, exposure to water (through swimming for example) or after several hours of sun exposure",
                                    "refs": [
                                        "[ERROR retrieving ref link]"
                                    ]
                                },
                                {
                                    "sentence": "Since skin cancer is very preventable, the CDC recommends school-level prevention programs including preventive curricula, family involvement, participation and support from the school's health services, and partnership with community, state, and national agencies and organizations to keep children away from excessive UV radiation exposure",
                                    "refs": [
                                        "[ERROR retrieving ref link]"
                                    ]
                                },
                                {
                                    "sentence": "Most skin cancer and sun protection data comes from Australia and the United States",
                                    "refs": []
                                },
                                {
                                    "sentence": "An international study reported that Australians tended to demonstrate higher knowledge of sun protection and skin cancer knowledge, compared to other countries",
                                    "refs": [
                                        "https://doi.org/10.1093%2Fheapro%2Fdah310"
                                    ]
                                },
                                {
                                    "sentence": "Of children, adolescents, and adults, sunscreen was the most commonly used skin protection",
                                    "refs": [
                                        "https://doi.org/10.1093%2Fheapro%2Fdah310"
                                    ]
                                },
                                {
                                    "sentence": "However, many adolescents purposely used sunscreen with a low sun protection factor (SPF) in order to get a tan",
                                    "refs": []
                                },
                                {
                                    "sentence": "Various Australian studies have shown that many adults failed to use sunscreen correctly; many applied sunscreen well after their initial sun exposure and/or failed to reapply when necessary",
                                    "refs": [
                                        "https://doi.org/10.1093%2Fheapro%2Fdah310"
                                    ]
                                },
                                {
                                    "sentence": "A 2002 case-control study in Brazil showed that only 3% of case participants and 11% of control participants used sunscreen with SPF >15",
                                    "refs": [
                                        "https://doi.org/10.5694%2Fj.1326-5377.1991.tb121157.x",
                                        "https://doi.org/10.1111%2Fj.1440-0960.1991.tb00676.x",
                                        "https://doi.org/10.1016%2F0091-7435%2892%2990072-p"
                                    ]
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Cervical cancer",
                            "section_content": [
                                {
                                    "sentence": "Cervical cancer ranks among the top three most common cancers among women in Latin America, sub-Saharan Africa, and parts of Asia",
                                    "refs": []
                                },
                                {
                                    "sentence": "Cervical cytology screening aims to detect abnormal lesions in the cervix so that women can undergo treatment prior to the development of cancer",
                                    "refs": []
                                },
                                {
                                    "sentence": "Given that high quality screening and follow-up care has been shown to reduce cervical cancer rates by up to 80%, most developed countries now encourage sexually active women to undergo a Pap test every 3–5 years",
                                    "refs": []
                                },
                                {
                                    "sentence": "Finland and Iceland have developed effective organized programs with routine monitoring and have managed to significantly reduce cervical cancer mortality while using fewer resources than unorganized, opportunistic programs such as those in the United States or Canada",
                                    "refs": []
                                },
                                {
                                    "sentence": "In developing nations in Latin America, such as Chile, Colombia, Costa Rica, and Cuba, both public and privately organized programs have offered women routine cytological screening since the 1970s",
                                    "refs": []
                                },
                                {
                                    "sentence": "However, these efforts have not resulted in a significant change in cervical cancer incidence or mortality in these nations",
                                    "refs": []
                                },
                                {
                                    "sentence": "This is likely due to low quality, inefficient testing",
                                    "refs": []
                                },
                                {
                                    "sentence": "However, Puerto Rico, which has offered early screening since the 1960s, has witnessed almost a 50% decline in cervical cancer incidence and almost a four-fold decrease in mortality between 1950 and 1990",
                                    "refs": []
                                },
                                {
                                    "sentence": "Brazil, Peru, India, and several high-risk nations in sub-Saharan Africa which lack organized screening programs, have a high incidence of cervical cancer",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Colorectal cancer",
                            "section_content": [
                                {
                                    "sentence": "Colorectal cancer is globally the second most common cancer in women and the third-most common in men,  and the fourth most common cause of cancer death after lung, stomach, and liver cancer,  having caused 715,000 deaths in 2010",
                                    "refs": [
                                        "ISBN: 978-92-832-0432-9",
                                        "https://www.who.int/mediacentre/factsheets/fs297/en/"
                                    ]
                                },
                                {
                                    "sentence": "It is also highly preventable; about 80 percent  of colorectal cancers begin as benign growths, commonly called polyps, which can be easily detected and removed during a colonoscopy",
                                    "refs": [
                                        "http://www.clevelandclinicmeded.com/medicalpubs/diseasemanagement/gastroenterology/colorectal-neoplasia/"
                                    ]
                                },
                                {
                                    "sentence": "Other methods of screening for polyps and cancers include fecal occult blood testing",
                                    "refs": []
                                },
                                {
                                    "sentence": "Lifestyle changes that may reduce the risk of colorectal cancer include increasing consumption of whole grains, fruits and vegetables, and reducing consumption of red meat",
                                    "refs": []
                                },
                                {
                                    "sentence": "[citation needed]",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "section_title": "Dementia",
                    "section_content": [],
                    "subsections": []
                }
            ]
        },
        {
            "section_title": "Health disparities and barriers to accessing care",
            "section_content": [
                {
                    "sentence": "Access to healthcare and preventive health services is unequal, as is the quality of care received",
                    "refs": []
                },
                {
                    "sentence": "A study conducted by the Agency for Healthcare Research and Quality (AHRQ) revealed health disparities in the United States",
                    "refs": []
                },
                {
                    "sentence": "In the United States, elderly adults (>65 years old) received worse care and had less access to care than their younger counterparts",
                    "refs": []
                },
                {
                    "sentence": "The same trends are seen when comparing all racial minorities (black, Hispanic, Asian) to white patients, and low-income people to high-income people",
                    "refs": []
                },
                {
                    "sentence": "Common barriers to accessing and utilizing healthcare resources included lack of income and education, language barriers, and lack of health insurance",
                    "refs": [
                        "https://www.ahrq.gov/qual/nhqrdr11/nhqrdrminority11.htm"
                    ]
                },
                {
                    "sentence": "Minorities were less likely than whites to possess health insurance, as were individuals who completed less education",
                    "refs": []
                },
                {
                    "sentence": "These disparities made it more difficult for the disadvantaged groups to have regular access to a primary care provider, receive immunizations, or receive other types of medical care",
                    "refs": []
                },
                {
                    "sentence": "Additionally, uninsured people tend to not seek care until their diseases progress to chronic and serious states and they are also more likely to forgo necessary tests, treatments, and filling prescription medications",
                    "refs": [
                        "https://www.ahrq.gov/qual/nhqrdr11/nhqrdrminority11.htm"
                    ]
                },
                {
                    "sentence": "These sorts of disparities and barriers exist worldwide as well",
                    "refs": []
                },
                {
                    "sentence": "Often, there are decades of gaps in life expectancy between developing and developed countries",
                    "refs": []
                },
                {
                    "sentence": "For example, Japan has an average life expectancy that is 36 years greater than that in Malawi",
                    "refs": []
                },
                {
                    "sentence": "Low-income countries also tend to have fewer physicians than high-income countries",
                    "refs": [
                        "https://web.archive.org/web/20111109005506/http://www.who.int/sdhconference/background/news/facts/en/"
                    ]
                },
                {
                    "sentence": "In Nigeria and Myanmar, there are fewer than 4 physicians per 100,000 people while Norway and Switzerland have a ratio that is ten-fold higher",
                    "refs": []
                },
                {
                    "sentence": "Common barriers worldwide include lack of availability of health services and healthcare providers in the region, great physical distance between the home and health service facilities, high transportation costs, high treatment costs, and social norms and stigma toward accessing certain health services",
                    "refs": [
                        "https://web.archive.org/web/20111109005506/http://www.who.int/sdhconference/background/news/facts/en/"
                    ]
                }
            ],
            "subsections": []
        },
        {
            "section_title": "Economics of lifestyle-based prevention",
            "section_content": [
                {
                    "sentence": "With lifestyle factors such as diet and exercise rising to the top of preventable death statistics, the economics of healthy lifestyle is a growing concern",
                    "refs": []
                },
                {
                    "sentence": "There is little question that positive lifestyle choices provide an investment in health throughout life",
                    "refs": []
                },
                {
                    "sentence": "To gauge success, traditional measures such as the quality years of life method (QALY), show great value",
                    "refs": [
                        "https://www.ncbi.nlm.nih.gov/books/NBK53914/"
                    ]
                },
                {
                    "sentence": "However, that method does not account for the cost of chronic conditions or future lost earnings because of poor health",
                    "refs": [
                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5746244"
                    ]
                },
                {
                    "sentence": "Developing future economic models that would guide both private and public investments as well as drive future policy to evaluate the efficacy of positive lifestyle choices on health is a major topic for economists globally",
                    "refs": []
                },
                {
                    "sentence": "Americans spend over three trillion a year on health care but have a higher rate of infant mortality, shorter life expectancies, and a higher rate of diabetes than other high-income nations because of negative lifestyle choices",
                    "refs": []
                },
                {
                    "sentence": "Despite these large costs, very little is spent on prevention for lifestyle-caused conditions in comparison",
                    "refs": [
                        "https://web.archive.org/web/20150528205913/http://www.usnews.com/opinion/blogs/policy-dose/2015/05/28/focus-on-prevention-to-cut-us-health-care-costs"
                    ]
                },
                {
                    "sentence": "In 2016, the Journal of the American Medical Association estimated that $101 billion was spent in 2013 on the preventable disease of diabetes, and another $88 billion was spent on heart disease",
                    "refs": []
                },
                {
                    "sentence": "In an effort to encourage healthy lifestyle choices, as of 2010 workplace wellness programs were on the rise but the economics and effectiveness data were continuing to evolve and develop",
                    "refs": [
                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5551483"
                    ]
                },
                {
                    "sentence": "Health insurance coverage impacts lifestyle choices, even intermittent loss of coverage had negative effects on healthy choices in the U.S",
                    "refs": []
                },
                {
                    "sentence": "The repeal of the Affordable Care Act (ACA) could significantly impact coverage for many Americans as well as \"The Prevention and Public Health Fund\" which is the U.S",
                    "refs": [
                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1447707"
                    ]
                },
                {
                    "sentence": "first and only mandatory funding stream dedicated to improving public health  including counseling on lifestyle prevention issues, such as weight management, alcohol use, and treatment for depression",
                    "refs": [
                        "https://www.apha.org/~/media/files/pdf/factsheets/170125_pphf.ashx"
                    ]
                },
                {
                    "sentence": "Because in the U.S",
                    "refs": []
                },
                {
                    "sentence": "chronic illnesses predominate as a cause of death and pathways for treating chronic illnesses are complex and multifaceted, prevention is a best practice approach to chronic disease when possible",
                    "refs": []
                },
                {
                    "sentence": "In many cases, prevention requires mapping complex pathways  to determine the ideal point for intervention",
                    "refs": [
                        "http://www.childsworld.ca.gov/res/pdf/Pathway.pdf"
                    ]
                },
                {
                    "sentence": "Cost-effectiveness of prevention is achievable, but impacted by the length of time it takes to see effects/outcomes of intervention",
                    "refs": []
                },
                {
                    "sentence": "This makes prevention efforts difficult to fund—particularly in strained financial contexts",
                    "refs": []
                },
                {
                    "sentence": "Prevention potentially creates other costs as well, due to extending the lifespan and thereby increasing opportunities for illness",
                    "refs": []
                },
                {
                    "sentence": "In order to assess the cost-effectiveness of prevention, the cost of the preventive measure, savings from avoiding morbidity, and the cost from extending the lifespan need to be considered",
                    "refs": []
                },
                {
                    "sentence": "Life extension costs become smaller when accounting for savings from postponing the last year of life,  which makes up a large fraction of lifetime medical expenditures  and becomes cheaper with age",
                    "refs": [
                        "https://doi.org/10.1002%2Fhec.1370",
                        "https://doi.org/10.1016%2Fj.jhealeco.2004.11.009",
                        "http://www.nber.org/papers/w1269.pdf"
                    ]
                },
                {
                    "sentence": "Prevention leads to savings only if the cost of the preventive measure is less than the savings from avoiding morbidity net of the cost of extending the life span",
                    "refs": [
                        "https://doi.org/10.1093%2Fgeronb%2F58.1.S2"
                    ]
                },
                {
                    "sentence": "In order to establish reliable economics of prevention for illnesses that are complicated in origin, knowing how best to assess prevention efforts, i.e",
                    "refs": []
                },
                {
                    "sentence": "developing useful measures and appropriate scope, is required",
                    "refs": []
                }
            ],
            "subsections": []
        },
        {
            "section_title": "Effectiveness",
            "section_content": [
                {
                    "sentence": "There is no general consensus as to whether or not preventive healthcare measures are cost-effective, [according to whom?] but they increase the quality of life dramatically",
                    "refs": []
                },
                {
                    "sentence": "There are varying views on what constitutes a \"good investment.\" Some argue that preventive health measures should save more money than they cost, when factoring in treatment costs in the absence of such measures",
                    "refs": []
                },
                {
                    "sentence": "Others have argued in favor of \"good value\" or conferring significant health benefits even if the measures do not save money",
                    "refs": [
                        "https://doi.org/10.1377%2Fhlthaff.2008.0701"
                    ]
                },
                {
                    "sentence": "Furthermore, preventive health services are often described as one entity though they comprise a myriad of different services, each of which can individually lead to net costs, savings, or neither",
                    "refs": [
                        "https://doi.org/10.1056%2Fnejm199307293290511"
                    ]
                },
                {
                    "sentence": "Greater differentiation of these services is necessary to fully understand both the financial and health effects",
                    "refs": []
                },
                {
                    "sentence": "A 2010 study reported that in the United States, vaccinating children, cessation of smoking, daily prophylactic use of aspirin, and screening of breast and colorectal cancers had the most potential to prevent premature death",
                    "refs": []
                },
                {
                    "sentence": "Preventive health measures that resulted in savings included vaccinating children and adults, smoking cessation, daily use of aspirin, and screening for issues with alcoholism, obesity, and vision failure",
                    "refs": [
                        "https://doi.org/10.1377%2Fhlthaff.2008.0701"
                    ]
                },
                {
                    "sentence": "These authors estimated that if usage of these services in the United States increased to 90% of the population, there would be net savings of $3.7 billion, which comprised only about -0.2% of the total 2006 United States healthcare expenditure",
                    "refs": [
                        "https://doi.org/10.1377%2Fhlthaff.2008.0701"
                    ]
                },
                {
                    "sentence": "Despite the potential for decreasing healthcare spending, utilization of healthcare resources in the United States still remains low, especially among Latinos and African-Americans",
                    "refs": [
                        "https://doi.org/10.1377%2Fhlthaff.2008.0701"
                    ]
                },
                {
                    "sentence": "Overall, preventive services are difficult to implement because healthcare providers have limited time with patients and must integrate a variety of preventive health measures from different sources",
                    "refs": [
                        "https://doi.org/10.1016%2Fj.amepre.2006.03.012"
                    ]
                },
                {
                    "sentence": "While these specific services bring about small net savings, not every preventive health measure saves more than it costs",
                    "refs": []
                },
                {
                    "sentence": "A 1970s study showed that preventing heart attacks by treating hypertension early on with drugs actually did not save money in the long run",
                    "refs": []
                },
                {
                    "sentence": "The money saved by evading treatment from heart attack and stroke only amounted to about a quarter of the cost of the drugs",
                    "refs": []
                },
                {
                    "sentence": "Similarly, it was found that the cost of drugs or dietary changes to decrease high blood cholesterol exceeded the cost of subsequent heart disease treatment",
                    "refs": [
                        "[ERROR retrieving ref link]",
                        "https://ui.adsabs.harvard.edu/abs/1978NYASA.304..424W"
                    ]
                },
                {
                    "sentence": "Due to these findings, some argue that rather than focusing healthcare reform efforts exclusively on preventive care, the interventions that bring about the highest level of health should be prioritized",
                    "refs": [
                        "[ERROR retrieving ref link]",
                        "https://doi.org/10.1001%2Fjama.265.9.1145"
                    ]
                },
                {
                    "sentence": "In 2008, Cohen et al",
                    "refs": []
                },
                {
                    "sentence": "outlined a few arguments made by skeptics of preventive healthcare",
                    "refs": []
                },
                {
                    "sentence": "Many argue that preventive measures only cost less than future treatment when the proportion of the population that would become ill in the absence of prevention is fairly large",
                    "refs": []
                },
                {
                    "sentence": "The Diabetes Prevention Program Research Group conducted a 2012 study evaluating the costs and benefits in quality-adjusted life-years or QALYs of lifestyle changes versus taking the drug metformin",
                    "refs": [
                        "https://doi.org/10.1056%2Fnejmp0708558"
                    ]
                },
                {
                    "sentence": "They found that neither method brought about financial savings, but were cost-effective nonetheless because they brought about an increase in QALYs",
                    "refs": []
                },
                {
                    "sentence": "In addition to scrutinizing costs, preventive healthcare skeptics also examine efficiency of interventions",
                    "refs": [
                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3308273"
                    ]
                },
                {
                    "sentence": "They argue that while many treatments of existing diseases involve use of advanced equipment and technology, in some cases, this is a more efficient use of resources than attempts to prevent the disease",
                    "refs": []
                },
                {
                    "sentence": "Cohen suggested that the preventive measures most worth exploring and investing in are those that could benefit a large portion of the population to bring about cumulative and widespread health benefits at a reasonable cost",
                    "refs": [
                        "https://doi.org/10.1056%2Fnejmp0708558"
                    ]
                }
            ],
            "subsections": [
                {
                    "section_title": "Cost-effectiveness of childhood obesity interventions",
                    "section_content": [
                        {
                            "sentence": "There are at least four nationally implemented childhood obesity interventions in the United States: the Sugar-Sweetened Beverage excise tax (SSB), the TV AD program, active physical education (Active PE) policies, and early care and education (ECE) policies",
                            "refs": []
                        },
                        {
                            "sentence": "They each have similar goals of reducing childhood obesity",
                            "refs": [
                                "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9508900"
                            ]
                        },
                        {
                            "sentence": "The effects of these interventions on BMI have been studied, and the cost-effectiveness analysis (CEA) has led to a better understanding of projected cost reductions and improved health outcomes",
                            "refs": []
                        },
                        {
                            "sentence": "The Childhood Obesity Intervention Cost-Effectiveness Study (CHOICES) was conducted to evaluate and compare the CEA of these four interventions",
                            "refs": [
                                "https://doi.org/10.1016%2Fj.amepre.2015.02.005",
                                "https://doi.org/10.1016%2Fj.amepre.2015.03.016"
                            ]
                        },
                        {
                            "sentence": "Gortmaker, S.L",
                            "refs": []
                        },
                        {
                            "sentence": "et al",
                            "refs": []
                        },
                        {
                            "sentence": "(2015) states: \"The four initial interventions were selected by the investigators to represent a broad range of nationally scalable strategies to reduce childhood obesity using a mix of both policy and programmatic strategies..",
                            "refs": []
                        },
                        {
                            "sentence": "1",
                            "refs": []
                        },
                        {
                            "sentence": "an excise tax of $0.01 per ounce of sweetened beverages, applied nationally and administered at the state level (SSB), 2",
                            "refs": []
                        },
                        {
                            "sentence": "elimination of the tax deductibility of advertising costs of TV advertisements for \"nutritionally poor\" foods and beverages seen by children and adolescents (TV AD), 3",
                            "refs": []
                        },
                        {
                            "sentence": "state policy requiring all public elementary schools in which physical education (PE) is currently provided to devote ≥50% of PE class time to moderate and vigorous physical activity (Active PE), and 4",
                            "refs": []
                        },
                        {
                            "sentence": "state policy to make early child educational settings healthier by increasing physical activity, improving nutrition, and reducing screen time (ECE).\" The CHOICES found that SSB, TV AD, and ECE led to net cost savings",
                            "refs": []
                        },
                        {
                            "sentence": "Both SSB and TV AD increased quality adjusted life years and produced yearly tax revenue of 12.5 billion U.S",
                            "refs": []
                        },
                        {
                            "sentence": "dollars and 80 million U.S",
                            "refs": []
                        },
                        {
                            "sentence": "dollars, respectively",
                            "refs": []
                        },
                        {
                            "sentence": "[citation needed]",
                            "refs": []
                        },
                        {
                            "sentence": "Some challenges with evaluating the effectiveness of child obesity interventions include:",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Economics of U.S. preventive care",
                    "section_content": [
                        {
                            "sentence": "As of 2009, the cost-effectiveness of preventive care is a highly debated topic",
                            "refs": []
                        },
                        {
                            "sentence": "While some economists argue that preventive care is valuable and potentially cost saving, others believe it is an inefficient waste of resources",
                            "refs": []
                        },
                        {
                            "sentence": "Preventive care is composed of a variety of clinical services and programs including annual doctor's check-ups, annual immunizations, and wellness programs; recent models show that these simple interventions can have significant economic impacts",
                            "refs": [
                                "http://www.rwjf.org/content/dam/farm/reports/issue_briefs/2009/rwjf46045/subassets/rwjf46045_1"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Clinical preventive services and programs",
                    "section_content": [
                        {
                            "sentence": "Research on preventive care addresses the question of whether it is cost saving or cost effective and whether there is an economics evidence base for health promotion and disease prevention",
                            "refs": []
                        },
                        {
                            "sentence": "The need for and interest in preventive care is driven by the imperative to reduce health care costs while improving quality of care and the patient experience",
                            "refs": []
                        },
                        {
                            "sentence": "Preventive care can lead to improved health outcomes and cost savings potential",
                            "refs": []
                        },
                        {
                            "sentence": "Services such as health assessments/screenings, prenatal care, and telehealth and telemedicine can reduce morbidity or mortality with low cost or cost savings",
                            "refs": []
                        },
                        {
                            "sentence": "Specifically, health assessments/screenings have cost savings potential, with varied cost-effectiveness based on screening and assessment type",
                            "refs": [
                                "http://eprints.lse.ac.uk/55659/",
                                "https://search.worldcat.org/oclc/973090310"
                            ]
                        },
                        {
                            "sentence": "Inadequate prenatal care can lead to an increased risk of prematurity, stillbirth, and infant death",
                            "refs": [
                                "http://www.econ.jku.at/papers/2012/wp1201.pdf"
                            ]
                        },
                        {
                            "sentence": "Time is the ultimate resource and preventive care can help mitigate the time costs",
                            "refs": [
                                "https://doi.org/10.1055%2Fs-0032-1316439"
                            ]
                        },
                        {
                            "sentence": "Telehealth and telemedicine is one option that has gained consumer interest, acceptance, and confidence and can improve quality of care and patient satisfaction",
                            "refs": [
                                "[ERROR retrieving ref link]"
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Economics for investment",
                    "section_content": [
                        {
                            "sentence": "There are benefits and trade-offs when considering investment in preventive care versus other types of clinical services",
                            "refs": []
                        },
                        {
                            "sentence": "Preventive care can be a good investment as supported by the evidence base and can drive population health management objectives",
                            "refs": []
                        },
                        {
                            "sentence": "The concepts of cost saving and cost-effectiveness are different and both are relevant to preventive care",
                            "refs": [
                                "https://doi.org/10.1056%2Fnejmp0708558",
                                "https://search.worldcat.org/oclc/973090310"
                            ]
                        },
                        {
                            "sentence": "Preventive care that may not save money may still provide health benefits; thus, there is a need to compare interventions relative to impact on health and cost",
                            "refs": []
                        },
                        {
                            "sentence": "Preventive care transcends demographics and is applicable to people of every age",
                            "refs": []
                        },
                        {
                            "sentence": "The Health Capital Theory underpins the importance of preventive care across the lifecycle and provides a framework for understanding the variances in health and health care that are experienced",
                            "refs": []
                        },
                        {
                            "sentence": "It treats health as a stock that provides direct utility",
                            "refs": []
                        },
                        {
                            "sentence": "Health depreciates with age and the aging process can be countered through health investments",
                            "refs": []
                        },
                        {
                            "sentence": "The theory further supports that individuals demand good health, that the demand for health investment is a derived demand (i.e",
                            "refs": []
                        },
                        {
                            "sentence": "investment is health is due to the underlying demand for good health), and the efficiency of the health investment process increases with knowledge (i.e",
                            "refs": []
                        },
                        {
                            "sentence": "it is assumed that the more educated are more efficient consumers and producers of health)",
                            "refs": []
                        },
                        {
                            "sentence": "The prevalence elasticity of demand for prevention can also provide insights into the economics",
                            "refs": []
                        },
                        {
                            "sentence": "Demand for preventive care can alter the prevalence rate of a given disease and further reduce or even reverse any further growth of prevalence",
                            "refs": []
                        },
                        {
                            "sentence": "Reduction in prevalence subsequently leads to reduction in costs",
                            "refs": [
                                "[ERROR retrieving ref link]"
                            ]
                        },
                        {
                            "sentence": "There are a number of organizations and policy actions that are relevant when discussing the economics of preventive care services",
                            "refs": []
                        },
                        {
                            "sentence": "The evidence base, viewpoints, and policy briefs from the Robert Wood Johnson Foundation, the Organisation for Economic Co-operation and Development (OECD), and efforts by the U.S",
                            "refs": []
                        },
                        {
                            "sentence": "Preventive Services Task Force (USPSTF) all provide examples that improve the health and well-being of populations (e.g",
                            "refs": []
                        },
                        {
                            "sentence": "preventive health assessments/screenings, prenatal care, and telehealth/telemedicine)",
                            "refs": []
                        },
                        {
                            "sentence": "The Affordable Care Act (ACA) has major influence on the provision of preventive care services, although it is currently under heavy scrutiny and review by the new administration",
                            "refs": []
                        },
                        {
                            "sentence": "According to the Centers for Disease Control and Prevention (CDC), the ACA makes preventive care affordable and accessible through mandatory coverage of preventive services without a deductible, copayment, coinsurance, or other cost sharing",
                            "refs": []
                        },
                        {
                            "sentence": "The U.S",
                            "refs": []
                        },
                        {
                            "sentence": "Preventive Services Task Force (USPSTF), a panel of national experts in prevention and evidence-based medicine, works to improve health of Americans by making evidence-based recommendations about clinical preventive services",
                            "refs": []
                        },
                        {
                            "sentence": "They do not consider the cost of a preventive service when determining a recommendation",
                            "refs": [
                                "https://www.uspreventiveservicestaskforce.org/uspstf/recommendation-topics/uspstf-and-b-recommendations"
                            ]
                        },
                        {
                            "sentence": "Each year, the organization delivers a report to Congress that identifies critical evidence gaps in research and recommends priority areas for further review",
                            "refs": []
                        },
                        {
                            "sentence": "The National Network of Perinatal Quality Collaboratives (NNPQC), sponsored by the CDC, supports state-based perinatal quality collaboratives (PQCs) in measuring and improving upon health care and health outcomes for mothers and babies",
                            "refs": []
                        },
                        {
                            "sentence": "These PQCs have contributed to improvements such as reduction in deliveries before 39 weeks, reductions in healthcare associated bloodstream infections, and improvements in the utilization of antenatal corticosteroids",
                            "refs": []
                        },
                        {
                            "sentence": "Telehealth and telemedicine has realized significant growth and development recently",
                            "refs": []
                        },
                        {
                            "sentence": "The Center for Connected Health Policy (The National Telehealth Policy Resource Center) has produced multiple reports and policy briefs on the topic of Telehealth and Telemedicine and how they contribute to preventive services",
                            "refs": []
                        },
                        {
                            "sentence": "Policy actions and provision of preventive services do not guarantee utilization",
                            "refs": [
                                "https://web.archive.org/web/20170803200511/http://www.telehealthpolicy.us/reports-and-policy-briefs"
                            ]
                        },
                        {
                            "sentence": "Reimbursement has remained a significant barrier to adoption due to variances in payer and state level reimbursement policies and guidelines through government and commercial payers",
                            "refs": []
                        },
                        {
                            "sentence": "Americans use preventive services at about half the recommended rate and cost-sharing, such as deductibles, co-insurance, or copayments, also reduce the likelihood that preventive services will be used",
                            "refs": []
                        },
                        {
                            "sentence": "Despite the ACA's enhancement of Medicare benefits and preventive services, there were no effects on preventive service utilization, calling out the fact that other fundamental barriers exist",
                            "refs": [
                                "https://web.archive.org/web/20160110135937/https://www.cdc.gov/healthcommunication/toolstemplates/entertainmented/tips/preventivehealth.html"
                            ]
                        }
                    ],
                    "subsections": [
                        {
                            "section_title": "Affordable Care Act and preventive healthcare",
                            "section_content": [
                                {
                                    "sentence": "The Patient Protection and Affordable Care Act, also known as just the Affordable Care Act or Obamacare, was passed and became law in the United States on March 23, 2010",
                                    "refs": []
                                },
                                {
                                    "sentence": "The finalized and newly ratified law was to address many issues in the U.S",
                                    "refs": [
                                        "https://doi.org/10.1097%2Fmlr.0b013e3181f28be4"
                                    ]
                                },
                                {
                                    "sentence": "healthcare system, which included expansion of coverage, insurance market reforms, better quality, and the forecast of efficiency and costs",
                                    "refs": []
                                },
                                {
                                    "sentence": "Under the insurance market reforms the act required that insurance companies no longer exclude people with pre-existing conditions, allow for children to be covered on their parents' plan until the age of 26, and expand appeals that dealt with reimbursement denials",
                                    "refs": [
                                        "https://doi.org/10.1111%2Fj.1539-6975.2010.01371.x"
                                    ]
                                },
                                {
                                    "sentence": "The Affordable Care Act also banned the limited coverage imposed by health insurances, and insurance companies were to include coverage for preventive health care services",
                                    "refs": []
                                },
                                {
                                    "sentence": "The U.S",
                                    "refs": [
                                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3001814"
                                    ]
                                },
                                {
                                    "sentence": "Preventive Services Task Force has categorized and rated preventive health services as either A or B, as to which insurance companies must comply and present full coverage",
                                    "refs": []
                                },
                                {
                                    "sentence": "Not only has the U.S",
                                    "refs": []
                                },
                                {
                                    "sentence": "Preventive Services Task Force provided graded preventive health services that are appropriate for coverage, they have also provided many recommendations to clinicians and insurers to promote better preventive care to ultimately provide better quality of care and lower the burden of costs",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        }
                    ]
                },
                {
                    "section_title": "Health insurance",
                    "section_content": [
                        {
                            "sentence": "Healthcare insurance companies are willing to pay for preventive care despite the fact that patients are not acutely sick in hope that it will prevent them from developing a chronic disease later on in life",
                            "refs": []
                        },
                        {
                            "sentence": "Today, health insurance plans offered through the Marketplace, mandated by the Affordable Care Act are required to provide certain preventive care services free of charge to patients",
                            "refs": [
                                "[ERROR retrieving ref link]"
                            ]
                        },
                        {
                            "sentence": "Section 2713 of the Affordable Care Act,  specifies that all private Marketplace and all employer-sponsored private plans (except those grandfathered in) are required to cover preventive care services that are ranked A or B by the U.S",
                            "refs": [
                                "https://www.cms.gov/CCIIO/Resources/Fact-Sheets-and-FAQs/aca_implementation_faqs12"
                            ]
                        },
                        {
                            "sentence": "Preventive Services Task Force free of charge to patients",
                            "refs": []
                        },
                        {
                            "sentence": "UnitedHealthcare insurance company has published patient guidelines at the beginning of the year explaining their preventive care coverage",
                            "refs": [
                                "https://complianceadministrators.com/ppaca-preventive-care-coverage-requirements/",
                                "http://kff.org/health-reform/fact-sheet/preventive-services-covered-by-private-health-plans/#endnote_link_160040-3."
                            ]
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Evaluating incremental benefits",
                    "section_content": [
                        {
                            "sentence": "Evaluating the incremental benefits of preventive care requires a longer period of time when compared to acutely ill patients",
                            "refs": []
                        },
                        {
                            "sentence": "Inputs into the model such as discounting rate and time horizon can have significant effects on the results",
                            "refs": []
                        },
                        {
                            "sentence": "One controversial subject is use of a 10-year time frame to assess cost effectiveness of diabetes preventive services by the Congressional Budget Office",
                            "refs": []
                        },
                        {
                            "sentence": "Preventive care services mainly focus on chronic disease",
                            "refs": []
                        },
                        {
                            "sentence": "The Congressional Budget Office has provided guidance that further research is needed in the area of the economic impacts of obesity in the U.S",
                            "refs": [
                                "https://www.cbo.gov/publication/50877"
                            ]
                        },
                        {
                            "sentence": "before the CBO can estimate budgetary consequences",
                            "refs": []
                        },
                        {
                            "sentence": "A bipartisan report published in May 2015 recognizes the potential of preventive care to improve patients' health at individual and population levels while decreasing the healthcare expenditure",
                            "refs": []
                        }
                    ],
                    "subsections": []
                },
                {
                    "section_title": "Economic case",
                    "section_content": [],
                    "subsections": [
                        {
                            "section_title": "Mortality from modifiable risk factors",
                            "section_content": [
                                {
                                    "sentence": "Chronic diseases such as heart disease, stroke, diabetes, obesity and cancer have become the most common and costly health problems in the United States",
                                    "refs": []
                                },
                                {
                                    "sentence": "In 2014, it was projected that by 2023 that the number of chronic disease cases would increase by 42%, resulting in $4.2 trillion in treatment and lost economic output",
                                    "refs": []
                                },
                                {
                                    "sentence": "They are also among the top ten leading causes of mortality",
                                    "refs": [
                                        "https://web.archive.org/web/20170228113729/http://assets1c.milkeninstitute.org/assets/Publication/ResearchReport/PDF/Checkup-Time-Chronic-Disease-and-Wellness-in-America.pdf"
                                    ]
                                },
                                {
                                    "sentence": "Chronic diseases are driven by risk factors that are largely preventable",
                                    "refs": [
                                        "https://www.cdc.gov/healthreport/publications/compendium.pdf"
                                    ]
                                },
                                {
                                    "sentence": "Sub-analysis performed on all deaths in the United States in 2000 revealed that almost half were attributed to preventable behaviors including tobacco, poor diet, physical inactivity and alcohol consumption",
                                    "refs": []
                                },
                                {
                                    "sentence": "More recent analysis reveals that heart disease and cancer alone accounted for nearly 46% of all deaths",
                                    "refs": [
                                        "https://doi.org/10.1001%2Fjama.291.10.1238"
                                    ]
                                },
                                {
                                    "sentence": "Modifiable risk factors are also responsible for a large morbidity burden, resulting in poor quality of life in the present and loss of future life earning years",
                                    "refs": [
                                        "https://web.archive.org/web/20140302181339/https://www.cdc.gov/chronicdisease/overview/index.htm"
                                    ]
                                },
                                {
                                    "sentence": "It is further estimated that by 2023, focused efforts on the prevention and treatment of chronic disease may result in 40 million fewer chronic disease cases, potentially reducing treatment costs by $220 billion",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Childhood vaccinations",
                            "section_content": [
                                {
                                    "sentence": "Childhood immunizations are largely responsible for the increase in life expectancy in the 20th century",
                                    "refs": []
                                },
                                {
                                    "sentence": "From an economic standpoint, childhood vaccines demonstrate a very high return on investment",
                                    "refs": []
                                },
                                {
                                    "sentence": "According to Healthy People 2020, for every birth cohort that receives the routine childhood vaccination schedule, direct health care costs are reduced by $9.9 billion and society saves $33.4 billion in indirect costs",
                                    "refs": [
                                        "https://doi.org/10.1001%2Fjama.291.10.1238"
                                    ]
                                },
                                {
                                    "sentence": "The economic benefits of childhood vaccination extend beyond individual patients to insurance plans and vaccine manufacturers, all while improving the health of the population",
                                    "refs": [
                                        "https://www.healthypeople.gov/2020/topics-objectives/topic/immunization-and-infectious-diseases"
                                    ]
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Health capital theory",
                            "section_content": [
                                {
                                    "sentence": "The burden of preventable illness extends beyond the healthcare sector, incurring costs related to lost productivity among workers in the workforce",
                                    "refs": []
                                },
                                {
                                    "sentence": "Indirect costs related to poor health behaviors and associated chronic disease costs U.S",
                                    "refs": []
                                },
                                {
                                    "sentence": "employers billions of dollars each year",
                                    "refs": []
                                },
                                {
                                    "sentence": "[citation needed]",
                                    "refs": []
                                },
                                {
                                    "sentence": "According to the American Diabetes Association (ADA),  medical costs for employees with diabetes are twice as high as for workers without diabetes and are caused by work-related absenteeism ($5 billion), reduced productivity at work ($20.8 billion), inability to work due to illness-related disability ($21.6 billion), and premature mortality ($18.5 billion)",
                                    "refs": [
                                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3609540"
                                    ]
                                },
                                {
                                    "sentence": "Reported estimates of the cost burden due to increasingly high levels of overweight and obese members in the workforce vary,  with best estimates suggesting 450 million more missed work days, resulting in $153 billion each year in lost productivity, according to the CDC Healthy Workforce",
                                    "refs": [
                                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5640019"
                                    ]
                                },
                                {
                                    "sentence": "The health capital model explains how individual investments in health can increase earnings by \"increasing the number of healthy days available to work and to earn income.\"  In this context, health can be treated both as a consumption good, wherein individuals desire health because it improves quality of life in the present, and as an investment good because of its potential to increase attendance and workplace productivity over time",
                                    "refs": [
                                        "[ERROR retrieving ref link]"
                                    ]
                                },
                                {
                                    "sentence": "Preventive health behaviors such as healthful diet, regular exercise, access to and use of well-care, avoiding tobacco, and limiting alcohol can be viewed as health inputs that result in both a healthier workforce and substantial cost savings",
                                    "refs": []
                                },
                                {
                                    "sentence": "[citation needed]",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Quality-adjusted life years",
                            "section_content": [
                                {
                                    "sentence": "Health benefits of preventive care measures can be described in terms of quality-adjusted life-years (QALYs) saved",
                                    "refs": []
                                },
                                {
                                    "sentence": "A QALY takes into account length and quality of life, and is used to evaluate the cost-effectiveness of medical and preventive interventions",
                                    "refs": []
                                },
                                {
                                    "sentence": "Classically, one year of perfect health is defined as 1 QALY and a year with any degree of less than perfect health is assigned a value between 0 and 1 QALY",
                                    "refs": []
                                },
                                {
                                    "sentence": "As an economic weighting system, the QALY can be used to inform personal decisions, to evaluate preventive interventions and to set priorities for future preventive efforts",
                                    "refs": [
                                        "https://www.rwjf.org/content/dam/farm/reports/issue_briefs/2009/rwjf46045"
                                    ]
                                },
                                {
                                    "sentence": "[citation needed]",
                                    "refs": []
                                },
                                {
                                    "sentence": "Cost-saving and cost-effective benefits of preventive care measures are well established",
                                    "refs": []
                                },
                                {
                                    "sentence": "The Robert Wood Johnson Foundation evaluated the prevention cost-effectiveness literature, and found that many preventive measures meet the benchmark of <$100,000 per QALY and are considered to be favorably cost-effective",
                                    "refs": []
                                },
                                {
                                    "sentence": "These include screenings for HIV and chlamydia, cancers of the colon, breast and cervix, vision screening, and screening for abdominal aortic aneurysms in men >60 in certain populations",
                                    "refs": []
                                },
                                {
                                    "sentence": "Alcohol and tobacco screening were found to be cost-saving in some reviews and cost-effective in others",
                                    "refs": []
                                },
                                {
                                    "sentence": "According to the RWJF analysis, two preventive interventions were found to save costs in all reviews: childhood immunizations and counseling adults on the use of aspirin",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Minority populations",
                            "section_content": [
                                {
                                    "sentence": "Health disparities are increasing in the United States for chronic diseases such as obesity, diabetes, cancer, and cardiovascular disease",
                                    "refs": []
                                },
                                {
                                    "sentence": "Populations at heightened risk for health inequities are the growing proportion of racial and ethnic minorities, including African Americans, American Indians, Hispanics/Latinos, Asian Americans, Alaska Natives and Pacific Islanders",
                                    "refs": []
                                },
                                {
                                    "sentence": "According to the Racial and Ethnic Approaches to Community Health (REACH), a national CDC program, non-Hispanic blacks currently have the highest rates of obesity (48%), and risk of newly diagnosed diabetes is 77% higher among non-Hispanic blacks, 66% higher among Hispanics/Latinos and 18% higher among Asian Americans compared to non-Hispanic whites",
                                    "refs": []
                                },
                                {
                                    "sentence": "Current U.S",
                                    "refs": []
                                },
                                {
                                    "sentence": "population projections predict that more than half of Americans will belong to a minority group by 2044",
                                    "refs": []
                                },
                                {
                                    "sentence": "Without targeted preventive interventions, medical costs from chronic disease inequities will become unsustainable",
                                    "refs": [
                                        "https://census.gov/content/dam/Census/library/publications/2015/demo/p25-1143.pdf"
                                    ]
                                },
                                {
                                    "sentence": "Broadening health policies designed to improve delivery of preventive services for minority populations may help reduce substantial medical costs caused by inequities in health care, resulting in a return on investment",
                                    "refs": []
                                },
                                {
                                    "sentence": "[citation needed]",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Policies",
                            "section_content": [
                                {
                                    "sentence": "Chronic disease is a population level issue that requires population health level efforts and national and state level public policy to effectively prevent, rather than individual level efforts",
                                    "refs": []
                                },
                                {
                                    "sentence": "The United States currently employs many public health policy efforts aligned with the preventive health efforts discussed above",
                                    "refs": []
                                },
                                {
                                    "sentence": "The Centers for Disease Control and Prevention support initiatives such as Health in All Policies and HI-5 (Health Impact in 5 Years), and collaborative efforts that aim to consider prevention across sectors  and address social determinants of health as a method of primary prevention for chronic disease",
                                    "refs": [
                                        "https://www.cdc.gov/policy/hiap/index.html"
                                    ]
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Obesity",
                            "section_content": [
                                {
                                    "sentence": "Policies that address the obesity epidemic should be proactive and far-reaching, including a variety of stakeholders both in healthcare and in other sectors",
                                    "refs": []
                                },
                                {
                                    "sentence": "Recommendations from the Institute of Medicine in 2012 suggest that \"concerted action be taken across and within five environments (physical activity (PA), food and beverage, marketing and messaging, healthcare and worksites, and schools) and all sectors of society (including government, business and industry, schools, child care, urban planning, recreation, transportation, media, public health, agriculture, communities, and home) in order for obesity prevention efforts to truly be successful.\"",
                                    "refs": [
                                        "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3916087"
                                    ]
                                },
                                {
                                    "sentence": "There are dozens of current policies acting at either (or all of) the federal, state, local and school levels",
                                    "refs": []
                                },
                                {
                                    "sentence": "Most states employ a physical education requirement of 150 minutes of physical education per week at school, a policy of the National Association of Sport and Physical Education",
                                    "refs": []
                                },
                                {
                                    "sentence": "In some cities, including Philadelphia, a sugary food tax is employed",
                                    "refs": []
                                },
                                {
                                    "sentence": "This is a part of an amendment to Title 19 of the Philadelphia Code, \"Finance, Taxes and Collections\", Chapter 19-4100, Sugar-Sweetened Beverage Tax that was approved 2016, which establishes an excise tax of $0.015 per fluid ounce on distributors of beverages sweetened with both caloric and non-caloric sweeteners",
                                    "refs": []
                                },
                                {
                                    "sentence": "Distributors are required to file a return with the department, and the department can collect taxes, among other responsibilities",
                                    "refs": [
                                        "https://beta.phila.gov/media/20170209150802/CertifiedCopy16017601-1.pdf"
                                    ]
                                },
                                {
                                    "sentence": "These policies can be a source of tax credits",
                                    "refs": []
                                },
                                {
                                    "sentence": "Under the Philadelphia policy, businesses can apply for tax credits with the revenue department on a first-come, first-served basis",
                                    "refs": []
                                },
                                {
                                    "sentence": "This applies until the total amount of credits for a particular year reaches one million dollars",
                                    "refs": []
                                },
                                {
                                    "sentence": "Recently, advertisements for food and beverages directed at children have received much attention",
                                    "refs": []
                                },
                                {
                                    "sentence": "The Children's Food and Beverage Advertising Initiative (CFBAI) is a self-regulatory program of the food industry",
                                    "refs": []
                                },
                                {
                                    "sentence": "Each participating company makes a public pledge that details its commitment to advertise only foods that meet certain nutritional criteria to children under 12 years old",
                                    "refs": []
                                },
                                {
                                    "sentence": "This is a self-regulated program with policies written by the Council of Better Business Bureaus",
                                    "refs": [
                                        "https://bbbprograms.org/programs/all-programs/cfbai"
                                    ]
                                },
                                {
                                    "sentence": "The Robert Wood Johnson Foundation funded research to test the efficacy of the CFBAI",
                                    "refs": []
                                },
                                {
                                    "sentence": "The results showed progress in terms of decreased advertising of food products that target children and adolescents",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        },
                        {
                            "section_title": "Childhood immunization policies",
                            "section_content": [
                                {
                                    "sentence": "Despite nationwide controversies over childhood vaccination and immunization, there are policies and programs at the federal, state, local and school levels outlining vaccination requirements",
                                    "refs": []
                                },
                                {
                                    "sentence": "All states require children to be vaccinated against certain communicable diseases as a condition for school attendance",
                                    "refs": []
                                },
                                {
                                    "sentence": "However, only 18 states allow exemptions for \"philosophical or moral reasons.\" Diseases for which vaccinations form part of the standard ACIP vaccination schedule are diphtheria tetanus pertussis (whooping cough), poliomyelitis (polio), measles, mumps, rubella, haemophilus influenzae type b, hepatitis B, influenza, and pneumococcal infections",
                                    "refs": []
                                },
                                {
                                    "sentence": "The CDC website maintains such schedules",
                                    "refs": [
                                        "https://www.immunize.org/laws/"
                                    ]
                                },
                                {
                                    "sentence": "The CDC website describes a federally funded program, Vaccines for Children (VFC), which provides vaccines at no cost to children who might not otherwise be vaccinated because of inability to pay",
                                    "refs": []
                                },
                                {
                                    "sentence": "Additionally, the Advisory Committee on Immunization Practices (ACIP) is an expert vaccination advisory board that informs vaccination policy and guides on-going recommendations to the CDC, incorporating the most up-to-date cost-effectiveness and risk-benefit evidence in its recommendations",
                                    "refs": []
                                }
                            ],
                            "subsections": []
                        }
                    ]
                }
            ]
        },
        {
            "section_title": "See also",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "References",
            "section_content": [],
            "subsections": []
        },
        {
            "section_title": "External links",
            "section_content": [],
            "subsections": []
        }
    ],
    "references": {
        "1": "[ERROR retrieving ref link]",
        "2": "http://primalprevention.org",
        "3": "http://primalhealthresearch.com/glossary.php",
        "4": "https://doi.org/10.1001%2Fjama.291.10.1238",
        "5": "https://www.who.int/news-room/fact-sheets/detail/the-top-10-causes-of-death",
        "6": "https://medicalnewsbulletin.com/smoking-critical-our-health-smart-dont-start/",
        "7": "https://doi.org/10.1007%2Fs00103-018-2825-9",
        "8": "https://doi.org/10.3109%2F09687637.2013.798264",
        "9": "https://www.independent.com.mt/articles/2018-09-12/local-news/Be-Smart-Don-t-Start-campaign-launched-to-deter-youths-from-smoking-6736196247",
        "10": "https://medlineplus.gov/encyclopedia.html",
        "11": "https://doi.org/10.1377%2Fhlthaff.2008.0701",
        "12": "https://doi.org/10.1056%2Fnejmp0708558",
        "13": "[ERROR retrieving ref link]",
        "14": "[ERROR retrieving ref link]",
        "15": "[ERROR retrieving ref link]",
        "16": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4349501",
        "17": "https://doi.org/10.1093%2Fije%2Fdyv102",
        "18": "https://web.archive.org/web/20100827091640/http://www.iom.edu/~/media/Files/Activity%20Files/Quality/IntegrativeMed/Preventive%20Medicine%20Integrative%20Medicine%20and%20the%20Health%20of%20the%20Public.pdf",
        "19": "https://doi.org/10.1016%2Fs0140-6736%2895%2990119-1",
        "20": "[ERROR retrieving ref link]",
        "21": "http://www.primalprevention.org",
        "22": "[ERROR retrieving ref link]",
        "23": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3923653",
        "24": "[ERROR retrieving ref link]",
        "25": "https://doi.org/10.1016%2Fj.it.2015.09.009",
        "26": "[ERROR retrieving ref link]",
        "27": "https://doi.org/10.1016/j.cppeds.2015.12.008",
        "28": "https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2764067",
        "29": "https://books.google.com/books?id=7gPNCwAAQBAJ&pg=PA9",
        "30": "https://chlpi.org/wp-content/uploads/2013/12/Food-is-Prevention-Report-July-2015.pdf",
        "31": "https://www.theatlantic.com/health/archive/2014/04/access-to-good-food-as-preventive-medicine/360049",
        "32": "http://www.foodispower.org/food-deserts",
        "33": "http://www.greenthumbnyc.org",
        "34": "https://web.archive.org/web/20151120001336/http://www.wilder.org/Programs-Services/tcmm/Pages/default.aspx",
        "35": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9089818",
        "36": "https://doi.org/10.3390%2Fchemosensors10010022",
        "37": "https://www.aana.com/docs/default-source/practice-aana-com-web-documents-(all)/professional-practice-manual/infection-prevention-and-control-guidelines-for-anesthesia-care.pdf?sfvrsn=850049b1_4",
        "38": "https://doi.org/10.1213%2FANE.0000000000005169",
        "39": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7453066",
        "40": "https://web.archive.org/web/20120222170737/https://www.cdc.gov/excite/skincancer/mod13.htm",
        "41": "https://doi.org/10.1016%2Fs0140-6736%2806%2968770-9",
        "42": "https://doi.org/10.1016%2FS2542-5196%2822%2900090-0",
        "43": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7449554",
        "44": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8204267",
        "45": "https://doi.org/10.1016%2Fs0140-6736%2812%2960560-1",
        "46": "[ERROR retrieving ref link]",
        "47": "https://doi.org/10.1016%2Fs0140-6736%2803%2913811-1",
        "48": "https://doi.org/10.1038%2Fsj.ijo.0801938",
        "49": "https://www.niddk.nih.gov/about-niddk/research-areas/diabetes/diabetes-prevention-program-dpp",
        "50": "https://www.merriam-webster.com/dictionary/prophylactic",
        "51": "https://www.cdc.gov/std/stats13/syphilis.htm",
        "52": "https://books.google.com/books?id=Sir5L1Gz23EC&q=genetically+modified+disease&pg=PA235",
        "53": "https://doi.org/10.1016%2Fs0140-6736%2813%2962224-2",
        "54": "https://doi.org/10.1016%2Fs1040-8428%2899%2900074-8",
        "55": "https://doi.org/10.1016%2FS0749-2081%2896%2980024-6",
        "56": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1759517",
        "57": "https://doi.org/10.1111%2Fj.1440-1843.2011.02062.x",
        "58": "https://doi.org/10.1016%2Fj.ypmed.2006.01.002",
        "59": "[ERROR retrieving ref link]",
        "60": "https://doi.org/10.1093%2Fheapro%2Fdah310",
        "61": "https://doi.org/10.5694%2Fj.1326-5377.1991.tb121157.x",
        "62": "https://doi.org/10.1111%2Fj.1440-0960.1991.tb00676.x",
        "63": "https://doi.org/10.1016%2F0091-7435%2892%2990072-p",
        "64": "https://doi.org/10.1046%2Fj.1365-4362.2002.01412.x",
        "65": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2566667",
        "66": "ISBN: 978-92-832-0432-9",
        "67": "https://www.who.int/mediacentre/factsheets/fs297/en/",
        "68": "http://www.cobiss.si/scripts/cobiss?command=DISPLAY&base=cobib&rid=1537267652&fmt=11",
        "69": "http://www.clevelandclinicmeded.com/medicalpubs/diseasemanagement/gastroenterology/colorectal-neoplasia/",
        "70": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7392084",
        "71": "https://web.archive.org/web/20161017004117/http://www.who.int/mental_health/neurology/dementia/action_plan_consultation/en/",
        "72": "https://coghealth.net.au/",
        "73": "https://web.archive.org/web/20170203142124/http://www.who.int/mental_health/neurology/dementia/GDO/en/",
        "74": "https://kclpure.kcl.ac.uk/portal/en/publications/potential-for-primary-prevention-of-alzheimers-disease(ea066697-4ace-4d6f-b23e-95ea546f968a).html",
        "75": "https://www.who.int/mediacentre/factsheets/fs362/en/",
        "76": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6628594",
        "77": "https://www.ahrq.gov/qual/nhqrdr11/nhqrdrminority11.htm",
        "78": "https://doi.org/10.1353%2Fhpu.2011.0037",
        "79": "https://web.archive.org/web/20111109005506/http://www.who.int/sdhconference/background/news/facts/en/",
        "80": "https://doi.org/10.1093%2Fheapol%2Fczr038",
        "81": "https://www.ncbi.nlm.nih.gov/books/NBK53914/",
        "82": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5746244",
        "83": "https://doi.org/10.13140%2FRG.2.1.1225.6803",
        "84": "https://web.archive.org/web/20150528205913/http://www.usnews.com/opinion/blogs/policy-dose/2015/05/28/focus-on-prevention-to-cut-us-health-care-costs",
        "85": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5551483",
        "86": "https://doi.org/10.1377%2Fhlthaff.2009.0626",
        "87": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1447707",
        "88": "https://www.apha.org/~/media/files/pdf/factsheets/170125_pphf.ashx",
        "89": "https://www.hhs.gov/healthcare/about-the-aca/preventive-care/index.html",
        "90": "http://www.childsworld.ca.gov/res/pdf/Pathway.pdf",
        "91": "https://doi.org/10.1002%2Fhec.1370",
        "92": "https://doi.org/10.1016%2Fj.jhealeco.2004.11.009",
        "93": "http://www.nber.org/papers/w1269.pdf",
        "94": "https://doi.org/10.1093%2Fgeronb%2F58.1.S2",
        "95": "http://www.keepeek.com/Digital-Asset-Management/oecd/social-issues-migration-health/obesity-and-the-economics-of-prevention_9789264084865-en",
        "96": "https://doi.org/10.1056%2Fnejm199307293290511",
        "97": "https://doi.org/10.1016%2Fj.amepre.2006.03.012",
        "98": "[ERROR retrieving ref link]",
        "99": "https://ui.adsabs.harvard.edu/abs/1978NYASA.304..424W",
        "100": "[ERROR retrieving ref link]",
        "101": "https://doi.org/10.1001%2Fjama.265.9.1145",
        "102": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3308273",
        "103": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9508900",
        "104": "https://doi.org/10.1016%2Fj.amepre.2015.02.005",
        "105": "https://doi.org/10.1016%2Fj.amepre.2015.03.016",
        "106": "https://doi.org/10.1002%2Fhec.3211",
        "107": "https://doi.org/10.1002%2Fhec.1714",
        "108": "https://doi.org/10.1006%2Fpmed.1993.1014",
        "109": "http://www.rwjf.org/content/dam/farm/reports/issue_briefs/2009/rwjf46045/subassets/rwjf46045_1",
        "110": "http://eprints.lse.ac.uk/55659/",
        "111": "https://search.worldcat.org/oclc/973090310",
        "112": "http://www.econ.jku.at/papers/2012/wp1201.pdf",
        "113": "https://doi.org/10.1055%2Fs-0032-1316439",
        "114": "[ERROR retrieving ref link]",
        "115": "https://www.acpjournals.org/doi/10.7326/M22-0737",
        "116": "[ERROR retrieving ref link]",
        "117": "https://doi.org/10.1108%2FS1049-2585%282013%290000021013",
        "118": "https://web.archive.org/web/20160110135937/https://www.cdc.gov/healthcommunication/toolstemplates/entertainmented/tips/preventivehealth.html",
        "119": "https://www.uspreventiveservicestaskforce.org/uspstf/recommendation-topics/uspstf-and-b-recommendations",
        "120": "https://web.archive.org/web/20160310020717/https://www.uspreventiveservicestaskforce.org/Page/Name/reports-to-congress",
        "121": "https://www.cdc.gov/reproductivehealth/maternalinfanthealth/pqc.htm",
        "122": "https://web.archive.org/web/20170803200511/http://www.telehealthpolicy.us/reports-and-policy-briefs",
        "123": "https://doi.org/10.1016%2Fj.ypmed.2015.03.023",
        "124": "https://doi.org/10.1097%2Fmlr.0b013e3181f28be4",
        "125": "https://doi.org/10.1111%2Fj.1539-6975.2010.01371.x",
        "126": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3001814",
        "127": "https://www.jstor.org/stable/23320884",
        "128": "[ERROR retrieving ref link]",
        "129": "https://www.cms.gov/CCIIO/Resources/Fact-Sheets-and-FAQs/aca_implementation_faqs12",
        "130": "https://complianceadministrators.com/ppaca-preventive-care-coverage-requirements/",
        "131": "http://kff.org/health-reform/fact-sheet/preventive-services-covered-by-private-health-plans/#endnote_link_160040-3.",
        "132": "https://www.unitedhealthcareonline.com/ccmcontent/ProviderII/UHC/en-US/Assets/ProviderStaticFiles/ProviderStaticFilesPdf/Tools%20and%20Resources/Policies%20and%20P",
        "133": "http://www.fightchronicdisease.org/sites/default/files/docs/PFCD_whitepaper5.21.09_0.pdf",
        "134": "https://www.cbo.gov/publication/50877",
        "135": "http://bipartisanpolicy.org/wp-content/uploads/2015/05/BPC-Prevention-Prescription-Report.pdf",
        "136": "https://web.archive.org/web/20170228113729/http://assets1c.milkeninstitute.org/assets/Publication/ResearchReport/PDF/Checkup-Time-Chronic-Disease-and-Wellness-in-America.pdf",
        "137": "https://www.cdc.gov/healthreport/publications/compendium.pdf",
        "138": "https://web.archive.org/web/20140302181339/https://www.cdc.gov/chronicdisease/overview/index.htm",
        "139": "https://www.healthypeople.gov/2020/topics-objectives/topic/immunization-and-infectious-diseases",
        "140": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4558933",
        "141": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3609540",
        "142": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5640019",
        "143": "http://www.cdcfoundation.org/businesspulse-series",
        "144": "[ERROR retrieving ref link]",
        "145": "https://www.rwjf.org/content/dam/farm/reports/issue_briefs/2009/rwjf46045",
        "146": "https://www.rwjf.org/en/library/research/2009/09/cost-savings-and-cost-effectiveness-of-clinical-preventive-care.html",
        "147": "http://www.astho.org/Programs/Health-Equity/Economic-Case-Issue-Brief/",
        "148": "https://census.gov/content/dam/Census/library/publications/2015/demo/p25-1143.pdf",
        "149": "https://www.cdc.gov/policy/hiap/index.html",
        "150": "https://www.cdc.gov/policy/hst/hi5/index.html",
        "151": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3916087",
        "152": "https://beta.phila.gov/media/20170209150802/CertifiedCopy16017601-1.pdf",
        "153": "https://healthyfoodpolicyproject.org/policy/philadelphia-penn-code-tit-chapter-19-4100-current-through-nov-7-2017",
        "154": "https://bbbprograms.org/programs/all-programs/cfbai",
        "155": "http://www.uconnruddcenter.org/files/TVAdTrends2017.pdf",
        "156": "https://www.immunize.org/laws/",
        "157": "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent.html",
        "158": "https://www.cdc.gov/vaccines/acip/index.html"
    },
    "flair_entities": [
        "organisation for economic co-operation and development",
        "lle",
        "tv ad",
        "hispanic",
        "telemedicine",
        "medicare",
        "hiv",
        "costa rica",
        "vaccines for children",
        "wuhan",
        "qalys",
        "obamacare",
        "racial and ethnic approaches to community health",
        "canada",
        "colombia",
        "goldston",
        "national network of perinatal quality collaboratives",
        "pakistan",
        "cuba",
        "china",
        "center for connected health policy",
        "national association of sport and physical education",
        "leavell",
        "cdc",
        "pe",
        "europe",
        "ada",
        "african americans",
        "childhood obesity intervention cost-effectiveness study",
        "health in all policies and hi-5",
        "americans",
        "ruth a",
        "telehealth",
        "centers for disease control",
        "ssb",
        "bmi",
        "chile",
        "western",
        "democratic republic of the congo",
        "sub-saharan africa",
        "asia",
        "latin america",
        "primal health research centre",
        "affordable care act",
        "the prevention and public health fund",
        "vfc",
        "american diabetes association",
        "ppe",
        "centers for disease control and prevention",
        "aca",
        "robert wood johnson foundation",
        "unitedhealthcare",
        "council of better business bureaus",
        "japan",
        "memorial sloan-kettering",
        "uspstf",
        "iceland",
        "etzel",
        "hugh r",
        "ece",
        "hispanics",
        "nigeria",
        "cbo",
        "ahrq",
        "oecd",
        "congressional budget office",
        "congress",
        "asian americans",
        "massachusetts",
        "cohen",
        "preventive services task force",
        "diabetes prevention program research group",
        "peru",
        "healthy people 2020",
        "southeast asia",
        "national health interview survey",
        "who",
        "acip",
        "nnpqc",
        "asian",
        "mayo clinic",
        "qaly",
        "millennium development goal",
        "u.s",
        "uv-a",
        "finland",
        "sti",
        "cdc healthy workforce",
        "alaska natives",
        "reach",
        "harvard and columbia university schools of public health",
        "puerto rico",
        "international labour organization",
        "switzerland",
        "american indians",
        "patient protection and affordable care act",
        "children's food and beverage advertising initiative",
        "malawi",
        "u.s.",
        "world health organization",
        "london",
        "u.s. preventive services task force",
        "brazil",
        "india",
        "africa",
        "african-americans",
        "institute of medicine",
        "australian",
        "cfbai",
        "philadelphia",
        "rwjf",
        "myanmar",
        "pacific islanders",
        "agency for healthcare research and quality",
        "stis",
        "australia",
        "the national telehealth policy resource center",
        "philadelphia code",
        "sara josephine baker",
        "title 19",
        "gortmaker",
        "gurney clark",
        "s.l.",
        "advisory committee on immunization practices",
        "australians",
        "journal of the american medical association",
        "truvada",
        "johns hopkins",
        "latinos",
        "cea",
        "norway",
        "united states"
    ]
}